{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<cls>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<sep>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "(\\[[^\\]]+]|Br?|Cl?|N|O|S|P|F|I|b|c|n|o|s|p|\\(|\\)|\\.|=|#|-|\\+|\\\\|\\/|:|~|@|\\?|>>?|\\*|\\$|\\%[0-9]{2}|[0-9])"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<cls>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<cls>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<cls>": {
        "id": "<cls>",
        "ids": [
          0
        ],
        "tokens": [
          "<cls>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          2
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": true,
    "vocab": {
      "<cls>": 0,
      "<pad>": 1,
      "<eos>": 2,
      "<unk>": 3,
      "<mask>": 4,
      "<sep>": 5,
      ">>": 6,
      "~": 7,
      "C": 8,
      "c": 9,
      "(": 10,
      ")": 11,
      "O": 12,
      "1": 13,
      "2": 14,
      "=": 15,
      "N": 16,
      "3": 17,
      "n": 18,
      "[C@H]": 19,
      "[C@@H]": 20,
      "4": 21,
      "F": 22,
      "[NH+]": 23,
      "S": 24,
      "o": 25,
      "Cl": 26,
      "s": 27,
      "[nH]": 28,
      "5": 29,
      "[NH2+]": 30,
      "#": 31,
      "/": 32,
      "Br": 33,
      "[C@@]": 34,
      "[C@]": 35,
      "[O-]": 36,
      "\\": 37,
      "[nH+]": 38,
      "[NH3+]": 39,
      "6": 40,
      "[n-]": 41,
      "-": 42,
      ".": 43,
      "I": 44,
      "7": 45,
      "[N+]": 46,
      "P": 47,
      "[N-]": 48,
      "[Si]": 49,
      "[2H]": 50,
      "8": 51,
      "[n+]": 52,
      "[H]": 53,
      "B": 54,
      "9": 55,
      "[c-]": 56,
      "[C-]": 57,
      "[S-]": 58,
      "[HH]": 59,
      "[Na+]": 60,
      "[B]": 61,
      "[S@]": 62,
      "[S@@]": 63,
      "[Cl-]": 64,
      "[CH]": 65,
      "%10": 66,
      "[Y]": 67,
      "[Ir]": 68,
      "[S+]": 69,
      "[P+]": 70,
      "%11": 71,
      "[C]": 72,
      "[Br-]": 73,
      "[SiH]": 74,
      "[CH-]": 75,
      "[CH2-]": 76,
      "[SiH2]": 77,
      "[IH2]": 78,
      "[CH3-]": 79,
      "[K+]": 80,
      "[I-]": 81,
      "[3H]": 82,
      "%12": 83,
      "[Se]": 84,
      "[Pt+2]": 85,
      "[Sn]": 86,
      "[Li+]": 87,
      "[cH-]": 88,
      "[Pt]": 89,
      "[V]": 90,
      "[SiH3]": 91,
      "[NH-]": 92,
      "[B-]": 93,
      "%13": 94,
      "[OH-]": 95,
      "[P@@]": 96,
      "[O+]": 97,
      "[P@]": 98,
      "[W]": 99,
      "[H-]": 100,
      "[Ge]": 101,
      "[se]": 102,
      "%14": 103,
      "[PH+]": 104,
      "[Mg+2]": 105,
      "[K]": 106,
      "[Al]": 107,
      "[CH2]": 108,
      "%15": 109,
      "[Zn+2]": 110,
      "[U]": 111,
      "[Co]": 112,
      "[O]": 113,
      "[Rb]": 114,
      "[NH4+]": 115,
      "[Zr+2]": 116,
      "p": 117,
      "[Pd+2]": 118,
      "[Pd]": 119,
      "[Ir+3]": 120,
      "[Ti]": 121,
      "[Cl+3]": 122,
      "[F-]": 123,
      "%16": 124,
      "[Fe]": 125,
      "[Fe+2]": 126,
      "[P-]": 127,
      "[OH+]": 128,
      "[Zr]": 129,
      "[s+]": 130,
      "[Ru]": 131,
      "[N@+]": 132,
      "[Ac]": 133,
      "[Cu]": 134,
      "[C+]": 135,
      "[Ca+2]": 136,
      "[N@@+]": 137,
      "[O-2]": 138,
      "[Zn]": 139,
      "[I+]": 140,
      "[Rf]": 141,
      "[18F]": 142,
      "[Cu+2]": 143,
      "%17": 144,
      "[OH2+]": 145,
      "[2HH]": 146,
      "[Ni]": 147,
      "[As]": 148,
      "[Te]": 149,
      "[Na]": 150,
      "[13CH2]": 151,
      "[13C]": 152,
      "[Tb]": 153,
      "%18": 154,
      "[NH2-]": 155,
      "[Ni+2]": 156,
      "[Cr]": 157,
      "[Cs+]": 158,
      "[Zr+4]": 159,
      "[Ar]": 160,
      "[SH+]": 161,
      "%19": 162,
      "[o+]": 163,
      "[H+]": 164,
      "[Ru+2]": 165,
      "[Zn+]": 166,
      "[Rb+]": 167,
      "[Sb]": 168,
      "[Cu+]": 169,
      "%20": 170,
      "[Ti+4]": 171,
      "[W+2]": 172,
      "[Hg]": 173,
      "[Mn]": 174,
      "[13CH3]": 175,
      "[Al+3]": 176,
      "[Mo]": 177,
      "[CH2+]": 178,
      "[Co+2]": 179,
      "%21": 180,
      "%22": 181,
      "[Hf]": 182,
      "[CH+]": 183,
      "[Rh]": 184,
      "[Re]": 185,
      "%23": 186,
      "[3HH]": 187,
      "[Y+3]": 188,
      "[Ti+2]": 189,
      "[Hf+4]": 190,
      "[PH]": 191,
      "[Ba+2]": 192,
      "[c]": 193,
      "[Ag]": 194,
      "[In]": 195,
      "[Ag+]": 196,
      "[Pb]": 197,
      "[SH2+]": 198,
      "[13CH]": 199,
      "[Pt+4]": 200,
      "[13c]": 201,
      "[Bi]": 202,
      "[13cH]": 203,
      "[Li]": 204,
      "[SH-]": 205,
      "[V+2]": 206,
      "%24": 207,
      "[Mn+2]": 208,
      "[Tl]": 209,
      "[Si-]": 210,
      "[Os]": 211,
      "%25": 212,
      "[U+2]": 213,
      "[14cH]": 214,
      "[Ga]": 215,
      "[Fe+3]": 216,
      "[AlH2]": 217,
      "[Sn+2]": 218,
      "[15NH]": 219,
      "[N]": 220,
      "[Ru+]": 221,
      "[BH3-]": 222,
      "[14C]": 223,
      "[AlH]": 224,
      "[Pd+]": 225,
      "[Ti+3]": 226,
      "[AlH3]": 227,
      "[Au]": 228,
      "%26": 229,
      "[11CH3]": 230,
      "[CH3+]": 231,
      "[Cd]": 232,
      "[PH2+]": 233,
      "[Sn+]": 234,
      "[Gd+3]": 235,
      "[pH]": 236,
      "[14c]": 237,
      "[125I]": 238,
      "%27": 239,
      "[SeH]": 240,
      "[Co+3]": 241,
      "[te]": 242,
      "b": 243,
      "[PH3+]": 244,
      "[2H-]": 245,
      "[15N]": 246,
      "%28": 247,
      "[OH3+]": 248,
      "[Zr+3]": 249,
      "[Ru+3]": 250,
      "[Cr+3]": 251,
      "[Sr+2]": 252,
      "[BH2-]": 253,
      "[14CH2]": 254,
      "[Au+]": 255,
      "[ClH+]": 256,
      "[123I]": 257,
      "%29": 258,
      "[13C@H]": 259,
      "%30": 260,
      "[Rh+2]": 261,
      "[Ca]": 262,
      "[13C@@H]": 263,
      "[IH+]": 264,
      "%31": 265,
      "[cH+]": 266,
      "%32": 267,
      "[Au+3]": 268,
      "[18O]": 269,
      "[Hg+]": 270,
      "[Cd+2]": 271,
      "[Eu]": 272,
      "[Gd]": 273,
      "%33": 274,
      "[Mg]": 275,
      "[S-2]": 276,
      "[Be+2]": 277,
      "[AsH]": 278,
      "[S@@+]": 279,
      "%34": 280,
      "[Ta]": 281,
      "[S@+]": 282,
      "[Al+]": 283,
      "[GeH]": 284,
      "[Pt+]": 285,
      "[SnH]": 286,
      "[La]": 287,
      "[Nb]": 288,
      "[Sb-]": 289,
      "[Fe+]": 290,
      "[GeH2]": 291,
      "[Pr]": 292,
      "[15n]": 293,
      "[15NH2]": 294,
      "%35": 295,
      "%36": 296,
      "[Mo+2]": 297,
      "[Si@@]": 298,
      "[Mn+3]": 299,
      "[Ti+]": 300,
      "[Se-]": 301,
      "[Si@]": 302,
      "[PH-]": 303,
      "[Ce]": 304,
      "[Ce+3]": 305,
      "[Cr+2]": 306,
      "[Fe+4]": 307,
      "[14CH3]": 308,
      "[La+3]": 309,
      "%37": 310,
      "[Os+2]": 311,
      "[SiH4]": 312,
      "%38": 313,
      "[As+]": 314,
      "[Al+2]": 315,
      "[Sb+3]": 316,
      "[131I]": 317,
      "[Cl+2]": 318,
      "[Nd]": 319,
      "[Ni+3]": 320,
      "[3H-]": 321,
      "[BH-]": 322,
      "[Rh+3]": 323,
      "%39": 324,
      "%40": 325,
      "[Nd+3]": 326,
      "[Se+]": 327,
      "[Bi+3]": 328,
      "[I+3]": 329,
      "[Sn+4]": 330,
      "[Sm]": 331,
      "[Hf+2]": 332,
      "%41": 333,
      "[Mo+4]": 334,
      "[Sn+3]": 335,
      "[11C]": 336,
      "%42": 337,
      "[Si+]": 338,
      "[Os+]": 339,
      "[Pb+2]": 340,
      "[Eu+3]": 341,
      "%43": 342,
      "%44": 343,
      "[GeH3]": 344,
      "[BH4-]": 345,
      "[Ga+3]": 346,
      "[Po]": 347,
      "[In+3]": 348,
      "[Al-]": 349,
      "[Cl+]": 350,
      "$": 351,
      "[14C@@H]": 352,
      "[Sc]": 353,
      "[Fe+6]": 354,
      "[Yb]": 355,
      "%45": 356,
      "%46": 357,
      "[14CH]": 358,
      "[c+]": 359,
      "[At]": 360,
      "[Ru+4]": 361,
      "[PH4+]": 362,
      "[Si+4]": 363,
      "[BiH2]": 364,
      "[NH]": 365,
      "[Hg+2]": 366,
      "[p+]": 367,
      "[Ba]": 368,
      "%47": 369,
      "%48": 370,
      "[14C@H]": 371,
      "[Ir+2]": 372,
      "[SiH-]": 373,
      "[I+2]": 374,
      "[GaH]": 375,
      "[18OH]": 376,
      "[AsH2]": 377,
      "[Tc]": 378,
      "[SnH3]": 379,
      "[Sc+3]": 380,
      "[SH3+]": 381,
      "[99Tc+4]": 382,
      "[124I]": 383,
      "[SnH2]": 384,
      "%49": 385,
      "[10B]": 386,
      "[Cs]": 387,
      "[BH]": 388,
      "[Ru+6]": 389,
      "[OH]": 390,
      "%50": 391,
      "[1H]": 392,
      "[Cr+6]": 393,
      "[Ta+5]": 394,
      "[Lu]": 395,
      "[Cr+]": 396,
      "[SbH]": 397,
      "[N@]": 398,
      "[Fm]": 399,
      "[Nb+5]": 400,
      "[Yb+3]": 401,
      "%51": 402,
      "%52": 403,
      "[Er]": 404,
      "[IH2+]": 405,
      "[Sg]": 406,
      "[Sm+3]": 407,
      "[Os+4]": 408,
      "[99Tc]": 409,
      "[Tl+]": 410,
      "[Fe+5]": 411,
      "[17O]": 412,
      "[N@@]": 413,
      "[Br+2]": 414,
      "%53": 415,
      "[10BH2]": 416,
      "[NaH]": 417,
      "[Ho]": 418,
      "[PH2-]": 419,
      "[13C@@]": 420,
      "[As-]": 421,
      "[15N+]": 422,
      "%54": 423,
      "[Se-2]": 424,
      "[15nH]": 425,
      "[Tb+3]": 426,
      "[si]": 427,
      "[Sr]": 428,
      "[se+]": 429,
      "[Th]": 430,
      "[Ru+5]": 431,
      "[No]": 432,
      "[13C@]": 433,
      "[99Tc+3]": 434,
      "[Te+]": 435,
      "[Xe]": 436,
      "[Lu+3]": 437,
      "[Dy]": 438,
      "[He]": 439,
      "%55": 440,
      "[Pr+3]": 441,
      "%56": 442,
      "[ClH2+]": 443,
      "%57": 444,
      "%58": 445,
      "[V+4]": 446,
      "[19F]": 447,
      "%59": 448,
      "%60": 449,
      "[Nb+2]": 450,
      "[B+]": 451,
      "[Co+]": 452,
      "[32P]": 453,
      "[Tc+4]": 454,
      "[76Br]": 455,
      "[P]": 456,
      "[Ce+4]": 457,
      "[Dy+3]": 458,
      "[Bi+2]": 459,
      "[Li-]": 460,
      "[BiH]": 461,
      "[SbH2]": 462,
      "[Er+3]": 463,
      "[TeH]": 464,
      "[Th+4]": 465,
      "[Ta+2]": 466,
      "[Cr+4]": 467,
      "[Tm]": 468,
      "[RuH]": 469,
      "[Tm+3]": 470,
      "%61": 471,
      "%62": 472,
      "[Sb+]": 473,
      "[p-]": 474,
      "[11CH2]": 475,
      "[211At]": 476,
      "%63": 477,
      "[RuH+2]": 478,
      "[Tc+3]": 479,
      "[Eu+2]": 480,
      "[Ga-]": 481,
      "[12C]": 482,
      "[GaH2]": 483,
      "[b-]": 484,
      "[S]": 485,
      "[Mo+3]": 486,
      "[InH2]": 487,
      "[Si+2]": 488,
      "[InH]": 489,
      "[18F-]": 490,
      "[Si-2]": 491,
      "[P-3]": 492,
      "[Bk]": 493,
      "[sH+]": 494,
      "%64": 495,
      "[PbH]": 496,
      "[Sn-]": 497,
      "[Pm]": 498,
      "[Cm]": 499,
      "[pH+]": 500,
      "[Cr+5]": 501,
      "%65": 502,
      "%66": 503,
      "[Lr]": 504,
      "[Pu]": 505,
      "[Ne]": 506,
      "[SH]": 507,
      "[64Cu]": 508,
      "[siH]": 509,
      "[Np]": 510,
      "[Bi+]": 511,
      "[te+]": 512,
      "[SbH3]": 513,
      "[Yb+2]": 514,
      "[AsH3]": 515,
      "[Be]": 516,
      "[Tc+5]": 517,
      "[oH+]": 518,
      "[P@@H]": 519,
      "[SeH2]": 520,
      "[XeH]": 521,
      "[Mn+]": 522,
      "[Ir-3]": 523,
      "%67": 524,
      "[As+3]": 525,
      "[Th+2]": 526,
      "[PoH]": 527,
      "%68": 528,
      "[17OH]": 529,
      "[IH]": 530,
      "[Mg+]": 531,
      "[Pa]": 532,
      "[Ir+]": 533,
      "[Os+6]": 534,
      "[Rh+]": 535,
      "[Gd+2]": 536,
      "[P-2]": 537,
      "[TlH]": 538,
      "%69": 539,
      "[U+4]": 540,
      "[PH-2]": 541,
      "[15n+]": 542,
      "[Ra]": 543,
      "[Am]": 544,
      "[Cf]": 545,
      "[64Cu+2]": 546,
      "[Ho+3]": 547,
      "[SiH2-]": 548,
      "[13C-]": 549,
      "[16O]": 550,
      "%70": 551,
      "[GeH4]": 552,
      "[Au-]": 553,
      "[BH2]": 554,
      "[n@]": 555,
      "[Si@H]": 556,
      "[35S]": 557,
      "[Ru-]": 558,
      "[RuH2]": 559,
      "[11c]": 560,
      "[AlH4-]": 561,
      "[U+3]": 562,
      "[Db]": 563,
      "[12CH2]": 564,
      "[3H+]": 565,
      "[77Br]": 566,
      "[SiH+]": 567,
      "[Co-2]": 568,
      "[Br+]": 569,
      "[Si+3]": 570,
      "[TlH2]": 571,
      "[BH3]": 572,
      "[P@+]": 573,
      "[Pt-2]": 574,
      "[12CH]": 575,
      "[Br+3]": 576,
      "[Os+5]": 577,
      "%71": 578,
      "[W+]": 579,
      "[AsH2+]": 580,
      "[BiH3]": 581,
      "[Es]": 582,
      "[RuH+3]": 583,
      "[Fe-]": 584,
      "[CuH]": 585,
      "[al]": 586,
      "[111In]": 587,
      "%72": 588,
      "[14C@]": 589,
      "[P@H]": 590,
      "[11CH]": 591,
      "[CH3]": 592,
      "[18O-]": 593,
      "[Mo+]": 594,
      "[35Cl]": 595,
      "[P@@+]": 596,
      "[Hg-2]": 597,
      "[Si@@H]": 598,
      "[ClH]": 599,
      "%73": 600,
      "%74": 601,
      "[14C@@]": 602,
      "[B@-]": 603,
      "[InH3]": 604,
      "[14n]": 605,
      "[Nb+3]": 606,
      "[Os+7]": 607,
      "[15NH3+]": 608,
      "[37Cl]": 609,
      "[B@@-]": 610,
      "[Ru+8]": 611,
      "[NiH]": 612,
      "[Cu-]": 613,
      "[Zn-2]": 614,
      "[Rn]": 615,
      "[GaH3]": 616,
      "[Mt]": 617,
      "[68Ga]": 618,
      "[PbH2]": 619,
      "[In+]": 620,
      "[18FH]": 621,
      "[RuH+]": 622,
      "[10BH]": 623,
      "[10BH-]": 624,
      "%75": 625,
      "%76": 626,
      "[PH2]": 627,
      "[13CH4]": 628,
      "[14NH]": 629,
      "[Sn@]": 630,
      "[TeH2]": 631,
      "[68Ga+3]": 632,
      "[Kr]": 633,
      "[11C-]": 634,
      "[Sb+5]": 635,
      "[177Lu]": 636,
      "[PbH2+2]": 637,
      "[s@@]": 638,
      "[s@]": 639,
      "[Tl+3]": 640,
      "[Ir-2]": 641,
      "[AlH2-]": 642,
      "[IrH+2]": 643,
      "[2H+]": 644,
      "[RuH2+2]": 645,
      "[Zn-]": 646,
      "[Tc+2]": 647,
      "[Pd-2]": 648,
      "[AsH3+]": 649,
      "[90Y]": 650,
      "[RuH3]": 651,
      "[AlH-]": 652,
      "[Ni+]": 653,
      "[10B-]": 654,
      "[Nb-]": 655,
      "[AlH+2]": 656,
      "[99Tc+5]": 657,
      "[18O-2]": 658,
      "[Sn@@]": 659,
      "[SH2]": 660,
      "[127I]": 661,
      "[Cu-2]": 662,
      "[AlH2+]": 663,
      "[16OH]": 664,
      "[PtH]": 665,
      "[80Br]": 666,
      "[14N]": 667,
      "[14nH]": 668,
      "[SnH4+2]": 669,
      "[MgH2]": 670,
      "[SeH+]": 671,
      "[99Mo]": 672,
      "*": 673,
      "[ClH2+2]": 674,
      "[6Li+]": 675,
      "[34S]": 676,
      "[si+]": 677,
      "[AlH+]": 678,
      "[AsH+]": 679,
      "[99Tc+2]": 680,
      "[OsH]": 681,
      "[188Re]": 682,
      "[SnH2+]": 683,
      "[98Tc+5]": 684,
      "[67Cu]": 685,
      "%77": 686,
      "%78": 687,
      "[123I-]": 688,
      "[125I-]": 689,
      "[17F]": 690,
      "[Ni-2]": 691,
      "[Ni-]": 692,
      "[AlH3-]": 693,
      "[Bh]": 694,
      "[111In+3]": 695,
      "[186Re]": 696,
      "[12C@@H]": 697,
      "[WH2]": 698,
      "[7Li+]": 699,
      "[Tc+]": 700,
      "[15N-]": 701,
      "[13CH2-]": 702,
      "[Pd-]": 703,
      "[SnH+]": 704,
      "[SnH+3]": 705,
      "[Al-3]": 706,
      "[131I-]": 707,
      "[SiH3-]": 708,
      "[124I-]": 709,
      "[Os-2]": 710,
      "[PbH3]": 711,
      "[SiH3+]": 712,
      "[12C@H]": 713,
      "[si-]": 714,
      "[GeH2-]": 715,
      "[bH-]": 716,
      "[MoH2]": 717,
      "[166Ho+3]": 718,
      "[Tb+4]": 719,
      "[13CH-]": 720,
      "[11B]": 721,
      "%79": 722,
      "%80": 723,
      "%81": 724,
      "%82": 725,
      "%83": 726,
      "%84": 727,
      "%85": 728,
      "[OsH2]": 729,
      "[B@]": 730,
      "[B@@]": 731,
      "[75Se]": 732,
      "[13NH3]": 733,
      "[Ge+4]": 734,
      "[Hg-]": 735,
      "[Ru-2]": 736,
      "[PoH2]": 737,
      "[SiH2+]": 738,
      "[I]": 739,
      "[67Ga+3]": 740,
      "[Tc+6]": 741,
      "[Fr]": 742,
      "[Md]": 743,
      "[SbH3+]": 744,
      "[RhH3]": 745,
      "[Pt-]": 746,
      "[177Lu+3]": 747,
      "[SeH2+]": 748,
      "[15n-]": 749,
      "[33P]": 750,
      "[77Se]": 751,
      "[67Cu+2]": 752,
      "[28Si]": 753,
      "[12cH]": 754,
      "[15NH+]": 755,
      "[P@@H+]": 756,
      "[133Xe]": 757,
      "[Fe-4]": 758,
      "[Cl]": 759,
      "[F]": 760,
      "[Te+4]": 761,
      "[14CH4]": 762,
      "[NH2]": 763,
      "[12C@]": 764,
      "[IrH2]": 765,
      "[15NH3]": 766,
      "[125Te]": 767,
      "[Ge@@]": 768,
      "[Ru-3]": 769,
      "[Te@@]": 770,
      "[35SH]": 771,
      "[TaH]": 772,
      "[13OH]": 773,
      "[99Tc+]": 774,
      "[14c-]": 775,
      "[PtH2]": 776,
      "[PtH+]": 777,
      "[153Gd]": 778,
      "[17NH]": 779,
      "[11C@H]": 780,
      "[60Co+3]": 781,
      "[RhH+2]": 782,
      "%86": 783,
      "[Ca+]": 784,
      "[ZrH2]": 785,
      "[n@@]": 786,
      "[32PH]": 787,
      "[123IH]": 788,
      "[Zr-2]": 789,
      "[Rh-3]": 790,
      "[SnH4]": 791,
      "[SnH3-]": 792,
      "[SnH3+]": 793,
      "[AtH]": 794,
      "[Se+4]": 795,
      "[51Cr]": 796,
      "[Hs]": 797,
      "[18OH2]": 798,
      "[153Sm]": 799,
      "[241Am]": 800,
      "[19BH2]": 801,
      "[12CH3]": 802,
      "[IrH3]": 803,
      "[IrH4]": 804,
      "[WH4]": 805,
      "[CuH2]": 806,
      "[SbH-]": 807,
      "[SbH2+]": 808,
      "[13CH3-]": 809,
      "[FeH]": 810,
      "[195Pt]": 811,
      "[79Br]": 812,
      "[ReH4]": 813,
      "[WH]": 814,
      "[HgH]": 815,
      "[IrH]": 816,
      "[90Y+3]": 817,
      "[14C-]": 818,
      "[Rh-]": 819,
      "[Re-2]": 820,
      "[BiH2+2]": 821,
      "[36Cl]": 822,
      "[99Tc+6]": 823,
      "[14NH2]": 824,
      "[Ti-2]": 825,
      "[13N]": 826,
      "[15NH2+]": 827,
      "[W-]": 828,
      "[164Dy+3]": 829,
      "[RuH4]": 830,
      "[al+]": 831,
      "[89Zr+4]": 832,
      "[BH2+]": 833,
      "[125IH]": 834,
      "[CaH2]": 835,
      "[11C@@H]": 836,
      "[127Xe]": 837,
      "[82Rb+]": 838,
      "[81Kr]": 839,
      "[LiH]": 840,
      "[223Ra]": 841,
      "[85Sr+2]": 842,
      "[47Ca+2]": 843,
      "[KH]": 844,
      "[Cr-2]": 845,
      "[TeH2+]": 846,
      "[SeH-]": 847,
      "[SeH3+]": 848,
      "[TeH+]": 849,
      "[TeH3]": 850,
      "[AsH5]": 851,
      "[BiH5]": 852,
      "[BiH4-]": 853,
      "[PbH4]": 854,
      "[As+5]": 855,
      "[220Rn]": 856,
      "[11CH4]": 857,
      "[32PH3]": 858,
      "[57Fe]": 859,
      "[60Co]": 860,
      "[Se+6]": 861,
      "[166Ho]": 862,
      "[Al-2]": 863,
      "[12BH2]": 864,
      "[14N+]": 865,
      "[15NH4+]": 866,
      "[13NH2]": 867,
      "[SnH2-]": 868,
      "[OsH-]": 869,
      "[BrH]": 870,
      "[15OH]": 871,
      "[Be+]": 872,
      "[13N+]": 873,
      "[CoH2]": 874,
      "[19FH]": 875,
      "[15CH2]": 876,
      "[4He]": 877,
      "[68GaH]": 878,
      "[133I]": 879,
      "[Se@@]": 880,
      "[WH3]": 881,
      "[ZrH]": 882,
      "[213Bi+3]": 883,
      "[TaH3]": 884,
      "[MoH]": 885,
      "[SnH2+2]": 886,
      "[Ge-2]": 887,
      "[FeH2]": 888,
      "[Os+8]": 889,
      "[82Br]": 890,
      "[121I]": 891,
      "[35s]": 892,
      "[Cr-]": 893,
      "[62Cu+2]": 894,
      "[15C]": 895,
      "[122I]": 896,
      "[ReH]": 897,
      "[TaH2]": 898,
      "[RhH]": 899,
      "[RhH2]": 900,
      "[ZnH2]": 901,
      "[11B-]": 902,
      "[13CH+]": 903,
      "[Pr+]": 904,
      "[KrH]": 905,
      "[75Ge]": 906,
      "[YH]": 907,
      "%87": 908,
      "%88": 909,
      "%89": 910,
      "%90": 911,
      "%91": 912,
      "%92": 913,
      "[13O]": 914,
      "[67Ga]": 915,
      "[CoH+]": 916,
      "[TiH]": 917,
      "[89Zr]": 918,
      "[31PH]": 919,
      "[VH]": 920,
      "[GeH3-]": 921,
      "[Ru-4]": 922,
      "[103Pd]": 923,
      "[CeH]": 924,
      "[NiH2]": 925,
      "[197Au]": 926,
      "[81Br]": 927,
      "[ZrH3]": 928,
      "[ZnH+]": 929,
      "[S@@-]": 930,
      "[S@@H]": 931,
      "[SnH6+3]": 932,
      "[Te-]": 933,
      "[135I]": 934,
      "[73Se]": 935,
      "[129Xe]": 936,
      "[89Sr+2]": 937,
      "[N@H+]": 938,
      "[42K+]": 939,
      "[123Te]": 940,
      "[22Na+]": 941,
      "[SrH2]": 942,
      "[15OH2]": 943,
      "[85SrH2]": 944,
      "[45Ca+2]": 945,
      "[Ag-4]": 946,
      "[82Rb]": 947,
      "[76BrH]": 948,
      "[131Cs]": 949,
      "0": 950,
      "[Cd-2]": 951,
      "[Cr-3]": 952,
      "[Fe-3]": 953,
      "[Ni-3]": 954,
      "[Fe-2]": 955,
      "[AsH3-]": 956,
      "[AsH4+]": 957,
      "[BH3+]": 958,
      "[SeH3]": 959,
      "[TeH3+]": 960,
      "[TeH4]": 961,
      "[SbH4+]": 962,
      "[SbH5]": 963,
      "[BH4+]": 964,
      "[203Hg]": 965,
      "[TlH3]": 966,
      "[Br]": 967,
      "[59Fe+3]": 968,
      "[219Rn]": 969,
      "[Mo-2]": 970,
      "[FeH6-4]": 971,
      "[33PH3]": 972,
      "[32SH2]": 973,
      "[34SH2]": 974,
      "[36SH2]": 975,
      "[65Zn]": 976,
      "[113Cd]": 977,
      "[192Ir]": 978,
      "[237Np]": 979,
      "[240Pu]": 980,
      "[227Ac]": 981,
      "[18CH3]": 982,
      "[31P]": 983,
      "[FeH3]": 984,
      "[15O]": 985,
      "[111InH3]": 986,
      "[22CH3-]": 987,
      "[CoH+2]": 988,
      "[201Hg]": 989,
      "[12CH-]": 990,
      "[16N+]": 991,
      "[12N+]": 992,
      "[9cH]": 993,
      "[20CH3]": 994,
      "[GaH-]": 995,
      "[13NH]": 996,
      "[22CH2]": 997,
      "[AlH5-2]": 998,
      "[10CH2]": 999,
      "[11CH3+]": 1000,
      "[195Pt+2]": 1001,
      "[18C-]": 1002,
      "[18CH]": 1003,
      "[20C]": 1004,
      "[15CH]": 1005,
      "[9c]": 1006,
      "[10BH3]": 1007,
      "[GeH6-2]": 1008,
      "[153Gd+3]": 1009,
      "[RuH5]": 1010,
      "[BiH4]": 1011,
      "[CoH3]": 1012,
      "[Se@]": 1013,
      "[OsH6]": 1014,
      "[80Br-]": 1015,
      "[CeH3]": 1016,
      "[37ClH]": 1017,
      "[Bi-]": 1018,
      "[OsH4]": 1019,
      "[157Gd+3]": 1020,
      "[14CH3-]": 1021,
      "[64Zn+2]": 1022,
      "[Nb-2]": 1023,
      "[Os-]": 1024,
      "[165Dy]": 1025,
      "[BiH2+]": 1026,
      "[1H-]": 1027,
      "[3He]": 1028,
      "[137Cs+]": 1029,
      "[153Sm+3]": 1030,
      "[152Dy]": 1031,
      "[165Dy+3]": 1032,
      "[198Au]": 1033,
      "[159Gd+3]": 1034,
      "[94Tc]": 1035,
      "[217At]": 1036,
      "[105Rh+3]": 1037,
      "[18o]": 1038,
      "[14CH2-]": 1039,
      "[77se]": 1040,
      "[13cH-]": 1041,
      "[85Br]": 1042,
      "[59Co]": 1043,
      "[122Xe]": 1044,
      "[27Al]": 1045,
      "[7Li]": 1046,
      "[54Cr]": 1047,
      "[198Hg]": 1048,
      "[42K]": 1049,
      "[76Br-]": 1050,
      "[52Mn+2]": 1051,
      "[64Ga]": 1052,
      "[13B]": 1053,
      "[216Bi]": 1054,
      "[71As]": 1055,
      "[201Tl]": 1056,
      "[117Sn+2]": 1057,
      "[11cH]": 1058,
      "[Mn-2]": 1059,
      "[232Th]": 1060,
      "[SnH+2]": 1061,
      "[11CH3-]": 1062,
      "[197Hg]": 1063,
      "[51Cr+3]": 1064,
      "[57Co]": 1065,
      "[203Pb]": 1066,
      "[NbH2]": 1067,
      "[149Pm]": 1068,
      "[77Kr]": 1069,
      "[103Cd]": 1070,
      "[62Ni]": 1071,
      "[NbH3]": 1072,
      "[ReH3]": 1073,
      "[AlH6-3]": 1074,
      "[CrH2]": 1075,
      "[LaH3]": 1076,
      "[SmH3]": 1077,
      "[EuH3]": 1078,
      "[OsH3]": 1079,
      "[MoH5]": 1080,
      "[64Ni]": 1081,
      "[Ge@]": 1082,
      "[66Zn]": 1083,
      "[68Zn]": 1084,
      "[Ge-]": 1085,
      "[PdH2]": 1086,
      "[10c]": 1087,
      "[Tc+7]": 1088,
      "[Co-3]": 1089,
      "[29Si]": 1090,
      "[209Po]": 1091,
      "[208Po]": 1092,
      "[206Po]": 1093,
      "[204Po]": 1094,
      "[202Po]": 1095,
      "[201Po]": 1096,
      "[200Po]": 1097,
      "[199Po]": 1098,
      "[198Po]": 1099,
      "[197Po]": 1100,
      "[196Po]": 1101,
      "[195Po]": 1102,
      "[194Po]": 1103,
      "[193Po]": 1104,
      "[192Po]": 1105,
      "[191Po]": 1106,
      "[190Po]": 1107,
      "[217Po]": 1108,
      "[12C-]": 1109,
      "[12c]": 1110,
      "[SbH4]": 1111,
      "[BH+]": 1112,
      "[225Ac]": 1113,
      "[6Li]": 1114,
      "[38PH]": 1115,
      "[33PH]": 1116,
      "[40PH]": 1117,
      "[16NH]": 1118,
      "[Zr+]": 1119,
      "[PtH3]": 1120,
      "[AuH3]": 1121,
      "[XeH2]": 1122,
      "[ScH3]": 1123,
      "[10C]": 1124,
      "[ZrH2+2]": 1125,
      "[AgH]": 1126,
      "[16n+]": 1127,
      "[15nH+]": 1128,
      "[68GaH3]": 1129,
      "[18c]": 1130,
      "[17OH2]": 1131,
      "[16NH2]": 1132,
      "[8B]": 1133,
      "[PdH+]": 1134,
      "[AuH]": 1135,
      "[239Th]": 1136,
      "[186Lu]": 1137,
      "[1C@@H]": 1138,
      "[1C@H]": 1139,
      "[SH3]": 1140,
      "[S@H]": 1141,
      "[AlH4]": 1142,
      "[P+3]": 1143,
      "[Mn+4]": 1144,
      "[Pb+4]": 1145,
      "[V+5]": 1146,
      "[Ag-]": 1147,
      "[B+3]": 1148,
      "[Pb+3]": 1149,
      "[S+2]": 1150,
      "[N-3]": 1151,
      "[S+4]": 1152,
      "[Ag+2]": 1153,
      "[PH3]": 1154,
      "[Sm+2]": 1155,
      "[PH5]": 1156,
      "[C-4]": 1157,
      "[N+3]": 1158,
      "[Ir-]": 1159,
      "[C+4]": 1160,
      "[V+3]": 1161,
      "[W+6]": 1162,
      "[Ti+6]": 1163,
      "[Nd+]": 1164,
      "[Hf+3]": 1165,
      "[W+4]": 1166,
      "[LaH]": 1167,
      "[Ga+]": 1168,
      "[IH-]": 1169,
      "[U+6]": 1170,
      "[F+]": 1171,
      "[Ag+3]": 1172,
      "[PH4]": 1173,
      "[Na-]": 1174,
      "[Sb+2]": 1175,
      "[Ce+2]": 1176,
      "[Pd+3]": 1177,
      "[Cu+3]": 1178,
      "[Pd+4]": 1179,
      "[Ba+]": 1180,
      "[BrH+]": 1181,
      "[In+2]": 1182,
      "[N+2]": 1183,
      "[N@@H+]": 1184,
      "[Na-2]": 1185,
      "[Ti+5]": 1186,
      "[ArH]": 1187,
      "[SH5]": 1188,
      "[B+2]": 1189,
      "[NH3+2]": 1190,
      "[Tl+2]": 1191,
      "[Cd+]": 1192,
      "[FH+2]": 1193,
      "[Mo+6]": 1194,
      "[BaH2]": 1195,
      "[BaH]": 1196,
      "[229Th]": 1197,
      "[NH+3]": 1198,
      "[7NaH]": 1199,
      "[PtH+2]": 1200,
      "[Re+5]": 1201,
      "[Xe+]": 1202,
      "[Rh+4]": 1203,
      "[AcH]": 1204,
      "[HeH]": 1205,
      "[Sc+2]": 1206,
      "[UH]": 1207,
      "[SiH4+]": 1208,
      "[Ac-]": 1209,
      "[Re+4]": 1210,
      "[118Sn]": 1211,
      "[P+2]": 1212,
      "[9CH]": 1213,
      "[9CH3]": 1214,
      "[Y-]": 1215,
      "[Mn+6]": 1216,
      "[C-2]": 1217,
      "[Bi+5]": 1218,
      "[24NaH]": 1219,
      "[CuH2-]": 1220,
      "[Nb+4]": 1221,
      "[MgH]": 1222,
      "[Ir+4]": 1223,
      "[2NH]": 1224,
      "[Cn]": 1225
    },
    "merges": []
  }
}