<cls>
<pad>
<eos>
<unk>
<mask>
<sep>
>>
~
C
c
(
)
O
1
2
=
N
3
n
[C@H]
[C@@H]
4
F
[NH+]
S
o
Cl
s
[nH]
5
[NH2+]
#
/
Br
[C@@]
[C@]
[O-]
\
[nH+]
[NH3+]
6
[n-]
-
.
I
7
[N+]
P
[N-]
[Si]
[2H]
8
[n+]
[H]
B
9
[c-]
[C-]
[S-]
[HH]
[Na+]
[B]
[S@]
[S@@]
[Cl-]
[CH]
%10
[Y]
[Ir]
[S+]
[P+]
%11
[C]
[Br-]
[SiH]
[CH-]
[CH2-]
[SiH2]
[IH2]
[CH3-]
[K+]
[I-]
[3H]
%12
[Se]
[Pt+2]
[Sn]
[Li+]
[cH-]
[Pt]
[V]
[SiH3]
[NH-]
[B-]
%13
[OH-]
[P@@]
[O+]
[P@]
[W]
[H-]
[Ge]
[se]
%14
[PH+]
[Mg+2]
[K]
[Al]
[CH2]
%15
[Zn+2]
[U]
[Co]
[O]
[Rb]
[NH4+]
[Zr+2]
p
[Pd+2]
[Pd]
[Ir+3]
[Ti]
[Cl+3]
[F-]
%16
[Fe]
[Fe+2]
[P-]
[OH+]
[Zr]
[s+]
[Ru]
[N@+]
[Ac]
[Cu]
[C+]
[Ca+2]
[N@@+]
[O-2]
[Zn]
[I+]
[Rf]
[18F]
[Cu+2]
%17
[OH2+]
[2HH]
[Ni]
[As]
[Te]
[Na]
[13CH2]
[13C]
[Tb]
%18
[NH2-]
[Ni+2]
[Cr]
[Cs+]
[Zr+4]
[Ar]
[SH+]
%19
[o+]
[H+]
[Ru+2]
[Zn+]
[Rb+]
[Sb]
[Cu+]
%20
[Ti+4]
[W+2]
[Hg]
[Mn]
[13CH3]
[Al+3]
[Mo]
[CH2+]
[Co+2]
%21
%22
[Hf]
[CH+]
[Rh]
[Re]
%23
[3HH]
[Y+3]
[Ti+2]
[Hf+4]
[PH]
[Ba+2]
[c]
[Ag]
[In]
[Ag+]
[Pb]
[SH2+]
[13CH]
[Pt+4]
[13c]
[Bi]
[13cH]
[Li]
[SH-]
[V+2]
%24
[Mn+2]
[Tl]
[Si-]
[Os]
%25
[U+2]
[14cH]
[Ga]
[Fe+3]
[AlH2]
[Sn+2]
[15NH]
[N]
[Ru+]
[BH3-]
[14C]
[AlH]
[Pd+]
[Ti+3]
[AlH3]
[Au]
%26
[11CH3]
[CH3+]
[Cd]
[PH2+]
[Sn+]
[Gd+3]
[pH]
[14c]
[125I]
%27
[SeH]
[Co+3]
[te]
b
[PH3+]
[2H-]
[15N]
%28
[OH3+]
[Zr+3]
[Ru+3]
[Cr+3]
[Sr+2]
[BH2-]
[14CH2]
[Au+]
[ClH+]
[123I]
%29
[13C@H]
%30
[Rh+2]
[Ca]
[13C@@H]
[IH+]
%31
[cH+]
%32
[Au+3]
[18O]
[Hg+]
[Cd+2]
[Eu]
[Gd]
%33
[Mg]
[S-2]
[Be+2]
[AsH]
[S@@+]
%34
[Ta]
[S@+]
[Al+]
[GeH]
[Pt+]
[SnH]
[La]
[Nb]
[Sb-]
[Fe+]
[GeH2]
[Pr]
[15n]
[15NH2]
%35
%36
[Mo+2]
[Si@@]
[Mn+3]
[Ti+]
[Se-]
[Si@]
[PH-]
[Ce]
[Ce+3]
[Cr+2]
[Fe+4]
[14CH3]
[La+3]
%37
[Os+2]
[SiH4]
%38
[As+]
[Al+2]
[Sb+3]
[131I]
[Cl+2]
[Nd]
[Ni+3]
[3H-]
[BH-]
[Rh+3]
%39
%40
[Nd+3]
[Se+]
[Bi+3]
[I+3]
[Sn+4]
[Sm]
[Hf+2]
%41
[Mo+4]
[Sn+3]
[11C]
%42
[Si+]
[Os+]
[Pb+2]
[Eu+3]
%43
%44
[GeH3]
[BH4-]
[Ga+3]
[Po]
[In+3]
[Al-]
[Cl+]
$
[14C@@H]
[Sc]
[Fe+6]
[Yb]
%45
%46
[14CH]
[c+]
[At]
[Ru+4]
[PH4+]
[Si+4]
[BiH2]
[NH]
[Hg+2]
[p+]
[Ba]
%47
%48
[14C@H]
[Ir+2]
[SiH-]
[I+2]
[GaH]
[18OH]
[AsH2]
[Tc]
[SnH3]
[Sc+3]
[SH3+]
[99Tc+4]
[124I]
[SnH2]
%49
[10B]
[Cs]
[BH]
[Ru+6]
[OH]
%50
[1H]
[Cr+6]
[Ta+5]
[Lu]
[Cr+]
[SbH]
[N@]
[Fm]
[Nb+5]
[Yb+3]
%51
%52
[Er]
[IH2+]
[Sg]
[Sm+3]
[Os+4]
[99Tc]
[Tl+]
[Fe+5]
[17O]
[N@@]
[Br+2]
%53
[10BH2]
[NaH]
[Ho]
[PH2-]
[13C@@]
[As-]
[15N+]
%54
[Se-2]
[15nH]
[Tb+3]
[si]
[Sr]
[se+]
[Th]
[Ru+5]
[No]
[13C@]
[99Tc+3]
[Te+]
[Xe]
[Lu+3]
[Dy]
[He]
%55
[Pr+3]
%56
[ClH2+]
%57
%58
[V+4]
[19F]
%59
%60
[Nb+2]
[B+]
[Co+]
[32P]
[Tc+4]
[76Br]
[P]
[Ce+4]
[Dy+3]
[Bi+2]
[Li-]
[BiH]
[SbH2]
[Er+3]
[TeH]
[Th+4]
[Ta+2]
[Cr+4]
[Tm]
[RuH]
[Tm+3]
%61
%62
[Sb+]
[p-]
[11CH2]
[211At]
%63
[RuH+2]
[Tc+3]
[Eu+2]
[Ga-]
[12C]
[GaH2]
[b-]
[S]
[Mo+3]
[InH2]
[Si+2]
[InH]
[18F-]
[Si-2]
[P-3]
[Bk]
[sH+]
%64
[PbH]
[Sn-]
[Pm]
[Cm]
[pH+]
[Cr+5]
%65
%66
[Lr]
[Pu]
[Ne]
[SH]
[64Cu]
[siH]
[Np]
[Bi+]
[te+]
[SbH3]
[Yb+2]
[AsH3]
[Be]
[Tc+5]
[oH+]
[P@@H]
[SeH2]
[XeH]
[Mn+]
[Ir-3]
%67
[As+3]
[Th+2]
[PoH]
%68
[17OH]
[IH]
[Mg+]
[Pa]
[Ir+]
[Os+6]
[Rh+]
[Gd+2]
[P-2]
[TlH]
%69
[U+4]
[PH-2]
[15n+]
[Ra]
[Am]
[Cf]
[64Cu+2]
[Ho+3]
[SiH2-]
[13C-]
[16O]
%70
[GeH4]
[Au-]
[BH2]
[n@]
[Si@H]
[35S]
[Ru-]
[RuH2]
[11c]
[AlH4-]
[U+3]
[Db]
[12CH2]
[3H+]
[77Br]
[SiH+]
[Co-2]
[Br+]
[Si+3]
[TlH2]
[BH3]
[P@+]
[Pt-2]
[12CH]
[Br+3]
[Os+5]
%71
[W+]
[AsH2+]
[BiH3]
[Es]
[RuH+3]
[Fe-]
[CuH]
[al]
[111In]
%72
[14C@]
[P@H]
[11CH]
[CH3]
[18O-]
[Mo+]
[35Cl]
[P@@+]
[Hg-2]
[Si@@H]
[ClH]
%73
%74
[14C@@]
[B@-]
[InH3]
[14n]
[Nb+3]
[Os+7]
[15NH3+]
[37Cl]
[B@@-]
[Ru+8]
[NiH]
[Cu-]
[Zn-2]
[Rn]
[GaH3]
[Mt]
[68Ga]
[PbH2]
[In+]
[18FH]
[RuH+]
[10BH]
[10BH-]
%75
%76
[PH2]
[13CH4]
[14NH]
[Sn@]
[TeH2]
[68Ga+3]
[Kr]
[11C-]
[Sb+5]
[177Lu]
[PbH2+2]
[s@@]
[s@]
[Tl+3]
[Ir-2]
[AlH2-]
[IrH+2]
[2H+]
[RuH2+2]
[Zn-]
[Tc+2]
[Pd-2]
[AsH3+]
[90Y]
[RuH3]
[AlH-]
[Ni+]
[10B-]
[Nb-]
[AlH+2]
[99Tc+5]
[18O-2]
[Sn@@]
[SH2]
[127I]
[Cu-2]
[AlH2+]
[16OH]
[PtH]
[80Br]
[14N]
[14nH]
[SnH4+2]
[MgH2]
[SeH+]
[99Mo]
*
[ClH2+2]
[6Li+]
[34S]
[si+]
[AlH+]
[AsH+]
[99Tc+2]
[OsH]
[188Re]
[SnH2+]
[98Tc+5]
[67Cu]
%77
%78
[123I-]
[125I-]
[17F]
[Ni-2]
[Ni-]
[AlH3-]
[Bh]
[111In+3]
[186Re]
[12C@@H]
[WH2]
[7Li+]
[Tc+]
[15N-]
[13CH2-]
[Pd-]
[SnH+]
[SnH+3]
[Al-3]
[131I-]
[SiH3-]
[124I-]
[Os-2]
[PbH3]
[SiH3+]
[12C@H]
[si-]
[GeH2-]
[bH-]
[MoH2]
[166Ho+3]
[Tb+4]
[13CH-]
[11B]
%79
%80
%81
%82
%83
%84
%85
[OsH2]
[B@]
[B@@]
[75Se]
[13NH3]
[Ge+4]
[Hg-]
[Ru-2]
[PoH2]
[SiH2+]
[I]
[67Ga+3]
[Tc+6]
[Fr]
[Md]
[SbH3+]
[RhH3]
[Pt-]
[177Lu+3]
[SeH2+]
[15n-]
[33P]
[77Se]
[67Cu+2]
[28Si]
[12cH]
[15NH+]
[P@@H+]
[133Xe]
[Fe-4]
[Cl]
[F]
[Te+4]
[14CH4]
[NH2]
[12C@]
[IrH2]
[15NH3]
[125Te]
[Ge@@]
[Ru-3]
[Te@@]
[35SH]
[TaH]
[13OH]
[99Tc+]
[14c-]
[PtH2]
[PtH+]
[153Gd]
[17NH]
[11C@H]
[60Co+3]
[RhH+2]
%86
[Ca+]
[ZrH2]
[n@@]
[32PH]
[123IH]
[Zr-2]
[Rh-3]
[SnH4]
[SnH3-]
[SnH3+]
[AtH]
[Se+4]
[51Cr]
[Hs]
[18OH2]
[153Sm]
[241Am]
[19BH2]
[12CH3]
[IrH3]
[IrH4]
[WH4]
[CuH2]
[SbH-]
[SbH2+]
[13CH3-]
[FeH]
[195Pt]
[79Br]
[ReH4]
[WH]
[HgH]
[IrH]
[90Y+3]
[14C-]
[Rh-]
[Re-2]
[BiH2+2]
[36Cl]
[99Tc+6]
[14NH2]
[Ti-2]
[13N]
[15NH2+]
[W-]
[164Dy+3]
[RuH4]
[al+]
[89Zr+4]
[BH2+]
[125IH]
[CaH2]
[11C@@H]
[127Xe]
[82Rb+]
[81Kr]
[LiH]
[223Ra]
[85Sr+2]
[47Ca+2]
[KH]
[Cr-2]
[TeH2+]
[SeH-]
[SeH3+]
[TeH+]
[TeH3]
[AsH5]
[BiH5]
[BiH4-]
[PbH4]
[As+5]
[220Rn]
[11CH4]
[32PH3]
[57Fe]
[60Co]
[Se+6]
[166Ho]
[Al-2]
[12BH2]
[14N+]
[15NH4+]
[13NH2]
[SnH2-]
[OsH-]
[BrH]
[15OH]
[Be+]
[13N+]
[CoH2]
[19FH]
[15CH2]
[4He]
[68GaH]
[133I]
[Se@@]
[WH3]
[ZrH]
[213Bi+3]
[TaH3]
[MoH]
[SnH2+2]
[Ge-2]
[FeH2]
[Os+8]
[82Br]
[121I]
[35s]
[Cr-]
[62Cu+2]
[15C]
[122I]
[ReH]
[TaH2]
[RhH]
[RhH2]
[ZnH2]
[11B-]
[13CH+]
[Pr+]
[KrH]
[75Ge]
[YH]
%87
%88
%89
%90
%91
%92
[13O]
[67Ga]
[CoH+]
[TiH]
[89Zr]
[31PH]
[VH]
[GeH3-]
[Ru-4]
[103Pd]
[CeH]
[NiH2]
[197Au]
[81Br]
[ZrH3]
[ZnH+]
[S@@-]
[S@@H]
[SnH6+3]
[Te-]
[135I]
[73Se]
[129Xe]
[89Sr+2]
[N@H+]
[42K+]
[123Te]
[22Na+]
[SrH2]
[15OH2]
[85SrH2]
[45Ca+2]
[Ag-4]
[82Rb]
[76BrH]
[131Cs]
0
[Cd-2]
[Cr-3]
[Fe-3]
[Ni-3]
[Fe-2]
[AsH3-]
[AsH4+]
[BH3+]
[SeH3]
[TeH3+]
[TeH4]
[SbH4+]
[SbH5]
[BH4+]
[203Hg]
[TlH3]
[Br]
[59Fe+3]
[219Rn]
[Mo-2]
[FeH6-4]
[33PH3]
[32SH2]
[34SH2]
[36SH2]
[65Zn]
[113Cd]
[192Ir]
[237Np]
[240Pu]
[227Ac]
[18CH3]
[31P]
[FeH3]
[15O]
[111InH3]
[22CH3-]
[CoH+2]
[201Hg]
[12CH-]
[16N+]
[12N+]
[9cH]
[20CH3]
[GaH-]
[13NH]
[22CH2]
[AlH5-2]
[10CH2]
[11CH3+]
[195Pt+2]
[18C-]
[18CH]
[20C]
[15CH]
[9c]
[10BH3]
[GeH6-2]
[153Gd+3]
[RuH5]
[BiH4]
[CoH3]
[Se@]
[OsH6]
[80Br-]
[CeH3]
[37ClH]
[Bi-]
[OsH4]
[157Gd+3]
[14CH3-]
[64Zn+2]
[Nb-2]
[Os-]
[165Dy]
[BiH2+]
[1H-]
[3He]
[137Cs+]
[153Sm+3]
[152Dy]
[165Dy+3]
[198Au]
[159Gd+3]
[94Tc]
[217At]
[105Rh+3]
[18o]
[14CH2-]
[77se]
[13cH-]
[85Br]
[59Co]
[122Xe]
[27Al]
[7Li]
[54Cr]
[198Hg]
[42K]
[76Br-]
[52Mn+2]
[64Ga]
[13B]
[216Bi]
[71As]
[201Tl]
[117Sn+2]
[11cH]
[Mn-2]
[232Th]
[SnH+2]
[11CH3-]
[197Hg]
[51Cr+3]
[57Co]
[203Pb]
[NbH2]
[149Pm]
[77Kr]
[103Cd]
[62Ni]
[NbH3]
[ReH3]
[AlH6-3]
[CrH2]
[LaH3]
[SmH3]
[EuH3]
[OsH3]
[MoH5]
[64Ni]
[Ge@]
[66Zn]
[68Zn]
[Ge-]
[PdH2]
[10c]
[Tc+7]
[Co-3]
[29Si]
[209Po]
[208Po]
[206Po]
[204Po]
[202Po]
[201Po]
[200Po]
[199Po]
[198Po]
[197Po]
[196Po]
[195Po]
[194Po]
[193Po]
[192Po]
[191Po]
[190Po]
[217Po]
[12C-]
[12c]
[SbH4]
[BH+]
[225Ac]
[6Li]
[38PH]
[33PH]
[40PH]
[16NH]
[Zr+]
[PtH3]
[AuH3]
[XeH2]
[ScH3]
[10C]
[ZrH2+2]
[AgH]
[16n+]
[15nH+]
[68GaH3]
[18c]
[17OH2]
[16NH2]
[8B]
[PdH+]
[AuH]
[239Th]
[186Lu]
[1C@@H]
[1C@H]
[SH3]
[S@H]
[AlH4]
[P+3]
[Mn+4]
[Pb+4]
[V+5]
[Ag-]
[B+3]
[Pb+3]
[S+2]
[N-3]
[S+4]
[Ag+2]
[PH3]
[Sm+2]
[PH5]
[C-4]
[N+3]
[Ir-]
[C+4]
[V+3]
[W+6]
[Ti+6]
[Nd+]
[Hf+3]
[W+4]
[LaH]
[Ga+]
[IH-]
[U+6]
[F+]
[Ag+3]
[PH4]
[Na-]
[Sb+2]
[Ce+2]
[Pd+3]
[Cu+3]
[Pd+4]
[Ba+]
[BrH+]
[In+2]
[N+2]
[N@@H+]
[Na-2]
[Ti+5]
[ArH]
[SH5]
[B+2]
[NH3+2]
[Tl+2]
[Cd+]
[FH+2]
[Mo+6]
[BaH2]
[BaH]
[229Th]
[NH+3]
[7NaH]
[PtH+2]
[Re+5]
[Xe+]
[Rh+4]
[AcH]
[HeH]
[Sc+2]
[UH]
[SiH4+]
[Ac-]
[Re+4]
[118Sn]
[P+2]
[9CH]
[9CH3]
[Y-]
[Mn+6]
[C-2]
[Bi+5]
[24NaH]
[CuH2-]
[Nb+4]
[MgH]
[Ir+4]
[2NH]
[Cn]