{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 3,
      "content": "<cls_nucleotide>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 7,
      "content": "<sep>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 8,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Lowercase"
  },
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<cls_nucleotide>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<cls_nucleotide>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<cls_nucleotide>": {
        "id": "<cls_nucleotide>",
        "ids": [
          3
        ],
        "tokens": [
          "<cls_nucleotide>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          4
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": true,
    "vocab": {
      "<cls>": 0,
      "<cls_amino_acid>": 1,
      "<cls_smiles>": 2,
      "<cls_nucleotide>": 3,
      "<eos>": 4,
      "<unk>": 5,
      "<pad>": 6,
      "<sep>": 7,
      "<mask>": 8,
      "<cls_convert>": 9,
      "<cls_interact>": 10,
      "<extra_special_token_0>": 11,
      "<extra_special_token_1>": 12,
      "<extra_special_token_2>": 13,
      "<extra_special_token_3>": 14,
      "<extra_special_token_4>": 15,
      "<extra_special_token_5>": 16,
      "<extra_special_token_6>": 17,
      "<extra_special_token_7>": 18,
      "<extra_special_token_8>": 19,
      "<extra_special_token_9>": 20,
      "<extra_special_token_10>": 21,
      "<extra_special_token_11>": 22,
      "<extra_special_token_12>": 23,
      "<extra_special_token_13>": 24,
      "<reserved_for_amino_acids_0>": 25,
      "<reserved_for_amino_acids_1>": 26,
      "<reserved_for_amino_acids_2>": 27,
      "<reserved_for_amino_acids_3>": 28,
      "<reserved_for_amino_acids_4>": 29,
      "<reserved_for_amino_acids_5>": 30,
      "<reserved_for_amino_acids_6>": 31,
      "<reserved_for_amino_acids_7>": 32,
      "<reserved_for_amino_acids_8>": 33,
      "<reserved_for_amino_acids_9>": 34,
      "<reserved_for_amino_acids_10>": 35,
      "<reserved_for_amino_acids_11>": 36,
      "<reserved_for_amino_acids_12>": 37,
      "<reserved_for_amino_acids_13>": 38,
      "<reserved_for_amino_acids_14>": 39,
      "<reserved_for_amino_acids_15>": 40,
      "<reserved_for_amino_acids_16>": 41,
      "<reserved_for_amino_acids_17>": 42,
      "<reserved_for_amino_acids_18>": 43,
      "<reserved_for_amino_acids_19>": 44,
      "<reserved_for_amino_acids_20>": 45,
      "<reserved_for_amino_acids_21>": 46,
      "<reserved_for_amino_acids_22>": 47,
      "<reserved_for_amino_acids_23>": 48,
      "<reserved_for_amino_acids_24>": 49,
      "<reserved_for_amino_acids_25>": 50,
      "<reserved_for_amino_acids_26>": 51,
      "<reserved_for_smiles_0>": 52,
      "<reserved_for_smiles_1>": 53,
      "<reserved_for_smiles_2>": 54,
      "<reserved_for_smiles_3>": 55,
      "<reserved_for_smiles_4>": 56,
      "<reserved_for_smiles_5>": 57,
      "<reserved_for_smiles_6>": 58,
      "<reserved_for_smiles_7>": 59,
      "<reserved_for_smiles_8>": 60,
      "<reserved_for_smiles_9>": 61,
      "<reserved_for_smiles_10>": 62,
      "<reserved_for_smiles_11>": 63,
      "<reserved_for_smiles_12>": 64,
      "<reserved_for_smiles_13>": 65,
      "<reserved_for_smiles_14>": 66,
      "<reserved_for_smiles_15>": 67,
      "<reserved_for_smiles_16>": 68,
      "<reserved_for_smiles_17>": 69,
      "<reserved_for_smiles_18>": 70,
      "<reserved_for_smiles_19>": 71,
      "<reserved_for_smiles_20>": 72,
      "<reserved_for_smiles_21>": 73,
      "<reserved_for_smiles_22>": 74,
      "<reserved_for_smiles_23>": 75,
      "<reserved_for_smiles_24>": 76,
      "<reserved_for_smiles_25>": 77,
      "<reserved_for_smiles_26>": 78,
      "<reserved_for_smiles_27>": 79,
      "<reserved_for_smiles_28>": 80,
      "<reserved_for_smiles_29>": 81,
      "<reserved_for_smiles_30>": 82,
      "<reserved_for_smiles_31>": 83,
      "<reserved_for_smiles_32>": 84,
      "<reserved_for_smiles_33>": 85,
      "<reserved_for_smiles_34>": 86,
      "<reserved_for_smiles_35>": 87,
      "<reserved_for_smiles_36>": 88,
      "<reserved_for_smiles_37>": 89,
      "<reserved_for_smiles_38>": 90,
      "<reserved_for_smiles_39>": 91,
      "<reserved_for_smiles_40>": 92,
      "<reserved_for_smiles_41>": 93,
      "<reserved_for_smiles_42>": 94,
      "<reserved_for_smiles_43>": 95,
      "<reserved_for_smiles_44>": 96,
      "<reserved_for_smiles_45>": 97,
      "<reserved_for_smiles_46>": 98,
      "<reserved_for_smiles_47>": 99,
      "<reserved_for_smiles_48>": 100,
      "<reserved_for_smiles_49>": 101,
      "<reserved_for_smiles_50>": 102,
      "<reserved_for_smiles_51>": 103,
      "<reserved_for_smiles_52>": 104,
      "<reserved_for_smiles_53>": 105,
      "<reserved_for_smiles_54>": 106,
      "<reserved_for_smiles_55>": 107,
      "<reserved_for_smiles_56>": 108,
      "<reserved_for_smiles_57>": 109,
      "<reserved_for_smiles_58>": 110,
      "<reserved_for_smiles_59>": 111,
      "<reserved_for_smiles_60>": 112,
      "<reserved_for_smiles_61>": 113,
      "<reserved_for_smiles_62>": 114,
      "<reserved_for_smiles_63>": 115,
      "<reserved_for_smiles_64>": 116,
      "<reserved_for_smiles_65>": 117,
      "<reserved_for_smiles_66>": 118,
      "<reserved_for_smiles_67>": 119,
      "<reserved_for_smiles_68>": 120,
      "<reserved_for_smiles_69>": 121,
      "<reserved_for_smiles_70>": 122,
      "<reserved_for_smiles_71>": 123,
      "<reserved_for_smiles_72>": 124,
      "<reserved_for_smiles_73>": 125,
      "<reserved_for_smiles_74>": 126,
      "<reserved_for_smiles_75>": 127,
      "<reserved_for_smiles_76>": 128,
      "<reserved_for_smiles_77>": 129,
      "<reserved_for_smiles_78>": 130,
      "<reserved_for_smiles_79>": 131,
      "<reserved_for_smiles_80>": 132,
      "<reserved_for_smiles_81>": 133,
      "<reserved_for_smiles_82>": 134,
      "<reserved_for_smiles_83>": 135,
      "<reserved_for_smiles_84>": 136,
      "<reserved_for_smiles_85>": 137,
      "<reserved_for_smiles_86>": 138,
      "<reserved_for_smiles_87>": 139,
      "<reserved_for_smiles_88>": 140,
      "<reserved_for_smiles_89>": 141,
      "<reserved_for_smiles_90>": 142,
      "<reserved_for_smiles_91>": 143,
      "<reserved_for_smiles_92>": 144,
      "<reserved_for_smiles_93>": 145,
      "<reserved_for_smiles_94>": 146,
      "<reserved_for_smiles_95>": 147,
      "<reserved_for_smiles_96>": 148,
      "<reserved_for_smiles_97>": 149,
      "<reserved_for_smiles_98>": 150,
      "<reserved_for_smiles_99>": 151,
      "<reserved_for_smiles_100>": 152,
      "<reserved_for_smiles_101>": 153,
      "<reserved_for_smiles_102>": 154,
      "<reserved_for_smiles_103>": 155,
      "<reserved_for_smiles_104>": 156,
      "<reserved_for_smiles_105>": 157,
      "<reserved_for_smiles_106>": 158,
      "<reserved_for_smiles_107>": 159,
      "<reserved_for_smiles_108>": 160,
      "<reserved_for_smiles_109>": 161,
      "<reserved_for_smiles_110>": 162,
      "<reserved_for_smiles_111>": 163,
      "<reserved_for_smiles_112>": 164,
      "<reserved_for_smiles_113>": 165,
      "<reserved_for_smiles_114>": 166,
      "<reserved_for_smiles_115>": 167,
      "<reserved_for_smiles_116>": 168,
      "<reserved_for_smiles_117>": 169,
      "<reserved_for_smiles_118>": 170,
      "<reserved_for_smiles_119>": 171,
      "<reserved_for_smiles_120>": 172,
      "<reserved_for_smiles_121>": 173,
      "<reserved_for_smiles_122>": 174,
      "<reserved_for_smiles_123>": 175,
      "<reserved_for_smiles_124>": 176,
      "<reserved_for_smiles_125>": 177,
      "<reserved_for_smiles_126>": 178,
      "<reserved_for_smiles_127>": 179,
      "<reserved_for_smiles_128>": 180,
      "<reserved_for_smiles_129>": 181,
      "<reserved_for_smiles_130>": 182,
      "<reserved_for_smiles_131>": 183,
      "<reserved_for_smiles_132>": 184,
      "<reserved_for_smiles_133>": 185,
      "<reserved_for_smiles_134>": 186,
      "<reserved_for_smiles_135>": 187,
      "<reserved_for_smiles_136>": 188,
      "<reserved_for_smiles_137>": 189,
      "<reserved_for_smiles_138>": 190,
      "<reserved_for_smiles_139>": 191,
      "<reserved_for_smiles_140>": 192,
      "<reserved_for_smiles_141>": 193,
      "<reserved_for_smiles_142>": 194,
      "<reserved_for_smiles_143>": 195,
      "<reserved_for_smiles_144>": 196,
      "<reserved_for_smiles_145>": 197,
      "<reserved_for_smiles_146>": 198,
      "<reserved_for_smiles_147>": 199,
      "<reserved_for_smiles_148>": 200,
      "<reserved_for_smiles_149>": 201,
      "<reserved_for_smiles_150>": 202,
      "<reserved_for_smiles_151>": 203,
      "<reserved_for_smiles_152>": 204,
      "<reserved_for_smiles_153>": 205,
      "<reserved_for_smiles_154>": 206,
      "<reserved_for_smiles_155>": 207,
      "<reserved_for_smiles_156>": 208,
      "<reserved_for_smiles_157>": 209,
      "<reserved_for_smiles_158>": 210,
      "<reserved_for_smiles_159>": 211,
      "<reserved_for_smiles_160>": 212,
      "<reserved_for_smiles_161>": 213,
      "<reserved_for_smiles_162>": 214,
      "<reserved_for_smiles_163>": 215,
      "<reserved_for_smiles_164>": 216,
      "<reserved_for_smiles_165>": 217,
      "<reserved_for_smiles_166>": 218,
      "<reserved_for_smiles_167>": 219,
      "<reserved_for_smiles_168>": 220,
      "<reserved_for_smiles_169>": 221,
      "<reserved_for_smiles_170>": 222,
      "<reserved_for_smiles_171>": 223,
      "<reserved_for_smiles_172>": 224,
      "<reserved_for_smiles_173>": 225,
      "<reserved_for_smiles_174>": 226,
      "<reserved_for_smiles_175>": 227,
      "<reserved_for_smiles_176>": 228,
      "<reserved_for_smiles_177>": 229,
      "<reserved_for_smiles_178>": 230,
      "<reserved_for_smiles_179>": 231,
      "<reserved_for_smiles_180>": 232,
      "<reserved_for_smiles_181>": 233,
      "<reserved_for_smiles_182>": 234,
      "<reserved_for_smiles_183>": 235,
      "<reserved_for_smiles_184>": 236,
      "<reserved_for_smiles_185>": 237,
      "<reserved_for_smiles_186>": 238,
      "<reserved_for_smiles_187>": 239,
      "<reserved_for_smiles_188>": 240,
      "<reserved_for_smiles_189>": 241,
      "<reserved_for_smiles_190>": 242,
      "<reserved_for_smiles_191>": 243,
      "<reserved_for_smiles_192>": 244,
      "<reserved_for_smiles_193>": 245,
      "<reserved_for_smiles_194>": 246,
      "<reserved_for_smiles_195>": 247,
      "<reserved_for_smiles_196>": 248,
      "<reserved_for_smiles_197>": 249,
      "<reserved_for_smiles_198>": 250,
      "<reserved_for_smiles_199>": 251,
      "<reserved_for_smiles_200>": 252,
      "<reserved_for_smiles_201>": 253,
      "<reserved_for_smiles_202>": 254,
      "<reserved_for_smiles_203>": 255,
      "<reserved_for_smiles_204>": 256,
      "<reserved_for_smiles_205>": 257,
      "<reserved_for_smiles_206>": 258,
      "<reserved_for_smiles_207>": 259,
      "<reserved_for_smiles_208>": 260,
      "<reserved_for_smiles_209>": 261,
      "<reserved_for_smiles_210>": 262,
      "<reserved_for_smiles_211>": 263,
      "<reserved_for_smiles_212>": 264,
      "<reserved_for_smiles_213>": 265,
      "<reserved_for_smiles_214>": 266,
      "<reserved_for_smiles_215>": 267,
      "<reserved_for_smiles_216>": 268,
      "<reserved_for_smiles_217>": 269,
      "<reserved_for_smiles_218>": 270,
      "<reserved_for_smiles_219>": 271,
      "<reserved_for_smiles_220>": 272,
      "<reserved_for_smiles_221>": 273,
      "<reserved_for_smiles_222>": 274,
      "<reserved_for_smiles_223>": 275,
      "<reserved_for_smiles_224>": 276,
      "<reserved_for_smiles_225>": 277,
      "<reserved_for_smiles_226>": 278,
      "<reserved_for_smiles_227>": 279,
      "<reserved_for_smiles_228>": 280,
      "<reserved_for_smiles_229>": 281,
      "<reserved_for_smiles_230>": 282,
      "<reserved_for_smiles_231>": 283,
      "<reserved_for_smiles_232>": 284,
      "<reserved_for_smiles_233>": 285,
      "<reserved_for_smiles_234>": 286,
      "<reserved_for_smiles_235>": 287,
      "<reserved_for_smiles_236>": 288,
      "<reserved_for_smiles_237>": 289,
      "<reserved_for_smiles_238>": 290,
      "<reserved_for_smiles_239>": 291,
      "<reserved_for_smiles_240>": 292,
      "<reserved_for_smiles_241>": 293,
      "<reserved_for_smiles_242>": 294,
      "<reserved_for_smiles_243>": 295,
      "<reserved_for_smiles_244>": 296,
      "<reserved_for_smiles_245>": 297,
      "<reserved_for_smiles_246>": 298,
      "<reserved_for_smiles_247>": 299,
      "<reserved_for_smiles_248>": 300,
      "<reserved_for_smiles_249>": 301,
      "<reserved_for_smiles_250>": 302,
      "<reserved_for_smiles_251>": 303,
      "<reserved_for_smiles_252>": 304,
      "<reserved_for_smiles_253>": 305,
      "<reserved_for_smiles_254>": 306,
      "<reserved_for_smiles_255>": 307,
      "<reserved_for_smiles_256>": 308,
      "<reserved_for_smiles_257>": 309,
      "<reserved_for_smiles_258>": 310,
      "<reserved_for_smiles_259>": 311,
      "<reserved_for_smiles_260>": 312,
      "<reserved_for_smiles_261>": 313,
      "<reserved_for_smiles_262>": 314,
      "<reserved_for_smiles_263>": 315,
      "<reserved_for_smiles_264>": 316,
      "<reserved_for_smiles_265>": 317,
      "<reserved_for_smiles_266>": 318,
      "<reserved_for_smiles_267>": 319,
      "<reserved_for_smiles_268>": 320,
      "<reserved_for_smiles_269>": 321,
      "<reserved_for_smiles_270>": 322,
      "<reserved_for_smiles_271>": 323,
      "<reserved_for_smiles_272>": 324,
      "<reserved_for_smiles_273>": 325,
      "<reserved_for_smiles_274>": 326,
      "<reserved_for_smiles_275>": 327,
      "<reserved_for_smiles_276>": 328,
      "<reserved_for_smiles_277>": 329,
      "<reserved_for_smiles_278>": 330,
      "<reserved_for_smiles_279>": 331,
      "<reserved_for_smiles_280>": 332,
      "<reserved_for_smiles_281>": 333,
      "<reserved_for_smiles_282>": 334,
      "<reserved_for_smiles_283>": 335,
      "<reserved_for_smiles_284>": 336,
      "<reserved_for_smiles_285>": 337,
      "<reserved_for_smiles_286>": 338,
      "<reserved_for_smiles_287>": 339,
      "<reserved_for_smiles_288>": 340,
      "<reserved_for_smiles_289>": 341,
      "<reserved_for_smiles_290>": 342,
      "<reserved_for_smiles_291>": 343,
      "<reserved_for_smiles_292>": 344,
      "<reserved_for_smiles_293>": 345,
      "<reserved_for_smiles_294>": 346,
      "<reserved_for_smiles_295>": 347,
      "<reserved_for_smiles_296>": 348,
      "<reserved_for_smiles_297>": 349,
      "<reserved_for_smiles_298>": 350,
      "<reserved_for_smiles_299>": 351,
      "<reserved_for_smiles_300>": 352,
      "<reserved_for_smiles_301>": 353,
      "<reserved_for_smiles_302>": 354,
      "<reserved_for_smiles_303>": 355,
      "<reserved_for_smiles_304>": 356,
      "<reserved_for_smiles_305>": 357,
      "<reserved_for_smiles_306>": 358,
      "<reserved_for_smiles_307>": 359,
      "<reserved_for_smiles_308>": 360,
      "<reserved_for_smiles_309>": 361,
      "<reserved_for_smiles_310>": 362,
      "<reserved_for_smiles_311>": 363,
      "<reserved_for_smiles_312>": 364,
      "<reserved_for_smiles_313>": 365,
      "<reserved_for_smiles_314>": 366,
      "<reserved_for_smiles_315>": 367,
      "<reserved_for_smiles_316>": 368,
      "<reserved_for_smiles_317>": 369,
      "<reserved_for_smiles_318>": 370,
      "<reserved_for_smiles_319>": 371,
      "<reserved_for_smiles_320>": 372,
      "<reserved_for_smiles_321>": 373,
      "<reserved_for_smiles_322>": 374,
      "<reserved_for_smiles_323>": 375,
      "<reserved_for_smiles_324>": 376,
      "<reserved_for_smiles_325>": 377,
      "<reserved_for_smiles_326>": 378,
      "<reserved_for_smiles_327>": 379,
      "<reserved_for_smiles_328>": 380,
      "<reserved_for_smiles_329>": 381,
      "<reserved_for_smiles_330>": 382,
      "<reserved_for_smiles_331>": 383,
      "<reserved_for_smiles_332>": 384,
      "<reserved_for_smiles_333>": 385,
      "<reserved_for_smiles_334>": 386,
      "<reserved_for_smiles_335>": 387,
      "<reserved_for_smiles_336>": 388,
      "<reserved_for_smiles_337>": 389,
      "<reserved_for_smiles_338>": 390,
      "<reserved_for_smiles_339>": 391,
      "<reserved_for_smiles_340>": 392,
      "<reserved_for_smiles_341>": 393,
      "<reserved_for_smiles_342>": 394,
      "<reserved_for_smiles_343>": 395,
      "<reserved_for_smiles_344>": 396,
      "<reserved_for_smiles_345>": 397,
      "<reserved_for_smiles_346>": 398,
      "<reserved_for_smiles_347>": 399,
      "<reserved_for_smiles_348>": 400,
      "<reserved_for_smiles_349>": 401,
      "<reserved_for_smiles_350>": 402,
      "<reserved_for_smiles_351>": 403,
      "<reserved_for_smiles_352>": 404,
      "<reserved_for_smiles_353>": 405,
      "<reserved_for_smiles_354>": 406,
      "<reserved_for_smiles_355>": 407,
      "<reserved_for_smiles_356>": 408,
      "<reserved_for_smiles_357>": 409,
      "<reserved_for_smiles_358>": 410,
      "<reserved_for_smiles_359>": 411,
      "<reserved_for_smiles_360>": 412,
      "<reserved_for_smiles_361>": 413,
      "<reserved_for_smiles_362>": 414,
      "<reserved_for_smiles_363>": 415,
      "<reserved_for_smiles_364>": 416,
      "<reserved_for_smiles_365>": 417,
      "<reserved_for_smiles_366>": 418,
      "<reserved_for_smiles_367>": 419,
      "<reserved_for_smiles_368>": 420,
      "<reserved_for_smiles_369>": 421,
      "<reserved_for_smiles_370>": 422,
      "<reserved_for_smiles_371>": 423,
      "<reserved_for_smiles_372>": 424,
      "<reserved_for_smiles_373>": 425,
      "<reserved_for_smiles_374>": 426,
      "<reserved_for_smiles_375>": 427,
      "<reserved_for_smiles_376>": 428,
      "<reserved_for_smiles_377>": 429,
      "<reserved_for_smiles_378>": 430,
      "<reserved_for_smiles_379>": 431,
      "<reserved_for_smiles_380>": 432,
      "<reserved_for_smiles_381>": 433,
      "<reserved_for_smiles_382>": 434,
      "<reserved_for_smiles_383>": 435,
      "<reserved_for_smiles_384>": 436,
      "<reserved_for_smiles_385>": 437,
      "<reserved_for_smiles_386>": 438,
      "<reserved_for_smiles_387>": 439,
      "<reserved_for_smiles_388>": 440,
      "<reserved_for_smiles_389>": 441,
      "<reserved_for_smiles_390>": 442,
      "<reserved_for_smiles_391>": 443,
      "<reserved_for_smiles_392>": 444,
      "<reserved_for_smiles_393>": 445,
      "<reserved_for_smiles_394>": 446,
      "<reserved_for_smiles_395>": 447,
      "<reserved_for_smiles_396>": 448,
      "<reserved_for_smiles_397>": 449,
      "<reserved_for_smiles_398>": 450,
      "<reserved_for_smiles_399>": 451,
      "<reserved_for_smiles_400>": 452,
      "<reserved_for_smiles_401>": 453,
      "<reserved_for_smiles_402>": 454,
      "<reserved_for_smiles_403>": 455,
      "<reserved_for_smiles_404>": 456,
      "<reserved_for_smiles_405>": 457,
      "<reserved_for_smiles_406>": 458,
      "<reserved_for_smiles_407>": 459,
      "<reserved_for_smiles_408>": 460,
      "<reserved_for_smiles_409>": 461,
      "<reserved_for_smiles_410>": 462,
      "<reserved_for_smiles_411>": 463,
      "<reserved_for_smiles_412>": 464,
      "<reserved_for_smiles_413>": 465,
      "<reserved_for_smiles_414>": 466,
      "<reserved_for_smiles_415>": 467,
      "<reserved_for_smiles_416>": 468,
      "<reserved_for_smiles_417>": 469,
      "<reserved_for_smiles_418>": 470,
      "<reserved_for_smiles_419>": 471,
      "<reserved_for_smiles_420>": 472,
      "<reserved_for_smiles_421>": 473,
      "<reserved_for_smiles_422>": 474,
      "<reserved_for_smiles_423>": 475,
      "<reserved_for_smiles_424>": 476,
      "<reserved_for_smiles_425>": 477,
      "<reserved_for_smiles_426>": 478,
      "<reserved_for_smiles_427>": 479,
      "<reserved_for_smiles_428>": 480,
      "<reserved_for_smiles_429>": 481,
      "<reserved_for_smiles_430>": 482,
      "<reserved_for_smiles_431>": 483,
      "<reserved_for_smiles_432>": 484,
      "<reserved_for_smiles_433>": 485,
      "<reserved_for_smiles_434>": 486,
      "<reserved_for_smiles_435>": 487,
      "<reserved_for_smiles_436>": 488,
      "<reserved_for_smiles_437>": 489,
      "<reserved_for_smiles_438>": 490,
      "<reserved_for_smiles_439>": 491,
      "<reserved_for_smiles_440>": 492,
      "<reserved_for_smiles_441>": 493,
      "<reserved_for_smiles_442>": 494,
      "<reserved_for_smiles_443>": 495,
      "<reserved_for_smiles_444>": 496,
      "<reserved_for_smiles_445>": 497,
      "<reserved_for_smiles_446>": 498,
      "<reserved_for_smiles_447>": 499,
      "<reserved_for_smiles_448>": 500,
      "<reserved_for_smiles_449>": 501,
      "<reserved_for_smiles_450>": 502,
      "<reserved_for_smiles_451>": 503,
      "<reserved_for_smiles_452>": 504,
      "<reserved_for_smiles_453>": 505,
      "<reserved_for_smiles_454>": 506,
      "<reserved_for_smiles_455>": 507,
      "<reserved_for_smiles_456>": 508,
      "<reserved_for_smiles_457>": 509,
      "<reserved_for_smiles_458>": 510,
      "<reserved_for_smiles_459>": 511,
      "<reserved_for_smiles_460>": 512,
      "<reserved_for_smiles_461>": 513,
      "<reserved_for_smiles_462>": 514,
      "<reserved_for_smiles_463>": 515,
      "<reserved_for_smiles_464>": 516,
      "<reserved_for_smiles_465>": 517,
      "<reserved_for_smiles_466>": 518,
      "<reserved_for_smiles_467>": 519,
      "<reserved_for_smiles_468>": 520,
      "<reserved_for_smiles_469>": 521,
      "<reserved_for_smiles_470>": 522,
      "<reserved_for_smiles_471>": 523,
      "<reserved_for_smiles_472>": 524,
      "<reserved_for_smiles_473>": 525,
      "<reserved_for_smiles_474>": 526,
      "<reserved_for_smiles_475>": 527,
      "<reserved_for_smiles_476>": 528,
      "<reserved_for_smiles_477>": 529,
      "<reserved_for_smiles_478>": 530,
      "<reserved_for_smiles_479>": 531,
      "<reserved_for_smiles_480>": 532,
      "<reserved_for_smiles_481>": 533,
      "<reserved_for_smiles_482>": 534,
      "<reserved_for_smiles_483>": 535,
      "<reserved_for_smiles_484>": 536,
      "<reserved_for_smiles_485>": 537,
      "<reserved_for_smiles_486>": 538,
      "<reserved_for_smiles_487>": 539,
      "<reserved_for_smiles_488>": 540,
      "<reserved_for_smiles_489>": 541,
      "<reserved_for_smiles_490>": 542,
      "<reserved_for_smiles_491>": 543,
      "<reserved_for_smiles_492>": 544,
      "<reserved_for_smiles_493>": 545,
      "<reserved_for_smiles_494>": 546,
      "<reserved_for_smiles_495>": 547,
      "<reserved_for_smiles_496>": 548,
      "<reserved_for_smiles_497>": 549,
      "<reserved_for_smiles_498>": 550,
      "<reserved_for_smiles_499>": 551,
      "<reserved_for_smiles_500>": 552,
      "<reserved_for_smiles_501>": 553,
      "<reserved_for_smiles_502>": 554,
      "<reserved_for_smiles_503>": 555,
      "<reserved_for_smiles_504>": 556,
      "<reserved_for_smiles_505>": 557,
      "<reserved_for_smiles_506>": 558,
      "<reserved_for_smiles_507>": 559,
      "<reserved_for_smiles_508>": 560,
      "<reserved_for_smiles_509>": 561,
      "<reserved_for_smiles_510>": 562,
      "<reserved_for_smiles_511>": 563,
      "<reserved_for_smiles_512>": 564,
      "<reserved_for_smiles_513>": 565,
      "<reserved_for_smiles_514>": 566,
      "<reserved_for_smiles_515>": 567,
      "<reserved_for_smiles_516>": 568,
      "<reserved_for_smiles_517>": 569,
      "<reserved_for_smiles_518>": 570,
      "<reserved_for_smiles_519>": 571,
      "<reserved_for_smiles_520>": 572,
      "<reserved_for_smiles_521>": 573,
      "<reserved_for_smiles_522>": 574,
      "<reserved_for_smiles_523>": 575,
      "<reserved_for_smiles_524>": 576,
      "<reserved_for_smiles_525>": 577,
      "<reserved_for_smiles_526>": 578,
      "<reserved_for_smiles_527>": 579,
      "<reserved_for_smiles_528>": 580,
      "<reserved_for_smiles_529>": 581,
      "<reserved_for_smiles_530>": 582,
      "<reserved_for_smiles_531>": 583,
      "<reserved_for_smiles_532>": 584,
      "<reserved_for_smiles_533>": 585,
      "<reserved_for_smiles_534>": 586,
      "<reserved_for_smiles_535>": 587,
      "<reserved_for_smiles_536>": 588,
      "<reserved_for_smiles_537>": 589,
      "<reserved_for_smiles_538>": 590,
      "<reserved_for_smiles_539>": 591,
      "<reserved_for_smiles_540>": 592,
      "<reserved_for_smiles_541>": 593,
      "<reserved_for_smiles_542>": 594,
      "<reserved_for_smiles_543>": 595,
      "<reserved_for_smiles_544>": 596,
      "<reserved_for_smiles_545>": 597,
      "<reserved_for_smiles_546>": 598,
      "<reserved_for_smiles_547>": 599,
      "<reserved_for_smiles_548>": 600,
      "<reserved_for_smiles_549>": 601,
      "<reserved_for_smiles_550>": 602,
      "<reserved_for_smiles_551>": 603,
      "<reserved_for_smiles_552>": 604,
      "<reserved_for_smiles_553>": 605,
      "<reserved_for_smiles_554>": 606,
      "<reserved_for_smiles_555>": 607,
      "<reserved_for_smiles_556>": 608,
      "<reserved_for_smiles_557>": 609,
      "<reserved_for_smiles_558>": 610,
      "<reserved_for_smiles_559>": 611,
      "<reserved_for_smiles_560>": 612,
      "<reserved_for_smiles_561>": 613,
      "<reserved_for_smiles_562>": 614,
      "<reserved_for_smiles_563>": 615,
      "<reserved_for_smiles_564>": 616,
      "<reserved_for_smiles_565>": 617,
      "<reserved_for_smiles_566>": 618,
      "<reserved_for_smiles_567>": 619,
      "<reserved_for_smiles_568>": 620,
      "<reserved_for_smiles_569>": 621,
      "<reserved_for_smiles_570>": 622,
      "<reserved_for_smiles_571>": 623,
      "<reserved_for_smiles_572>": 624,
      "<reserved_for_smiles_573>": 625,
      "<reserved_for_smiles_574>": 626,
      "<reserved_for_smiles_575>": 627,
      "<reserved_for_smiles_576>": 628,
      "<reserved_for_smiles_577>": 629,
      "<reserved_for_smiles_578>": 630,
      "<reserved_for_smiles_579>": 631,
      "<reserved_for_smiles_580>": 632,
      "<reserved_for_smiles_581>": 633,
      "<reserved_for_smiles_582>": 634,
      "<reserved_for_smiles_583>": 635,
      "<reserved_for_smiles_584>": 636,
      "<reserved_for_smiles_585>": 637,
      "<reserved_for_smiles_586>": 638,
      "<reserved_for_smiles_587>": 639,
      "<reserved_for_smiles_588>": 640,
      "<reserved_for_smiles_589>": 641,
      "<reserved_for_smiles_590>": 642,
      "<reserved_for_smiles_591>": 643,
      "<reserved_for_smiles_592>": 644,
      "<reserved_for_smiles_593>": 645,
      "<reserved_for_smiles_594>": 646,
      "<reserved_for_smiles_595>": 647,
      "<reserved_for_smiles_596>": 648,
      "<reserved_for_smiles_597>": 649,
      "<reserved_for_smiles_598>": 650,
      "<reserved_for_smiles_599>": 651,
      "<reserved_for_smiles_600>": 652,
      "<reserved_for_smiles_601>": 653,
      "<reserved_for_smiles_602>": 654,
      "<reserved_for_smiles_603>": 655,
      "<reserved_for_smiles_604>": 656,
      "<reserved_for_smiles_605>": 657,
      "<reserved_for_smiles_606>": 658,
      "<reserved_for_smiles_607>": 659,
      "<reserved_for_smiles_608>": 660,
      "<reserved_for_smiles_609>": 661,
      "<reserved_for_smiles_610>": 662,
      "<reserved_for_smiles_611>": 663,
      "<reserved_for_smiles_612>": 664,
      "<reserved_for_smiles_613>": 665,
      "<reserved_for_smiles_614>": 666,
      "<reserved_for_smiles_615>": 667,
      "<reserved_for_smiles_616>": 668,
      "<reserved_for_smiles_617>": 669,
      "<reserved_for_smiles_618>": 670,
      "<reserved_for_smiles_619>": 671,
      "<reserved_for_smiles_620>": 672,
      "<reserved_for_smiles_621>": 673,
      "<reserved_for_smiles_622>": 674,
      "<reserved_for_smiles_623>": 675,
      "<reserved_for_smiles_624>": 676,
      "<reserved_for_smiles_625>": 677,
      "<reserved_for_smiles_626>": 678,
      "<reserved_for_smiles_627>": 679,
      "<reserved_for_smiles_628>": 680,
      "<reserved_for_smiles_629>": 681,
      "<reserved_for_smiles_630>": 682,
      "<reserved_for_smiles_631>": 683,
      "<reserved_for_smiles_632>": 684,
      "<reserved_for_smiles_633>": 685,
      "<reserved_for_smiles_634>": 686,
      "<reserved_for_smiles_635>": 687,
      "<reserved_for_smiles_636>": 688,
      "<reserved_for_smiles_637>": 689,
      "<reserved_for_smiles_638>": 690,
      "<reserved_for_smiles_639>": 691,
      "<reserved_for_smiles_640>": 692,
      "<reserved_for_smiles_641>": 693,
      "<reserved_for_smiles_642>": 694,
      "<reserved_for_smiles_643>": 695,
      "<reserved_for_smiles_644>": 696,
      "<reserved_for_smiles_645>": 697,
      "<reserved_for_smiles_646>": 698,
      "<reserved_for_smiles_647>": 699,
      "<reserved_for_smiles_648>": 700,
      "<reserved_for_smiles_649>": 701,
      "<reserved_for_smiles_650>": 702,
      "<reserved_for_smiles_651>": 703,
      "<reserved_for_smiles_652>": 704,
      "<reserved_for_smiles_653>": 705,
      "<reserved_for_smiles_654>": 706,
      "<reserved_for_smiles_655>": 707,
      "<reserved_for_smiles_656>": 708,
      "<reserved_for_smiles_657>": 709,
      "<reserved_for_smiles_658>": 710,
      "<reserved_for_smiles_659>": 711,
      "<reserved_for_smiles_660>": 712,
      "<reserved_for_smiles_661>": 713,
      "<reserved_for_smiles_662>": 714,
      "<reserved_for_smiles_663>": 715,
      "<reserved_for_smiles_664>": 716,
      "<reserved_for_smiles_665>": 717,
      "<reserved_for_smiles_666>": 718,
      "<reserved_for_smiles_667>": 719,
      "<reserved_for_smiles_668>": 720,
      "<reserved_for_smiles_669>": 721,
      "<reserved_for_smiles_670>": 722,
      "<reserved_for_smiles_671>": 723,
      "<reserved_for_smiles_672>": 724,
      "<reserved_for_smiles_673>": 725,
      "<reserved_for_smiles_674>": 726,
      "<reserved_for_smiles_675>": 727,
      "<reserved_for_smiles_676>": 728,
      "<reserved_for_smiles_677>": 729,
      "<reserved_for_smiles_678>": 730,
      "<reserved_for_smiles_679>": 731,
      "<reserved_for_smiles_680>": 732,
      "<reserved_for_smiles_681>": 733,
      "<reserved_for_smiles_682>": 734,
      "<reserved_for_smiles_683>": 735,
      "<reserved_for_smiles_684>": 736,
      "<reserved_for_smiles_685>": 737,
      "<reserved_for_smiles_686>": 738,
      "<reserved_for_smiles_687>": 739,
      "<reserved_for_smiles_688>": 740,
      "<reserved_for_smiles_689>": 741,
      "<reserved_for_smiles_690>": 742,
      "<reserved_for_smiles_691>": 743,
      "<reserved_for_smiles_692>": 744,
      "<reserved_for_smiles_693>": 745,
      "<reserved_for_smiles_694>": 746,
      "<reserved_for_smiles_695>": 747,
      "<reserved_for_smiles_696>": 748,
      "<reserved_for_smiles_697>": 749,
      "<reserved_for_smiles_698>": 750,
      "<reserved_for_smiles_699>": 751,
      "<reserved_for_smiles_700>": 752,
      "<reserved_for_smiles_701>": 753,
      "<reserved_for_smiles_702>": 754,
      "<reserved_for_smiles_703>": 755,
      "<reserved_for_smiles_704>": 756,
      "<reserved_for_smiles_705>": 757,
      "<reserved_for_smiles_706>": 758,
      "<reserved_for_smiles_707>": 759,
      "<reserved_for_smiles_708>": 760,
      "<reserved_for_smiles_709>": 761,
      "<reserved_for_smiles_710>": 762,
      "<reserved_for_smiles_711>": 763,
      "<reserved_for_smiles_712>": 764,
      "<reserved_for_smiles_713>": 765,
      "<reserved_for_smiles_714>": 766,
      "<reserved_for_smiles_715>": 767,
      "<reserved_for_smiles_716>": 768,
      "<reserved_for_smiles_717>": 769,
      "<reserved_for_smiles_718>": 770,
      "<reserved_for_smiles_719>": 771,
      "<reserved_for_smiles_720>": 772,
      "<reserved_for_smiles_721>": 773,
      "<reserved_for_smiles_722>": 774,
      "<reserved_for_smiles_723>": 775,
      "<reserved_for_smiles_724>": 776,
      "<reserved_for_smiles_725>": 777,
      "<reserved_for_smiles_726>": 778,
      "<reserved_for_smiles_727>": 779,
      "<reserved_for_smiles_728>": 780,
      "<reserved_for_smiles_729>": 781,
      "<reserved_for_smiles_730>": 782,
      "<reserved_for_smiles_731>": 783,
      "<reserved_for_smiles_732>": 784,
      "<reserved_for_smiles_733>": 785,
      "<reserved_for_smiles_734>": 786,
      "<reserved_for_smiles_735>": 787,
      "<reserved_for_smiles_736>": 788,
      "<reserved_for_smiles_737>": 789,
      "<reserved_for_smiles_738>": 790,
      "<reserved_for_smiles_739>": 791,
      "<reserved_for_smiles_740>": 792,
      "<reserved_for_smiles_741>": 793,
      "<reserved_for_smiles_742>": 794,
      "<reserved_for_smiles_743>": 795,
      "<reserved_for_smiles_744>": 796,
      "<reserved_for_smiles_745>": 797,
      "<reserved_for_smiles_746>": 798,
      "<reserved_for_smiles_747>": 799,
      "<reserved_for_smiles_748>": 800,
      "<reserved_for_smiles_749>": 801,
      "<reserved_for_smiles_750>": 802,
      "<reserved_for_smiles_751>": 803,
      "<reserved_for_smiles_752>": 804,
      "<reserved_for_smiles_753>": 805,
      "<reserved_for_smiles_754>": 806,
      "<reserved_for_smiles_755>": 807,
      "<reserved_for_smiles_756>": 808,
      "<reserved_for_smiles_757>": 809,
      "<reserved_for_smiles_758>": 810,
      "<reserved_for_smiles_759>": 811,
      "<reserved_for_smiles_760>": 812,
      "<reserved_for_smiles_761>": 813,
      "<reserved_for_smiles_762>": 814,
      "<reserved_for_smiles_763>": 815,
      "<reserved_for_smiles_764>": 816,
      "<reserved_for_smiles_765>": 817,
      "<reserved_for_smiles_766>": 818,
      "<reserved_for_smiles_767>": 819,
      "<reserved_for_smiles_768>": 820,
      "<reserved_for_smiles_769>": 821,
      "<reserved_for_smiles_770>": 822,
      "<reserved_for_smiles_771>": 823,
      "<reserved_for_smiles_772>": 824,
      "<reserved_for_smiles_773>": 825,
      "<reserved_for_smiles_774>": 826,
      "<reserved_for_smiles_775>": 827,
      "<reserved_for_smiles_776>": 828,
      "<reserved_for_smiles_777>": 829,
      "<reserved_for_smiles_778>": 830,
      "<reserved_for_smiles_779>": 831,
      "<reserved_for_smiles_780>": 832,
      "<reserved_for_smiles_781>": 833,
      "<reserved_for_smiles_782>": 834,
      "<reserved_for_smiles_783>": 835,
      "<reserved_for_smiles_784>": 836,
      "<reserved_for_smiles_785>": 837,
      "<reserved_for_smiles_786>": 838,
      "<reserved_for_smiles_787>": 839,
      "<reserved_for_smiles_788>": 840,
      "<reserved_for_smiles_789>": 841,
      "<reserved_for_smiles_790>": 842,
      "<reserved_for_smiles_791>": 843,
      "<reserved_for_smiles_792>": 844,
      "<reserved_for_smiles_793>": 845,
      "<reserved_for_smiles_794>": 846,
      "<reserved_for_smiles_795>": 847,
      "<reserved_for_smiles_796>": 848,
      "<reserved_for_smiles_797>": 849,
      "<reserved_for_smiles_798>": 850,
      "<reserved_for_smiles_799>": 851,
      "<reserved_for_smiles_800>": 852,
      "<reserved_for_smiles_801>": 853,
      "<reserved_for_smiles_802>": 854,
      "<reserved_for_smiles_803>": 855,
      "<reserved_for_smiles_804>": 856,
      "<reserved_for_smiles_805>": 857,
      "<reserved_for_smiles_806>": 858,
      "<reserved_for_smiles_807>": 859,
      "<reserved_for_smiles_808>": 860,
      "<reserved_for_smiles_809>": 861,
      "<reserved_for_smiles_810>": 862,
      "<reserved_for_smiles_811>": 863,
      "<reserved_for_smiles_812>": 864,
      "<reserved_for_smiles_813>": 865,
      "<reserved_for_smiles_814>": 866,
      "<reserved_for_smiles_815>": 867,
      "<reserved_for_smiles_816>": 868,
      "<reserved_for_smiles_817>": 869,
      "<reserved_for_smiles_818>": 870,
      "<reserved_for_smiles_819>": 871,
      "<reserved_for_smiles_820>": 872,
      "<reserved_for_smiles_821>": 873,
      "<reserved_for_smiles_822>": 874,
      "<reserved_for_smiles_823>": 875,
      "<reserved_for_smiles_824>": 876,
      "<reserved_for_smiles_825>": 877,
      "<reserved_for_smiles_826>": 878,
      "<reserved_for_smiles_827>": 879,
      "<reserved_for_smiles_828>": 880,
      "<reserved_for_smiles_829>": 881,
      "<reserved_for_smiles_830>": 882,
      "<reserved_for_smiles_831>": 883,
      "<reserved_for_smiles_832>": 884,
      "<reserved_for_smiles_833>": 885,
      "<reserved_for_smiles_834>": 886,
      "<reserved_for_smiles_835>": 887,
      "<reserved_for_smiles_836>": 888,
      "<reserved_for_smiles_837>": 889,
      "<reserved_for_smiles_838>": 890,
      "<reserved_for_smiles_839>": 891,
      "<reserved_for_smiles_840>": 892,
      "<reserved_for_smiles_841>": 893,
      "<reserved_for_smiles_842>": 894,
      "<reserved_for_smiles_843>": 895,
      "<reserved_for_smiles_844>": 896,
      "<reserved_for_smiles_845>": 897,
      "<reserved_for_smiles_846>": 898,
      "<reserved_for_smiles_847>": 899,
      "<reserved_for_smiles_848>": 900,
      "<reserved_for_smiles_849>": 901,
      "<reserved_for_smiles_850>": 902,
      "<reserved_for_smiles_851>": 903,
      "<reserved_for_smiles_852>": 904,
      "<reserved_for_smiles_853>": 905,
      "<reserved_for_smiles_854>": 906,
      "<reserved_for_smiles_855>": 907,
      "<reserved_for_smiles_856>": 908,
      "<reserved_for_smiles_857>": 909,
      "<reserved_for_smiles_858>": 910,
      "<reserved_for_smiles_859>": 911,
      "<reserved_for_smiles_860>": 912,
      "<reserved_for_smiles_861>": 913,
      "<reserved_for_smiles_862>": 914,
      "<reserved_for_smiles_863>": 915,
      "<reserved_for_smiles_864>": 916,
      "<reserved_for_smiles_865>": 917,
      "<reserved_for_smiles_866>": 918,
      "<reserved_for_smiles_867>": 919,
      "<reserved_for_smiles_868>": 920,
      "<reserved_for_smiles_869>": 921,
      "<reserved_for_smiles_870>": 922,
      "<reserved_for_smiles_871>": 923,
      "<reserved_for_smiles_872>": 924,
      "<reserved_for_smiles_873>": 925,
      "<reserved_for_smiles_874>": 926,
      "<reserved_for_smiles_875>": 927,
      "<reserved_for_smiles_876>": 928,
      "<reserved_for_smiles_877>": 929,
      "<reserved_for_smiles_878>": 930,
      "<reserved_for_smiles_879>": 931,
      "<reserved_for_smiles_880>": 932,
      "<reserved_for_smiles_881>": 933,
      "<reserved_for_smiles_882>": 934,
      "<reserved_for_smiles_883>": 935,
      "<reserved_for_smiles_884>": 936,
      "<reserved_for_smiles_885>": 937,
      "<reserved_for_smiles_886>": 938,
      "<reserved_for_smiles_887>": 939,
      "<reserved_for_smiles_888>": 940,
      "<reserved_for_smiles_889>": 941,
      "<reserved_for_smiles_890>": 942,
      "<reserved_for_smiles_891>": 943,
      "<reserved_for_smiles_892>": 944,
      "<reserved_for_smiles_893>": 945,
      "<reserved_for_smiles_894>": 946,
      "<reserved_for_smiles_895>": 947,
      "<reserved_for_smiles_896>": 948,
      "<reserved_for_smiles_897>": 949,
      "<reserved_for_smiles_898>": 950,
      "<reserved_for_smiles_899>": 951,
      "<reserved_for_smiles_900>": 952,
      "<reserved_for_smiles_901>": 953,
      "<reserved_for_smiles_902>": 954,
      "<reserved_for_smiles_903>": 955,
      "<reserved_for_smiles_904>": 956,
      "<reserved_for_smiles_905>": 957,
      "<reserved_for_smiles_906>": 958,
      "<reserved_for_smiles_907>": 959,
      "<reserved_for_smiles_908>": 960,
      "<reserved_for_smiles_909>": 961,
      "<reserved_for_smiles_910>": 962,
      "<reserved_for_smiles_911>": 963,
      "<reserved_for_smiles_912>": 964,
      "<reserved_for_smiles_913>": 965,
      "<reserved_for_smiles_914>": 966,
      "<reserved_for_smiles_915>": 967,
      "<reserved_for_smiles_916>": 968,
      "<reserved_for_smiles_917>": 969,
      "<reserved_for_smiles_918>": 970,
      "<reserved_for_smiles_919>": 971,
      "<reserved_for_smiles_920>": 972,
      "<reserved_for_smiles_921>": 973,
      "<reserved_for_smiles_922>": 974,
      "<reserved_for_smiles_923>": 975,
      "<reserved_for_smiles_924>": 976,
      "<reserved_for_smiles_925>": 977,
      "<reserved_for_smiles_926>": 978,
      "<reserved_for_smiles_927>": 979,
      "<reserved_for_smiles_928>": 980,
      "<reserved_for_smiles_929>": 981,
      "<reserved_for_smiles_930>": 982,
      "<reserved_for_smiles_931>": 983,
      "<reserved_for_smiles_932>": 984,
      "<reserved_for_smiles_933>": 985,
      "<reserved_for_smiles_934>": 986,
      "<reserved_for_smiles_935>": 987,
      "<reserved_for_smiles_936>": 988,
      "<reserved_for_smiles_937>": 989,
      "<reserved_for_smiles_938>": 990,
      "<reserved_for_smiles_939>": 991,
      "<reserved_for_smiles_940>": 992,
      "<reserved_for_smiles_941>": 993,
      "<reserved_for_smiles_942>": 994,
      "<reserved_for_smiles_943>": 995,
      "<reserved_for_smiles_944>": 996,
      "<reserved_for_smiles_945>": 997,
      "<reserved_for_smiles_946>": 998,
      "<reserved_for_smiles_947>": 999,
      "<reserved_for_smiles_948>": 1000,
      "<reserved_for_smiles_949>": 1001,
      "<reserved_for_smiles_950>": 1002,
      "<reserved_for_smiles_951>": 1003,
      "<reserved_for_smiles_952>": 1004,
      "<reserved_for_smiles_953>": 1005,
      "<reserved_for_smiles_954>": 1006,
      "<reserved_for_smiles_955>": 1007,
      "<reserved_for_smiles_956>": 1008,
      "<reserved_for_smiles_957>": 1009,
      "<reserved_for_smiles_958>": 1010,
      "<reserved_for_smiles_959>": 1011,
      "<reserved_for_smiles_960>": 1012,
      "<reserved_for_smiles_961>": 1013,
      "<reserved_for_smiles_962>": 1014,
      "<reserved_for_smiles_963>": 1015,
      "<reserved_for_smiles_964>": 1016,
      "<reserved_for_smiles_965>": 1017,
      "<reserved_for_smiles_966>": 1018,
      "<reserved_for_smiles_967>": 1019,
      "<reserved_for_smiles_968>": 1020,
      "<reserved_for_smiles_969>": 1021,
      "<reserved_for_smiles_970>": 1022,
      "<reserved_for_smiles_971>": 1023,
      "<reserved_for_smiles_972>": 1024,
      "<reserved_for_smiles_973>": 1025,
      "<reserved_for_smiles_974>": 1026,
      "<reserved_for_smiles_975>": 1027,
      "<reserved_for_smiles_976>": 1028,
      "<reserved_for_smiles_977>": 1029,
      "<reserved_for_smiles_978>": 1030,
      "<reserved_for_smiles_979>": 1031,
      "<reserved_for_smiles_980>": 1032,
      "<reserved_for_smiles_981>": 1033,
      "<reserved_for_smiles_982>": 1034,
      "<reserved_for_smiles_983>": 1035,
      "<reserved_for_smiles_984>": 1036,
      "<reserved_for_smiles_985>": 1037,
      "<reserved_for_smiles_986>": 1038,
      "<reserved_for_smiles_987>": 1039,
      "<reserved_for_smiles_988>": 1040,
      "<reserved_for_smiles_989>": 1041,
      "<reserved_for_smiles_990>": 1042,
      "<reserved_for_smiles_991>": 1043,
      "<reserved_for_smiles_992>": 1044,
      "<reserved_for_smiles_993>": 1045,
      "<reserved_for_smiles_994>": 1046,
      "<reserved_for_smiles_995>": 1047,
      "<reserved_for_smiles_996>": 1048,
      "<reserved_for_smiles_997>": 1049,
      "<reserved_for_smiles_998>": 1050,
      "<reserved_for_smiles_999>": 1051,
      "<reserved_for_smiles_1000>": 1052,
      "<reserved_for_smiles_1001>": 1053,
      "<reserved_for_smiles_1002>": 1054,
      "<reserved_for_smiles_1003>": 1055,
      "<reserved_for_smiles_1004>": 1056,
      "<reserved_for_smiles_1005>": 1057,
      "<reserved_for_smiles_1006>": 1058,
      "<reserved_for_smiles_1007>": 1059,
      "<reserved_for_smiles_1008>": 1060,
      "<reserved_for_smiles_1009>": 1061,
      "<reserved_for_smiles_1010>": 1062,
      "<reserved_for_smiles_1011>": 1063,
      "<reserved_for_smiles_1012>": 1064,
      "<reserved_for_smiles_1013>": 1065,
      "<reserved_for_smiles_1014>": 1066,
      "<reserved_for_smiles_1015>": 1067,
      "<reserved_for_smiles_1016>": 1068,
      "<reserved_for_smiles_1017>": 1069,
      "<reserved_for_smiles_1018>": 1070,
      "<reserved_for_smiles_1019>": 1071,
      "<reserved_for_smiles_1020>": 1072,
      "<reserved_for_smiles_1021>": 1073,
      "<reserved_for_smiles_1022>": 1074,
      "<reserved_for_smiles_1023>": 1075,
      "<reserved_for_smiles_1024>": 1076,
      "<reserved_for_smiles_1025>": 1077,
      "<reserved_for_smiles_1026>": 1078,
      "<reserved_for_smiles_1027>": 1079,
      "<reserved_for_smiles_1028>": 1080,
      "<reserved_for_smiles_1029>": 1081,
      "<reserved_for_smiles_1030>": 1082,
      "<reserved_for_smiles_1031>": 1083,
      "<reserved_for_smiles_1032>": 1084,
      "<reserved_for_smiles_1033>": 1085,
      "<reserved_for_smiles_1034>": 1086,
      "<reserved_for_smiles_1035>": 1087,
      "<reserved_for_smiles_1036>": 1088,
      "<reserved_for_smiles_1037>": 1089,
      "<reserved_for_smiles_1038>": 1090,
      "<reserved_for_smiles_1039>": 1091,
      "<reserved_for_smiles_1040>": 1092,
      "<reserved_for_smiles_1041>": 1093,
      "<reserved_for_smiles_1042>": 1094,
      "<reserved_for_smiles_1043>": 1095,
      "<reserved_for_smiles_1044>": 1096,
      "<reserved_for_smiles_1045>": 1097,
      "<reserved_for_smiles_1046>": 1098,
      "<reserved_for_smiles_1047>": 1099,
      "<reserved_for_smiles_1048>": 1100,
      "<reserved_for_smiles_1049>": 1101,
      "<reserved_for_smiles_1050>": 1102,
      "<reserved_for_smiles_1051>": 1103,
      "<reserved_for_smiles_1052>": 1104,
      "<reserved_for_smiles_1053>": 1105,
      "<reserved_for_smiles_1054>": 1106,
      "<reserved_for_smiles_1055>": 1107,
      "<reserved_for_smiles_1056>": 1108,
      "<reserved_for_smiles_1057>": 1109,
      "<reserved_for_smiles_1058>": 1110,
      "<reserved_for_smiles_1059>": 1111,
      "<reserved_for_smiles_1060>": 1112,
      "<reserved_for_smiles_1061>": 1113,
      "<reserved_for_smiles_1062>": 1114,
      "<reserved_for_smiles_1063>": 1115,
      "<reserved_for_smiles_1064>": 1116,
      "<reserved_for_smiles_1065>": 1117,
      "<reserved_for_smiles_1066>": 1118,
      "<reserved_for_smiles_1067>": 1119,
      "<reserved_for_smiles_1068>": 1120,
      "<reserved_for_smiles_1069>": 1121,
      "<reserved_for_smiles_1070>": 1122,
      "<reserved_for_smiles_1071>": 1123,
      "<reserved_for_smiles_1072>": 1124,
      "<reserved_for_smiles_1073>": 1125,
      "<reserved_for_smiles_1074>": 1126,
      "<reserved_for_smiles_1075>": 1127,
      "<reserved_for_smiles_1076>": 1128,
      "<reserved_for_smiles_1077>": 1129,
      "<reserved_for_smiles_1078>": 1130,
      "<reserved_for_smiles_1079>": 1131,
      "<reserved_for_smiles_1080>": 1132,
      "<reserved_for_smiles_1081>": 1133,
      "<reserved_for_smiles_1082>": 1134,
      "<reserved_for_smiles_1083>": 1135,
      "<reserved_for_smiles_1084>": 1136,
      "<reserved_for_smiles_1085>": 1137,
      "<reserved_for_smiles_1086>": 1138,
      "<reserved_for_smiles_1087>": 1139,
      "<reserved_for_smiles_1088>": 1140,
      "<reserved_for_smiles_1089>": 1141,
      "<reserved_for_smiles_1090>": 1142,
      "<reserved_for_smiles_1091>": 1143,
      "<reserved_for_smiles_1092>": 1144,
      "<reserved_for_smiles_1093>": 1145,
      "<reserved_for_smiles_1094>": 1146,
      "<reserved_for_smiles_1095>": 1147,
      "<reserved_for_smiles_1096>": 1148,
      "<reserved_for_smiles_1097>": 1149,
      "<reserved_for_smiles_1098>": 1150,
      "<reserved_for_smiles_1099>": 1151,
      "<reserved_for_smiles_1100>": 1152,
      "<reserved_for_smiles_1101>": 1153,
      "<reserved_for_smiles_1102>": 1154,
      "<reserved_for_smiles_1103>": 1155,
      "<reserved_for_smiles_1104>": 1156,
      "<reserved_for_smiles_1105>": 1157,
      "<reserved_for_smiles_1106>": 1158,
      "<reserved_for_smiles_1107>": 1159,
      "<reserved_for_smiles_1108>": 1160,
      "<reserved_for_smiles_1109>": 1161,
      "<reserved_for_smiles_1110>": 1162,
      "<reserved_for_smiles_1111>": 1163,
      "<reserved_for_smiles_1112>": 1164,
      "<reserved_for_smiles_1113>": 1165,
      "<reserved_for_smiles_1114>": 1166,
      "<reserved_for_smiles_1115>": 1167,
      "<reserved_for_smiles_1116>": 1168,
      "<reserved_for_smiles_1117>": 1169,
      "<reserved_for_smiles_1118>": 1170,
      "<reserved_for_smiles_1119>": 1171,
      "<reserved_for_smiles_1120>": 1172,
      "<reserved_for_smiles_1121>": 1173,
      "<reserved_for_smiles_1122>": 1174,
      "<reserved_for_smiles_1123>": 1175,
      "<reserved_for_smiles_1124>": 1176,
      "<reserved_for_smiles_1125>": 1177,
      "<reserved_for_smiles_1126>": 1178,
      "<reserved_for_smiles_1127>": 1179,
      "<reserved_for_smiles_1128>": 1180,
