{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<cls>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<sep>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Lowercase"
  },
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<cls>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<cls>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<cls>": {
        "id": "<cls>",
        "ids": [
          0
        ],
        "tokens": [
          "<cls>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          2
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": true,
    "vocab": {
      "<cls>": 0,
      "<pad>": 1,
      "<eos>": 2,
      "<unk>": 3,
      "<mask>": 4,
      "<sep>": 5,
      "<convert>": 6,
      "<interact>": 7,
      "<extra_special_token_2>": 8,
      "<extra_special_token_3>": 9,
      "<extra_special_token_4>": 10,
      "<extra_special_token_5>": 11,
      "<extra_special_token_6>": 12,
      "<extra_special_token_7>": 13,
      "<extra_special_token_8>": 14,
      "<extra_special_token_9>": 15,
      "<extra_special_token_10>": 16,
      "<extra_special_token_11>": 17,
      "<extra_special_token_12>": 18,
      "<extra_special_token_13>": 19,
      "<extra_special_token_14>": 20,
      "<extra_special_token_15>": 21,
      "<extra_special_token_16>": 22,
      "<reserved_for_amino_acids_special_token_17>": 23,
      "<reserved_for_amino_acids_special_token_18>": 24,
      "<reserved_for_amino_acids_special_token_19>": 25,
      "<reserved_for_amino_acids_special_token_20>": 26,
      "<reserved_for_amino_acids_special_token_21>": 27,
      "<reserved_for_amino_acids_special_token_22>": 28,
      "<reserved_for_amino_acids_special_token_23>": 29,
      "<reserved_for_amino_acids_special_token_24>": 30,
      "<reserved_for_amino_acids_special_token_25>": 31,
      "<reserved_for_amino_acids_special_token_26>": 32,
      "<reserved_for_amino_acids_special_token_27>": 33,
      "<reserved_for_amino_acids_special_token_28>": 34,
      "<reserved_for_amino_acids_special_token_29>": 35,
      "<reserved_for_amino_acids_special_token_30>": 36,
      "<reserved_for_amino_acids_special_token_31>": 37,
      "<reserved_for_amino_acids_special_token_32>": 38,
      "<reserved_for_amino_acids_special_token_33>": 39,
      "<reserved_for_amino_acids_special_token_34>": 40,
      "<reserved_for_amino_acids_special_token_35>": 41,
      "<reserved_for_amino_acids_special_token_36>": 42,
      "<reserved_for_amino_acids_special_token_37>": 43,
      "<reserved_for_amino_acids_special_token_38>": 44,
      "<reserved_for_amino_acids_special_token_39>": 45,
      "<reserved_for_amino_acids_special_token_40>": 46,
      "<reserved_for_amino_acids_special_token_41>": 47,
      "<reserved_for_amino_acids_special_token_42>": 48,
      "<reserved_for_amino_acids_special_token_43>": 49,
      "<reserved_for_smiles_special_token_44>": 50,
      "<reserved_for_smiles_special_token_45>": 51,
      "<reserved_for_smiles_special_token_46>": 52,
      "<reserved_for_smiles_special_token_47>": 53,
      "<reserved_for_smiles_special_token_48>": 54,
      "<reserved_for_smiles_special_token_49>": 55,
      "<reserved_for_smiles_special_token_50>": 56,
      "<reserved_for_smiles_special_token_51>": 57,
      "<reserved_for_smiles_special_token_52>": 58,
      "<reserved_for_smiles_special_token_53>": 59,
      "<reserved_for_smiles_special_token_54>": 60,
      "<reserved_for_smiles_special_token_55>": 61,
      "<reserved_for_smiles_special_token_56>": 62,
      "<reserved_for_smiles_special_token_57>": 63,
      "<reserved_for_smiles_special_token_58>": 64,
      "<reserved_for_smiles_special_token_59>": 65,
      "<reserved_for_smiles_special_token_60>": 66,
      "<reserved_for_smiles_special_token_61>": 67,
      "<reserved_for_smiles_special_token_62>": 68,
      "<reserved_for_smiles_special_token_63>": 69,
      "<reserved_for_smiles_special_token_64>": 70,
      "<reserved_for_smiles_special_token_65>": 71,
      "<reserved_for_smiles_special_token_66>": 72,
      "<reserved_for_smiles_special_token_67>": 73,
      "<reserved_for_smiles_special_token_68>": 74,
      "<reserved_for_smiles_special_token_69>": 75,
      "<reserved_for_smiles_special_token_70>": 76,
      "<reserved_for_smiles_special_token_71>": 77,
      "<reserved_for_smiles_special_token_72>": 78,
      "<reserved_for_smiles_special_token_73>": 79,
      "<reserved_for_smiles_special_token_74>": 80,
      "<reserved_for_smiles_special_token_75>": 81,
      "<reserved_for_smiles_special_token_76>": 82,
      "<reserved_for_smiles_special_token_77>": 83,
      "<reserved_for_smiles_special_token_78>": 84,
      "<reserved_for_smiles_special_token_79>": 85,
      "<reserved_for_smiles_special_token_80>": 86,
      "<reserved_for_smiles_special_token_81>": 87,
      "<reserved_for_smiles_special_token_82>": 88,
      "<reserved_for_smiles_special_token_83>": 89,
      "<reserved_for_smiles_special_token_84>": 90,
      "<reserved_for_smiles_special_token_85>": 91,
      "<reserved_for_smiles_special_token_86>": 92,
      "<reserved_for_smiles_special_token_87>": 93,
      "<reserved_for_smiles_special_token_88>": 94,
      "<reserved_for_smiles_special_token_89>": 95,
      "<reserved_for_smiles_special_token_90>": 96,
      "<reserved_for_smiles_special_token_91>": 97,
      "<reserved_for_smiles_special_token_92>": 98,
      "<reserved_for_smiles_special_token_93>": 99,
      "<reserved_for_smiles_special_token_94>": 100,
      "<reserved_for_smiles_special_token_95>": 101,
      "<reserved_for_smiles_special_token_96>": 102,
      "<reserved_for_smiles_special_token_97>": 103,
      "<reserved_for_smiles_special_token_98>": 104,
      "<reserved_for_smiles_special_token_99>": 105,
      "<reserved_for_smiles_special_token_100>": 106,
      "<reserved_for_smiles_special_token_101>": 107,
      "<reserved_for_smiles_special_token_102>": 108,
      "<reserved_for_smiles_special_token_103>": 109,
      "<reserved_for_smiles_special_token_104>": 110,
      "<reserved_for_smiles_special_token_105>": 111,
      "<reserved_for_smiles_special_token_106>": 112,
      "<reserved_for_smiles_special_token_107>": 113,
      "<reserved_for_smiles_special_token_108>": 114,
      "<reserved_for_smiles_special_token_109>": 115,
      "<reserved_for_smiles_special_token_110>": 116,
      "<reserved_for_smiles_special_token_111>": 117,
      "<reserved_for_smiles_special_token_112>": 118,
      "<reserved_for_smiles_special_token_113>": 119,
      "<reserved_for_smiles_special_token_114>": 120,
      "<reserved_for_smiles_special_token_115>": 121,
      "<reserved_for_smiles_special_token_116>": 122,
      "<reserved_for_smiles_special_token_117>": 123,
      "<reserved_for_smiles_special_token_118>": 124,
      "<reserved_for_smiles_special_token_119>": 125,
      "<reserved_for_smiles_special_token_120>": 126,
      "<reserved_for_smiles_special_token_121>": 127,
      "<reserved_for_smiles_special_token_122>": 128,
      "<reserved_for_smiles_special_token_123>": 129,
      "<reserved_for_smiles_special_token_124>": 130,
      "<reserved_for_smiles_special_token_125>": 131,
      "<reserved_for_smiles_special_token_126>": 132,
      "<reserved_for_smiles_special_token_127>": 133,
      "<reserved_for_smiles_special_token_128>": 134,
      "<reserved_for_smiles_special_token_129>": 135,
      "<reserved_for_smiles_special_token_130>": 136,
      "<reserved_for_smiles_special_token_131>": 137,
      "<reserved_for_smiles_special_token_132>": 138,
      "<reserved_for_smiles_special_token_133>": 139,
      "<reserved_for_smiles_special_token_134>": 140,
      "<reserved_for_smiles_special_token_135>": 141,
      "<reserved_for_smiles_special_token_136>": 142,
      "<reserved_for_smiles_special_token_137>": 143,
      "<reserved_for_smiles_special_token_138>": 144,
      "<reserved_for_smiles_special_token_139>": 145,
      "<reserved_for_smiles_special_token_140>": 146,
      "<reserved_for_smiles_special_token_141>": 147,
      "<reserved_for_smiles_special_token_142>": 148,
      "<reserved_for_smiles_special_token_143>": 149,
      "<reserved_for_smiles_special_token_144>": 150,
      "<reserved_for_smiles_special_token_145>": 151,
      "<reserved_for_smiles_special_token_146>": 152,
      "<reserved_for_smiles_special_token_147>": 153,
      "<reserved_for_smiles_special_token_148>": 154,
      "<reserved_for_smiles_special_token_149>": 155,
      "<reserved_for_smiles_special_token_150>": 156,
      "<reserved_for_smiles_special_token_151>": 157,
      "<reserved_for_smiles_special_token_152>": 158,
      "<reserved_for_smiles_special_token_153>": 159,
      "<reserved_for_smiles_special_token_154>": 160,
      "<reserved_for_smiles_special_token_155>": 161,
      "<reserved_for_smiles_special_token_156>": 162,
      "<reserved_for_smiles_special_token_157>": 163,
      "<reserved_for_smiles_special_token_158>": 164,
      "<reserved_for_smiles_special_token_159>": 165,
      "<reserved_for_smiles_special_token_160>": 166,
      "<reserved_for_smiles_special_token_161>": 167,
      "<reserved_for_smiles_special_token_162>": 168,
      "<reserved_for_smiles_special_token_163>": 169,
      "<reserved_for_smiles_special_token_164>": 170,
      "<reserved_for_smiles_special_token_165>": 171,
      "<reserved_for_smiles_special_token_166>": 172,
      "<reserved_for_smiles_special_token_167>": 173,
      "<reserved_for_smiles_special_token_168>": 174,
      "<reserved_for_smiles_special_token_169>": 175,
      "<reserved_for_smiles_special_token_170>": 176,
      "<reserved_for_smiles_special_token_171>": 177,
      "<reserved_for_smiles_special_token_172>": 178,
      "<reserved_for_smiles_special_token_173>": 179,
      "<reserved_for_smiles_special_token_174>": 180,
      "<reserved_for_smiles_special_token_175>": 181,
      "<reserved_for_smiles_special_token_176>": 182,
      "<reserved_for_smiles_special_token_177>": 183,
      "<reserved_for_smiles_special_token_178>": 184,
      "<reserved_for_smiles_special_token_179>": 185,
      "<reserved_for_smiles_special_token_180>": 186,
      "<reserved_for_smiles_special_token_181>": 187,
      "<reserved_for_smiles_special_token_182>": 188,
      "<reserved_for_smiles_special_token_183>": 189,
      "<reserved_for_smiles_special_token_184>": 190,
      "<reserved_for_smiles_special_token_185>": 191,
      "<reserved_for_smiles_special_token_186>": 192,
      "<reserved_for_smiles_special_token_187>": 193,
      "<reserved_for_smiles_special_token_188>": 194,
      "<reserved_for_smiles_special_token_189>": 195,
      "<reserved_for_smiles_special_token_190>": 196,
      "<reserved_for_smiles_special_token_191>": 197,
      "<reserved_for_smiles_special_token_192>": 198,
      "<reserved_for_smiles_special_token_193>": 199,
      "<reserved_for_smiles_special_token_194>": 200,
      "<reserved_for_smiles_special_token_195>": 201,
      "<reserved_for_smiles_special_token_196>": 202,
      "<reserved_for_smiles_special_token_197>": 203,
      "<reserved_for_smiles_special_token_198>": 204,
      "<reserved_for_smiles_special_token_199>": 205,
      "<reserved_for_smiles_special_token_200>": 206,
      "<reserved_for_smiles_special_token_201>": 207,
      "<reserved_for_smiles_special_token_202>": 208,
      "<reserved_for_smiles_special_token_203>": 209,
      "<reserved_for_smiles_special_token_204>": 210,
      "<reserved_for_smiles_special_token_205>": 211,
      "<reserved_for_smiles_special_token_206>": 212,
      "<reserved_for_smiles_special_token_207>": 213,
      "<reserved_for_smiles_special_token_208>": 214,
      "<reserved_for_smiles_special_token_209>": 215,
      "<reserved_for_smiles_special_token_210>": 216,
      "<reserved_for_smiles_special_token_211>": 217,
      "<reserved_for_smiles_special_token_212>": 218,
      "<reserved_for_smiles_special_token_213>": 219,
      "<reserved_for_smiles_special_token_214>": 220,
      "<reserved_for_smiles_special_token_215>": 221,
      "<reserved_for_smiles_special_token_216>": 222,
      "<reserved_for_smiles_special_token_217>": 223,
      "<reserved_for_smiles_special_token_218>": 224,
      "<reserved_for_smiles_special_token_219>": 225,
      "<reserved_for_smiles_special_token_220>": 226,
      "<reserved_for_smiles_special_token_221>": 227,
      "<reserved_for_smiles_special_token_222>": 228,
      "<reserved_for_smiles_special_token_223>": 229,
      "<reserved_for_smiles_special_token_224>": 230,
      "<reserved_for_smiles_special_token_225>": 231,
      "<reserved_for_smiles_special_token_226>": 232,
      "<reserved_for_smiles_special_token_227>": 233,
      "<reserved_for_smiles_special_token_228>": 234,
      "<reserved_for_smiles_special_token_229>": 235,
      "<reserved_for_smiles_special_token_230>": 236,
      "<reserved_for_smiles_special_token_231>": 237,
      "<reserved_for_smiles_special_token_232>": 238,
      "<reserved_for_smiles_special_token_233>": 239,
      "<reserved_for_smiles_special_token_234>": 240,
      "<reserved_for_smiles_special_token_235>": 241,
      "<reserved_for_smiles_special_token_236>": 242,
      "<reserved_for_smiles_special_token_237>": 243,
      "<reserved_for_smiles_special_token_238>": 244,
      "<reserved_for_smiles_special_token_239>": 245,
      "<reserved_for_smiles_special_token_240>": 246,
      "<reserved_for_smiles_special_token_241>": 247,
      "<reserved_for_smiles_special_token_242>": 248,
      "<reserved_for_smiles_special_token_243>": 249,
      "<reserved_for_smiles_special_token_244>": 250,
      "<reserved_for_smiles_special_token_245>": 251,
      "<reserved_for_smiles_special_token_246>": 252,
      "<reserved_for_smiles_special_token_247>": 253,
      "<reserved_for_smiles_special_token_248>": 254,
      "<reserved_for_smiles_special_token_249>": 255,
      "<reserved_for_smiles_special_token_250>": 256,
      "<reserved_for_smiles_special_token_251>": 257,
      "<reserved_for_smiles_special_token_252>": 258,
      "<reserved_for_smiles_special_token_253>": 259,
      "<reserved_for_smiles_special_token_254>": 260,
      "<reserved_for_smiles_special_token_255>": 261,
      "<reserved_for_smiles_special_token_256>": 262,
      "<reserved_for_smiles_special_token_257>": 263,
      "<reserved_for_smiles_special_token_258>": 264,
      "<reserved_for_smiles_special_token_259>": 265,
      "<reserved_for_smiles_special_token_260>": 266,
      "<reserved_for_smiles_special_token_261>": 267,
      "<reserved_for_smiles_special_token_262>": 268,
      "<reserved_for_smiles_special_token_263>": 269,
      "<reserved_for_smiles_special_token_264>": 270,
      "<reserved_for_smiles_special_token_265>": 271,
      "<reserved_for_smiles_special_token_266>": 272,
      "<reserved_for_smiles_special_token_267>": 273,
      "<reserved_for_smiles_special_token_268>": 274,
      "<reserved_for_smiles_special_token_269>": 275,
      "<reserved_for_smiles_special_token_270>": 276,
      "<reserved_for_smiles_special_token_271>": 277,
      "<reserved_for_smiles_special_token_272>": 278,
      "<reserved_for_smiles_special_token_273>": 279,
      "<reserved_for_smiles_special_token_274>": 280,
      "<reserved_for_smiles_special_token_275>": 281,
      "<reserved_for_smiles_special_token_276>": 282,
      "<reserved_for_smiles_special_token_277>": 283,
      "<reserved_for_smiles_special_token_278>": 284,
      "<reserved_for_smiles_special_token_279>": 285,
      "<reserved_for_smiles_special_token_280>": 286,
      "<reserved_for_smiles_special_token_281>": 287,
      "<reserved_for_smiles_special_token_282>": 288,
      "<reserved_for_smiles_special_token_283>": 289,
      "<reserved_for_smiles_special_token_284>": 290,
      "<reserved_for_smiles_special_token_285>": 291,
      "<reserved_for_smiles_special_token_286>": 292,
      "<reserved_for_smiles_special_token_287>": 293,
      "<reserved_for_smiles_special_token_288>": 294,
      "<reserved_for_smiles_special_token_289>": 295,
      "<reserved_for_smiles_special_token_290>": 296,
      "<reserved_for_smiles_special_token_291>": 297,
      "<reserved_for_smiles_special_token_292>": 298,
      "<reserved_for_smiles_special_token_293>": 299,
      "<reserved_for_smiles_special_token_294>": 300,
      "<reserved_for_smiles_special_token_295>": 301,
      "<reserved_for_smiles_special_token_296>": 302,
      "<reserved_for_smiles_special_token_297>": 303,
      "<reserved_for_smiles_special_token_298>": 304,
      "<reserved_for_smiles_special_token_299>": 305,
      "<reserved_for_smiles_special_token_300>": 306,
      "<reserved_for_smiles_special_token_301>": 307,
      "<reserved_for_smiles_special_token_302>": 308,
      "<reserved_for_smiles_special_token_303>": 309,
      "<reserved_for_smiles_special_token_304>": 310,
      "<reserved_for_smiles_special_token_305>": 311,
      "<reserved_for_smiles_special_token_306>": 312,
      "<reserved_for_smiles_special_token_307>": 313,
      "<reserved_for_smiles_special_token_308>": 314,
      "<reserved_for_smiles_special_token_309>": 315,
      "<reserved_for_smiles_special_token_310>": 316,
      "<reserved_for_smiles_special_token_311>": 317,
      "<reserved_for_smiles_special_token_312>": 318,
      "<reserved_for_smiles_special_token_313>": 319,
      "<reserved_for_smiles_special_token_314>": 320,
      "<reserved_for_smiles_special_token_315>": 321,
      "<reserved_for_smiles_special_token_316>": 322,
      "<reserved_for_smiles_special_token_317>": 323,
      "<reserved_for_smiles_special_token_318>": 324,
      "<reserved_for_smiles_special_token_319>": 325,
      "<reserved_for_smiles_special_token_320>": 326,
      "<reserved_for_smiles_special_token_321>": 327,
      "<reserved_for_smiles_special_token_322>": 328,
      "<reserved_for_smiles_special_token_323>": 329,
      "<reserved_for_smiles_special_token_324>": 330,
      "<reserved_for_smiles_special_token_325>": 331,
      "<reserved_for_smiles_special_token_326>": 332,
      "<reserved_for_smiles_special_token_327>": 333,
      "<reserved_for_smiles_special_token_328>": 334,
      "<reserved_for_smiles_special_token_329>": 335,
      "<reserved_for_smiles_special_token_330>": 336,
      "<reserved_for_smiles_special_token_331>": 337,
      "<reserved_for_smiles_special_token_332>": 338,
      "<reserved_for_smiles_special_token_333>": 339,
      "<reserved_for_smiles_special_token_334>": 340,
      "<reserved_for_smiles_special_token_335>": 341,
      "<reserved_for_smiles_special_token_336>": 342,
      "<reserved_for_smiles_special_token_337>": 343,
      "<reserved_for_smiles_special_token_338>": 344,
      "<reserved_for_smiles_special_token_339>": 345,
      "<reserved_for_smiles_special_token_340>": 346,
      "<reserved_for_smiles_special_token_341>": 347,
      "<reserved_for_smiles_special_token_342>": 348,
      "<reserved_for_smiles_special_token_343>": 349,
      "<reserved_for_smiles_special_token_344>": 350,
      "<reserved_for_smiles_special_token_345>": 351,
      "<reserved_for_smiles_special_token_346>": 352,
      "<reserved_for_smiles_special_token_347>": 353,
      "<reserved_for_smiles_special_token_348>": 354,
      "<reserved_for_smiles_special_token_349>": 355,
      "<reserved_for_smiles_special_token_350>": 356,
      "<reserved_for_smiles_special_token_351>": 357,
      "<reserved_for_smiles_special_token_352>": 358,
      "<reserved_for_smiles_special_token_353>": 359,
      "<reserved_for_smiles_special_token_354>": 360,
      "<reserved_for_smiles_special_token_355>": 361,
      "<reserved_for_smiles_special_token_356>": 362,
      "<reserved_for_smiles_special_token_357>": 363,
      "<reserved_for_smiles_special_token_358>": 364,
      "<reserved_for_smiles_special_token_359>": 365,
      "<reserved_for_smiles_special_token_360>": 366,
      "<reserved_for_smiles_special_token_361>": 367,
      "<reserved_for_smiles_special_token_362>": 368,
      "<reserved_for_smiles_special_token_363>": 369,
      "<reserved_for_smiles_special_token_364>": 370,
      "<reserved_for_smiles_special_token_365>": 371,
      "<reserved_for_smiles_special_token_366>": 372,
      "<reserved_for_smiles_special_token_367>": 373,
      "<reserved_for_smiles_special_token_368>": 374,
      "<reserved_for_smiles_special_token_369>": 375,
      "<reserved_for_smiles_special_token_370>": 376,
      "<reserved_for_smiles_special_token_371>": 377,
      "<reserved_for_smiles_special_token_372>": 378,
      "<reserved_for_smiles_special_token_373>": 379,
      "<reserved_for_smiles_special_token_374>": 380,
      "<reserved_for_smiles_special_token_375>": 381,
      "<reserved_for_smiles_special_token_376>": 382,
      "<reserved_for_smiles_special_token_377>": 383,
      "<reserved_for_smiles_special_token_378>": 384,
      "<reserved_for_smiles_special_token_379>": 385,
      "<reserved_for_smiles_special_token_380>": 386,
      "<reserved_for_smiles_special_token_381>": 387,
      "<reserved_for_smiles_special_token_382>": 388,
      "<reserved_for_smiles_special_token_383>": 389,
      "<reserved_for_smiles_special_token_384>": 390,
      "<reserved_for_smiles_special_token_385>": 391,
      "<reserved_for_smiles_special_token_386>": 392,
      "<reserved_for_smiles_special_token_387>": 393,
      "<reserved_for_smiles_special_token_388>": 394,
      "<reserved_for_smiles_special_token_389>": 395,
      "<reserved_for_smiles_special_token_390>": 396,
      "<reserved_for_smiles_special_token_391>": 397,
      "<reserved_for_smiles_special_token_392>": 398,
      "<reserved_for_smiles_special_token_393>": 399,
      "<reserved_for_smiles_special_token_394>": 400,
      "<reserved_for_smiles_special_token_395>": 401,
      "<reserved_for_smiles_special_token_396>": 402,
      "<reserved_for_smiles_special_token_397>": 403,
      "<reserved_for_smiles_special_token_398>": 404,
      "<reserved_for_smiles_special_token_399>": 405,
      "<reserved_for_smiles_special_token_400>": 406,
      "<reserved_for_smiles_special_token_401>": 407,
      "<reserved_for_smiles_special_token_402>": 408,
      "<reserved_for_smiles_special_token_403>": 409,
      "<reserved_for_smiles_special_token_404>": 410,
      "<reserved_for_smiles_special_token_405>": 411,
      "<reserved_for_smiles_special_token_406>": 412,
      "<reserved_for_smiles_special_token_407>": 413,
      "<reserved_for_smiles_special_token_408>": 414,
      "<reserved_for_smiles_special_token_409>": 415,
      "<reserved_for_smiles_special_token_410>": 416,
      "<reserved_for_smiles_special_token_411>": 417,
      "<reserved_for_smiles_special_token_412>": 418,
      "<reserved_for_smiles_special_token_413>": 419,
      "<reserved_for_smiles_special_token_414>": 420,
      "<reserved_for_smiles_special_token_415>": 421,
      "<reserved_for_smiles_special_token_416>": 422,
      "<reserved_for_smiles_special_token_417>": 423,
      "<reserved_for_smiles_special_token_418>": 424,
      "<reserved_for_smiles_special_token_419>": 425,
      "<reserved_for_smiles_special_token_420>": 426,
      "<reserved_for_smiles_special_token_421>": 427,
      "<reserved_for_smiles_special_token_422>": 428,
      "<reserved_for_smiles_special_token_423>": 429,
      "<reserved_for_smiles_special_token_424>": 430,
      "<reserved_for_smiles_special_token_425>": 431,
      "<reserved_for_smiles_special_token_426>": 432,
      "<reserved_for_smiles_special_token_427>": 433,
      "<reserved_for_smiles_special_token_428>": 434,
      "<reserved_for_smiles_special_token_429>": 435,
      "<reserved_for_smiles_special_token_430>": 436,
      "<reserved_for_smiles_special_token_431>": 437,
      "<reserved_for_smiles_special_token_432>": 438,
      "<reserved_for_smiles_special_token_433>": 439,
      "<reserved_for_smiles_special_token_434>": 440,
      "<reserved_for_smiles_special_token_435>": 441,
      "<reserved_for_smiles_special_token_436>": 442,
      "<reserved_for_smiles_special_token_437>": 443,
      "<reserved_for_smiles_special_token_438>": 444,
      "<reserved_for_smiles_special_token_439>": 445,
      "<reserved_for_smiles_special_token_440>": 446,
      "<reserved_for_smiles_special_token_441>": 447,
      "<reserved_for_smiles_special_token_442>": 448,
      "<reserved_for_smiles_special_token_443>": 449,
      "<reserved_for_smiles_special_token_444>": 450,
      "<reserved_for_smiles_special_token_445>": 451,
      "<reserved_for_smiles_special_token_446>": 452,
      "<reserved_for_smiles_special_token_447>": 453,
      "<reserved_for_smiles_special_token_448>": 454,
      "<reserved_for_smiles_special_token_449>": 455,
      "<reserved_for_smiles_special_token_450>": 456,
      "<reserved_for_smiles_special_token_451>": 457,
      "<reserved_for_smiles_special_token_452>": 458,
      "<reserved_for_smiles_special_token_453>": 459,
      "<reserved_for_smiles_special_token_454>": 460,
      "<reserved_for_smiles_special_token_455>": 461,
      "<reserved_for_smiles_special_token_456>": 462,
      "<reserved_for_smiles_special_token_457>": 463,
      "<reserved_for_smiles_special_token_458>": 464,
      "<reserved_for_smiles_special_token_459>": 465,
      "<reserved_for_smiles_special_token_460>": 466,
      "<reserved_for_smiles_special_token_461>": 467,
      "<reserved_for_smiles_special_token_462>": 468,
      "<reserved_for_smiles_special_token_463>": 469,
      "<reserved_for_smiles_special_token_464>": 470,
      "<reserved_for_smiles_special_token_465>": 471,
      "<reserved_for_smiles_special_token_466>": 472,
      "<reserved_for_smiles_special_token_467>": 473,
      "<reserved_for_smiles_special_token_468>": 474,
      "<reserved_for_smiles_special_token_469>": 475,
      "<reserved_for_smiles_special_token_470>": 476,
      "<reserved_for_smiles_special_token_471>": 477,
      "<reserved_for_smiles_special_token_472>": 478,
      "<reserved_for_smiles_special_token_473>": 479,
      "<reserved_for_smiles_special_token_474>": 480,
      "<reserved_for_smiles_special_token_475>": 481,
      "<reserved_for_smiles_special_token_476>": 482,
      "<reserved_for_smiles_special_token_477>": 483,
      "<reserved_for_smiles_special_token_478>": 484,
      "<reserved_for_smiles_special_token_479>": 485,
      "<reserved_for_smiles_special_token_480>": 486,
      "<reserved_for_smiles_special_token_481>": 487,
      "<reserved_for_smiles_special_token_482>": 488,
      "<reserved_for_smiles_special_token_483>": 489,
      "<reserved_for_smiles_special_token_484>": 490,
      "<reserved_for_smiles_special_token_485>": 491,
      "<reserved_for_smiles_special_token_486>": 492,
      "<reserved_for_smiles_special_token_487>": 493,
      "<reserved_for_smiles_special_token_488>": 494,
      "<reserved_for_smiles_special_token_489>": 495,
      "<reserved_for_smiles_special_token_490>": 496,
      "<reserved_for_smiles_special_token_491>": 497,
      "<reserved_for_smiles_special_token_492>": 498,
      "<reserved_for_smiles_special_token_493>": 499,
      "<reserved_for_smiles_special_token_494>": 500,
      "<reserved_for_smiles_special_token_495>": 501,
      "<reserved_for_smiles_special_token_496>": 502,
      "<reserved_for_smiles_special_token_497>": 503,
      "<reserved_for_smiles_special_token_498>": 504,
      "<reserved_for_smiles_special_token_499>": 505,
      "<reserved_for_smiles_special_token_500>": 506,
      "<reserved_for_smiles_special_token_501>": 507,
      "<reserved_for_smiles_special_token_502>": 508,
      "<reserved_for_smiles_special_token_503>": 509,
      "<reserved_for_smiles_special_token_504>": 510,
      "<reserved_for_smiles_special_token_505>": 511,
      "<reserved_for_smiles_special_token_506>": 512,
      "<reserved_for_smiles_special_token_507>": 513,
      "<reserved_for_smiles_special_token_508>": 514,
      "<reserved_for_smiles_special_token_509>": 515,
      "<reserved_for_smiles_special_token_510>": 516,
      "<reserved_for_smiles_special_token_511>": 517,
      "<reserved_for_smiles_special_token_512>": 518,
      "<reserved_for_smiles_special_token_513>": 519,
      "<reserved_for_smiles_special_token_514>": 520,
      "<reserved_for_smiles_special_token_515>": 521,
      "<reserved_for_smiles_special_token_516>": 522,
      "<reserved_for_smiles_special_token_517>": 523,
      "<reserved_for_smiles_special_token_518>": 524,
      "<reserved_for_smiles_special_token_519>": 525,
      "<reserved_for_smiles_special_token_520>": 526,
      "<reserved_for_smiles_special_token_521>": 527,
      "<reserved_for_smiles_special_token_522>": 528,
      "<reserved_for_smiles_special_token_523>": 529,
      "<reserved_for_smiles_special_token_524>": 530,
      "<reserved_for_smiles_special_token_525>": 531,
      "<reserved_for_smiles_special_token_526>": 532,
      "<reserved_for_smiles_special_token_527>": 533,
      "<reserved_for_smiles_special_token_528>": 534,
      "<reserved_for_smiles_special_token_529>": 535,
      "<reserved_for_smiles_special_token_530>": 536,
      "<reserved_for_smiles_special_token_531>": 537,
      "<reserved_for_smiles_special_token_532>": 538,
      "<reserved_for_smiles_special_token_533>": 539,
      "<reserved_for_smiles_special_token_534>": 540,
      "<reserved_for_smiles_special_token_535>": 541,
      "<reserved_for_smiles_special_token_536>": 542,
      "<reserved_for_smiles_special_token_537>": 543,
      "<reserved_for_smiles_special_token_538>": 544,
      "<reserved_for_smiles_special_token_539>": 545,
      "<reserved_for_smiles_special_token_540>": 546,
      "<reserved_for_smiles_special_token_541>": 547,
      "<reserved_for_smiles_special_token_542>": 548,
      "<reserved_for_smiles_special_token_543>": 549,
      "<reserved_for_smiles_special_token_544>": 550,
      "<reserved_for_smiles_special_token_545>": 551,
      "<reserved_for_smiles_special_token_546>": 552,
      "<reserved_for_smiles_special_token_547>": 553,
      "<reserved_for_smiles_special_token_548>": 554,
      "<reserved_for_smiles_special_token_549>": 555,
      "<reserved_for_smiles_special_token_550>": 556,
      "<reserved_for_smiles_special_token_551>": 557,
      "<reserved_for_smiles_special_token_552>": 558,
      "<reserved_for_smiles_special_token_553>": 559,
      "<reserved_for_smiles_special_token_554>": 560,
      "<reserved_for_smiles_special_token_555>": 561,
      "<reserved_for_smiles_special_token_556>": 562,
      "<reserved_for_smiles_special_token_557>": 563,
      "<reserved_for_smiles_special_token_558>": 564,
      "<reserved_for_smiles_special_token_559>": 565,
      "<reserved_for_smiles_special_token_560>": 566,
      "<reserved_for_smiles_special_token_561>": 567,
      "<reserved_for_smiles_special_token_562>": 568,
      "<reserved_for_smiles_special_token_563>": 569,
      "<reserved_for_smiles_special_token_564>": 570,
      "<reserved_for_smiles_special_token_565>": 571,
      "<reserved_for_smiles_special_token_566>": 572,
      "<reserved_for_smiles_special_token_567>": 573,
      "<reserved_for_smiles_special_token_568>": 574,
      "<reserved_for_smiles_special_token_569>": 575,
      "<reserved_for_smiles_special_token_570>": 576,
      "<reserved_for_smiles_special_token_571>": 577,
      "<reserved_for_smiles_special_token_572>": 578,
      "<reserved_for_smiles_special_token_573>": 579,
      "<reserved_for_smiles_special_token_574>": 580,
      "<reserved_for_smiles_special_token_575>": 581,
      "<reserved_for_smiles_special_token_576>": 582,
      "<reserved_for_smiles_special_token_577>": 583,
      "<reserved_for_smiles_special_token_578>": 584,
      "<reserved_for_smiles_special_token_579>": 585,
      "<reserved_for_smiles_special_token_580>": 586,
      "<reserved_for_smiles_special_token_581>": 587,
      "<reserved_for_smiles_special_token_582>": 588,
      "<reserved_for_smiles_special_token_583>": 589,
      "<reserved_for_smiles_special_token_584>": 590,
      "<reserved_for_smiles_special_token_585>": 591,
      "<reserved_for_smiles_special_token_586>": 592,
      "<reserved_for_smiles_special_token_587>": 593,
      "<reserved_for_smiles_special_token_588>": 594,
      "<reserved_for_smiles_special_token_589>": 595,
      "<reserved_for_smiles_special_token_590>": 596,
      "<reserved_for_smiles_special_token_591>": 597,
      "<reserved_for_smiles_special_token_592>": 598,
      "<reserved_for_smiles_special_token_593>": 599,
      "<reserved_for_smiles_special_token_594>": 600,
      "<reserved_for_smiles_special_token_595>": 601,
      "<reserved_for_smiles_special_token_596>": 602,
      "<reserved_for_smiles_special_token_597>": 603,
      "<reserved_for_smiles_special_token_598>": 604,
      "<reserved_for_smiles_special_token_599>": 605,
      "<reserved_for_smiles_special_token_600>": 606,
      "<reserved_for_smiles_special_token_601>": 607,
      "<reserved_for_smiles_special_token_602>": 608,
      "<reserved_for_smiles_special_token_603>": 609,
      "<reserved_for_smiles_special_token_604>": 610,
      "<reserved_for_smiles_special_token_605>": 611,
      "<reserved_for_smiles_special_token_606>": 612,
      "<reserved_for_smiles_special_token_607>": 613,
      "<reserved_for_smiles_special_token_608>": 614,
      "<reserved_for_smiles_special_token_609>": 615,
      "<reserved_for_smiles_special_token_610>": 616,
      "<reserved_for_smiles_special_token_611>": 617,
      "<reserved_for_smiles_special_token_612>": 618,
      "<reserved_for_smiles_special_token_613>": 619,
      "<reserved_for_smiles_special_token_614>": 620,
      "<reserved_for_smiles_special_token_615>": 621,
      "<reserved_for_smiles_special_token_616>": 622,
      "<reserved_for_smiles_special_token_617>": 623,
      "<reserved_for_smiles_special_token_618>": 624,
      "<reserved_for_smiles_special_token_619>": 625,
      "<reserved_for_smiles_special_token_620>": 626,
      "<reserved_for_smiles_special_token_621>": 627,
      "<reserved_for_smiles_special_token_622>": 628,
      "<reserved_for_smiles_special_token_623>": 629,
      "<reserved_for_smiles_special_token_624>": 630,
      "<reserved_for_smiles_special_token_625>": 631,
      "<reserved_for_smiles_special_token_626>": 632,
      "<reserved_for_smiles_special_token_627>": 633,
      "<reserved_for_smiles_special_token_628>": 634,
      "<reserved_for_smiles_special_token_629>": 635,
      "<reserved_for_smiles_special_token_630>": 636,
      "<reserved_for_smiles_special_token_631>": 637,
      "<reserved_for_smiles_special_token_632>": 638,
      "<reserved_for_smiles_special_token_633>": 639,
      "<reserved_for_smiles_special_token_634>": 640,
      "<reserved_for_smiles_special_token_635>": 641,
      "<reserved_for_smiles_special_token_636>": 642,
      "<reserved_for_smiles_special_token_637>": 643,
      "<reserved_for_smiles_special_token_638>": 644,
      "<reserved_for_smiles_special_token_639>": 645,
      "<reserved_for_smiles_special_token_640>": 646,
      "<reserved_for_smiles_special_token_641>": 647,
      "<reserved_for_smiles_special_token_642>": 648,
      "<reserved_for_smiles_special_token_643>": 649,
      "<reserved_for_smiles_special_token_644>": 650,
      "<reserved_for_smiles_special_token_645>": 651,
      "<reserved_for_smiles_special_token_646>": 652,
      "<reserved_for_smiles_special_token_647>": 653,
      "<reserved_for_smiles_special_token_648>": 654,
      "<reserved_for_smiles_special_token_649>": 655,
      "<reserved_for_smiles_special_token_650>": 656,
      "<reserved_for_smiles_special_token_651>": 657,
      "<reserved_for_smiles_special_token_652>": 658,
      "<reserved_for_smiles_special_token_653>": 659,
      "<reserved_for_smiles_special_token_654>": 660,
      "<reserved_for_smiles_special_token_655>": 661,
      "<reserved_for_smiles_special_token_656>": 662,
      "<reserved_for_smiles_special_token_657>": 663,
      "<reserved_for_smiles_special_token_658>": 664,
      "<reserved_for_smiles_special_token_659>": 665,
      "<reserved_for_smiles_special_token_660>": 666,
      "<reserved_for_smiles_special_token_661>": 667,
      "<reserved_for_smiles_special_token_662>": 668,
      "<reserved_for_smiles_special_token_663>": 669,
      "<reserved_for_smiles_special_token_664>": 670,
      "<reserved_for_smiles_special_token_665>": 671,
      "<reserved_for_smiles_special_token_666>": 672,
      "<reserved_for_smiles_special_token_667>": 673,
      "<reserved_for_smiles_special_token_668>": 674,
      "<reserved_for_smiles_special_token_669>": 675,
      "<reserved_for_smiles_special_token_670>": 676,
      "<reserved_for_smiles_special_token_671>": 677,
      "<reserved_for_smiles_special_token_672>": 678,
      "<reserved_for_smiles_special_token_673>": 679,
      "<reserved_for_smiles_special_token_674>": 680,
      "<reserved_for_smiles_special_token_675>": 681,
      "<reserved_for_smiles_special_token_676>": 682,
      "<reserved_for_smiles_special_token_677>": 683,
      "<reserved_for_smiles_special_token_678>": 684,
      "<reserved_for_smiles_special_token_679>": 685,
      "<reserved_for_smiles_special_token_680>": 686,
      "<reserved_for_smiles_special_token_681>": 687,
      "<reserved_for_smiles_special_token_682>": 688,
      "<reserved_for_smiles_special_token_683>": 689,
      "<reserved_for_smiles_special_token_684>": 690,
      "<reserved_for_smiles_special_token_685>": 691,
      "<reserved_for_smiles_special_token_686>": 692,
      "<reserved_for_smiles_special_token_687>": 693,
      "<reserved_for_smiles_special_token_688>": 694,
      "<reserved_for_smiles_special_token_689>": 695,
      "<reserved_for_smiles_special_token_690>": 696,
      "<reserved_for_smiles_special_token_691>": 697,
      "<reserved_for_smiles_special_token_692>": 698,
      "<reserved_for_smiles_special_token_693>": 699,
      "<reserved_for_smiles_special_token_694>": 700,
      "<reserved_for_smiles_special_token_695>": 701,
      "<reserved_for_smiles_special_token_696>": 702,
      "<reserved_for_smiles_special_token_697>": 703,
      "<reserved_for_smiles_special_token_698>": 704,
      "<reserved_for_smiles_special_token_699>": 705,
      "<reserved_for_smiles_special_token_700>": 706,
      "<reserved_for_smiles_special_token_701>": 707,
      "<reserved_for_smiles_special_token_702>": 708,
      "<reserved_for_smiles_special_token_703>": 709,
      "<reserved_for_smiles_special_token_704>": 710,
      "<reserved_for_smiles_special_token_705>": 711,
      "<reserved_for_smiles_special_token_706>": 712,
      "<reserved_for_smiles_special_token_707>": 713,
      "<reserved_for_smiles_special_token_708>": 714,
      "<reserved_for_smiles_special_token_709>": 715,
      "<reserved_for_smiles_special_token_710>": 716,
      "<reserved_for_smiles_special_token_711>": 717,
      "<reserved_for_smiles_special_token_712>": 718,
      "<reserved_for_smiles_special_token_713>": 719,
      "<reserved_for_smiles_special_token_714>": 720,
      "<reserved_for_smiles_special_token_715>": 721,
      "<reserved_for_smiles_special_token_716>": 722,
      "<reserved_for_smiles_special_token_717>": 723,
      "<reserved_for_smiles_special_token_718>": 724,
      "<reserved_for_smiles_special_token_719>": 725,
      "<reserved_for_smiles_special_token_720>": 726,
      "<reserved_for_smiles_special_token_721>": 727,
      "<reserved_for_smiles_special_token_722>": 728,
      "<reserved_for_smiles_special_token_723>": 729,
      "<reserved_for_smiles_special_token_724>": 730,
      "<reserved_for_smiles_special_token_725>": 731,
      "<reserved_for_smiles_special_token_726>": 732,
      "<reserved_for_smiles_special_token_727>": 733,
      "<reserved_for_smiles_special_token_728>": 734,
      "<reserved_for_smiles_special_token_729>": 735,
      "<reserved_for_smiles_special_token_730>": 736,
      "<reserved_for_smiles_special_token_731>": 737,
      "<reserved_for_smiles_special_token_732>": 738,
      "<reserved_for_smiles_special_token_733>": 739,
      "<reserved_for_smiles_special_token_734>": 740,
      "<reserved_for_smiles_special_token_735>": 741,
      "<reserved_for_smiles_special_token_736>": 742,
      "<reserved_for_smiles_special_token_737>": 743,
      "<reserved_for_smiles_special_token_738>": 744,
      "<reserved_for_smiles_special_token_739>": 745,
      "<reserved_for_smiles_special_token_740>": 746,
      "<reserved_for_smiles_special_token_741>": 747,
      "<reserved_for_smiles_special_token_742>": 748,
      "<reserved_for_smiles_special_token_743>": 749,
      "<reserved_for_smiles_special_token_744>": 750,
      "<reserved_for_smiles_special_token_745>": 751,
      "<reserved_for_smiles_special_token_746>": 752,
      "<reserved_for_smiles_special_token_747>": 753,
      "<reserved_for_smiles_special_token_748>": 754,
      "<reserved_for_smiles_special_token_749>": 755,
      "<reserved_for_smiles_special_token_750>": 756,
      "<reserved_for_smiles_special_token_751>": 757,
      "<reserved_for_smiles_special_token_752>": 758,
      "<reserved_for_smiles_special_token_753>": 759,
      "<reserved_for_smiles_special_token_754>": 760,
      "<reserved_for_smiles_special_token_755>": 761,
      "<reserved_for_smiles_special_token_756>": 762,
      "<reserved_for_smiles_special_token_757>": 763,
      "<reserved_for_smiles_special_token_758>": 764,
      "<reserved_for_smiles_special_token_759>": 765,
      "<reserved_for_smiles_special_token_760>": 766,
      "<reserved_for_smiles_special_token_761>": 767,
      "<reserved_for_smiles_special_token_762>": 768,
      "<reserved_for_smiles_special_token_763>": 769,
      "<reserved_for_smiles_special_token_764>": 770,
      "<reserved_for_smiles_special_token_765>": 771,
      "<reserved_for_smiles_special_token_766>": 772,
      "<reserved_for_smiles_special_token_767>": 773,
      "<reserved_for_smiles_special_token_768>": 774,
      "<reserved_for_smiles_special_token_769>": 775,
      "<reserved_for_smiles_special_token_770>": 776,
      "<reserved_for_smiles_special_token_771>": 777,
      "<reserved_for_smiles_special_token_772>": 778,
      "<reserved_for_smiles_special_token_773>": 779,
      "<reserved_for_smiles_special_token_774>": 780,
      "<reserved_for_smiles_special_token_775>": 781,
      "<reserved_for_smiles_special_token_776>": 782,
      "<reserved_for_smiles_special_token_777>": 783,
      "<reserved_for_smiles_special_token_778>": 784,
      "<reserved_for_smiles_special_token_779>": 785,
      "<reserved_for_smiles_special_token_780>": 786,
      "<reserved_for_smiles_special_token_781>": 787,
      "<reserved_for_smiles_special_token_782>": 788,
      "<reserved_for_smiles_special_token_783>": 789,
      "<reserved_for_smiles_special_token_784>": 790,
      "<reserved_for_smiles_special_token_785>": 791,
      "<reserved_for_smiles_special_token_786>": 792,
      "<reserved_for_smiles_special_token_787>": 793,
      "<reserved_for_smiles_special_token_788>": 794,
      "<reserved_for_smiles_special_token_789>": 795,
      "<reserved_for_smiles_special_token_790>": 796,
      "<reserved_for_smiles_special_token_791>": 797,
      "<reserved_for_smiles_special_token_792>": 798,
      "<reserved_for_smiles_special_token_793>": 799,
      "<reserved_for_smiles_special_token_794>": 800,
      "<reserved_for_smiles_special_token_795>": 801,
      "<reserved_for_smiles_special_token_796>": 802,
      "<reserved_for_smiles_special_token_797>": 803,
      "<reserved_for_smiles_special_token_798>": 804,
      "<reserved_for_smiles_special_token_799>": 805,
      "<reserved_for_smiles_special_token_800>": 806,
      "<reserved_for_smiles_special_token_801>": 807,
      "<reserved_for_smiles_special_token_802>": 808,
      "<reserved_for_smiles_special_token_803>": 809,
      "<reserved_for_smiles_special_token_804>": 810,
      "<reserved_for_smiles_special_token_805>": 811,
      "<reserved_for_smiles_special_token_806>": 812,
      "<reserved_for_smiles_special_token_807>": 813,
      "<reserved_for_smiles_special_token_808>": 814,
      "<reserved_for_smiles_special_token_809>": 815,
      "<reserved_for_smiles_special_token_810>": 816,
      "<reserved_for_smiles_special_token_811>": 817,
      "<reserved_for_smiles_special_token_812>": 818,
      "<reserved_for_smiles_special_token_813>": 819,
      "<reserved_for_smiles_special_token_814>": 820,
      "<reserved_for_smiles_special_token_815>": 821,
      "<reserved_for_smiles_special_token_816>": 822,
      "<reserved_for_smiles_special_token_817>": 823,
      "<reserved_for_smiles_special_token_818>": 824,
      "<reserved_for_smiles_special_token_819>": 825,
      "<reserved_for_smiles_special_token_820>": 826,
      "<reserved_for_smiles_special_token_821>": 827,
      "<reserved_for_smiles_special_token_822>": 828,
      "<reserved_for_smiles_special_token_823>": 829,
      "<reserved_for_smiles_special_token_824>": 830,
      "<reserved_for_smiles_special_token_825>": 831,
      "<reserved_for_smiles_special_token_826>": 832,
      "<reserved_for_smiles_special_token_827>": 833,
      "<reserved_for_smiles_special_token_828>": 834,
      "<reserved_for_smiles_special_token_829>": 835,
      "<reserved_for_smiles_special_token_830>": 836,
      "<reserved_for_smiles_special_token_831>": 837,
      "<reserved_for_smiles_special_token_832>": 838,
      "<reserved_for_smiles_special_token_833>": 839,
      "<reserved_for_smiles_special_token_834>": 840,
      "<reserved_for_smiles_special_token_835>": 841,
      "<reserved_for_smiles_special_token_836>": 842,
      "<reserved_for_smiles_special_token_837>": 843,
      "<reserved_for_smiles_special_token_838>": 844,
      "<reserved_for_smiles_special_token_839>": 845,
      "<reserved_for_smiles_special_token_840>": 846,
      "<reserved_for_smiles_special_token_841>": 847,
      "<reserved_for_smiles_special_token_842>": 848,
      "<reserved_for_smiles_special_token_843>": 849,
      "<reserved_for_smiles_special_token_844>": 850,
      "<reserved_for_smiles_special_token_845>": 851,
      "<reserved_for_smiles_special_token_846>": 852,
      "<reserved_for_smiles_special_token_847>": 853,
      "<reserved_for_smiles_special_token_848>": 854,
      "<reserved_for_smiles_special_token_849>": 855,
      "<reserved_for_smiles_special_token_850>": 856,
      "<reserved_for_smiles_special_token_851>": 857,
      "<reserved_for_smiles_special_token_852>": 858,
      "<reserved_for_smiles_special_token_853>": 859,
      "<reserved_for_smiles_special_token_854>": 860,
      "<reserved_for_smiles_special_token_855>": 861,
      "<reserved_for_smiles_special_token_856>": 862,
      "<reserved_for_smiles_special_token_857>": 863,
      "<reserved_for_smiles_special_token_858>": 864,
      "<reserved_for_smiles_special_token_859>": 865,
      "<reserved_for_smiles_special_token_860>": 866,
      "<reserved_for_smiles_special_token_861>": 867,
      "<reserved_for_smiles_special_token_862>": 868,
      "<reserved_for_smiles_special_token_863>": 869,
      "<reserved_for_smiles_special_token_864>": 870,
      "<reserved_for_smiles_special_token_865>": 871,
      "<reserved_for_smiles_special_token_866>": 872,
      "<reserved_for_smiles_special_token_867>": 873,
      "<reserved_for_smiles_special_token_868>": 874,
      "<reserved_for_smiles_special_token_869>": 875,
      "<reserved_for_smiles_special_token_870>": 876,
      "<reserved_for_smiles_special_token_871>": 877,
      "<reserved_for_smiles_special_token_872>": 878,
      "<reserved_for_smiles_special_token_873>": 879,
      "<reserved_for_smiles_special_token_874>": 880,
      "<reserved_for_smiles_special_token_875>": 881,
      "<reserved_for_smiles_special_token_876>": 882,
      "<reserved_for_smiles_special_token_877>": 883,
      "<reserved_for_smiles_special_token_878>": 884,
      "<reserved_for_smiles_special_token_879>": 885,
