{
  "architectures": [
    "ModernBertForMaskedLM"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 4,
  "hidden_act": "gelu_pytorch_tanh",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 384,
  "initializer_range": 0.02,
  "intermediate_size": 1536,
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 8194,
  "model_type": "modernbert",
  "num_attention_heads": 6,
  "num_hidden_layers": 6,
  "pad_token_id": 6,
  "position_embedding_type": "rope",
  "rope_theta": 10000.0,
  "attention_bias": false,
  "normalization": "rmsnorm",
  "embed_norm": true,
  "local_attention": true,
  "local_attention_rotary_emb_base": 10000,
  "global_attention_every_n_layers": 3,
  "sliding_window": 128,
  "transformers_version": "4.48.0",
  "use_cache": true,
  "vocab_size": 100,
  "_name_or_path": "ume-mini-base",
  "torch_dtype": "float32",
  "auto_map": {
    "AutoTokenizer": "tokenization_ume.UMETokenizer"
  }
} 