{
  "cls_token": "<cls>",
  "eos_token": "<eos>",
  "mask_token": "<mask>",
  "pad_token": "<pad>",
  "unk_token": "<unk>",
  "cls_prot": "<cls_prot>",
  "cls_dna": "<cls_dna>",
  "cls_df": "<cls_sf>"
}
