{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<cls>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "WhitespaceSplit"
      }
    ]
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<cls>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<cls>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<cls>": {
        "id": "<cls>",
        "ids": [
          0
        ],
        "tokens": [
          "<cls>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          2
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<cls>": 0,
      "<pad>": 1,
      "<eos>": 2,
      "<unk>": 3,
      "<mask>": 4,
      ".": 5,
      "-": 6,
      "a": 7,
      "b": 8,
      "c": 9,
      "d": 10,
      "e": 11,
      "f": 12,
      "g": 13,
      "h": 14,
      "i": 15,
      "j": 16,
      "k": 17,
      "l": 18,
      "m": 19,
      "n": 20,
      "o": 21,
      "p": 22,
      "q": 23,
      "r": 24,
      "s": 25,
      "t": 26,
      "u": 27,
      "v": 28,
      "w": 29,
      "x": 30,
      "y": 31,
      "z": 32,
      "aa": 33,
      "ab": 34,
      "ac": 35,
      "ad": 36,
      "ae": 37,
      "af": 38,
      "ag": 39,
      "ah": 40,
      "ai": 41,
      "aj": 42,
      "ak": 43,
      "al": 44,
      "am": 45,
      "an": 46,
      "ao": 47,
      "ap": 48,
      "aq": 49,
      "ar": 50,
      "as": 51,
      "at": 52,
      "au": 53,
      "av": 54,
      "aw": 55,
      "ax": 56,
      "ay": 57,
      "az": 58,
      "ba": 59,
      "bb": 60,
      "bc": 61,
      "bd": 62,
      "be": 63,
      "bf": 64,
      "bg": 65,
      "bh": 66,
      "bi": 67,
      "bj": 68,
      "bk": 69,
      "bl": 70,
      "bm": 71,
      "bn": 72,
      "bo": 73,
      "bp": 74,
      "bq": 75,
      "br": 76,
      "bs": 77,
      "bt": 78,
      "bu": 79,
      "bv": 80,
      "bw": 81,
      "bx": 82,
      "by": 83,
      "bz": 84,
      "ca": 85,
      "cb": 86,
      "cc": 87,
      "cd": 88,
      "ce": 89,
      "cf": 90,
      "cg": 91,
      "ch": 92,
      "ci": 93,
      "cj": 94,
      "ck": 95,
      "cl": 96,
      "cm": 97,
      "cn": 98,
      "co": 99,
      "cp": 100,
      "cq": 101,
      "cr": 102,
      "cs": 103,
      "ct": 104,
      "cu": 105,
      "cv": 106,
      "cw": 107,
      "cx": 108,
      "cy": 109,
      "cz": 110,
      "da": 111,
      "db": 112,
      "dc": 113,
      "dd": 114,
      "de": 115,
      "df": 116,
      "dg": 117,
      "dh": 118,
      "di": 119,
      "dj": 120,
      "dk": 121,
      "dl": 122,
      "dm": 123,
      "dn": 124,
      "do": 125,
      "dp": 126,
      "dq": 127,
      "dr": 128,
      "ds": 129,
      "dt": 130,
      "du": 131,
      "dv": 132,
      "dw": 133,
      "dx": 134,
      "dy": 135,
      "dz": 136,
      "ea": 137,
      "eb": 138,
      "ec": 139,
      "ed": 140,
      "ee": 141,
      "ef": 142,
      "eg": 143,
      "eh": 144,
      "ei": 145,
      "ej": 146,
      "ek": 147,
      "el": 148,
      "em": 149,
      "en": 150,
      "eo": 151,
      "ep": 152,
      "eq": 153,
      "er": 154,
      "es": 155,
      "et": 156,
      "eu": 157,
      "ev": 158,
      "ew": 159,
      "ex": 160,
      "ey": 161,
      "ez": 162,
      "fa": 163,
      "fb": 164,
      "fc": 165,
      "fd": 166,
      "fe": 167,
      "ff": 168,
      "fg": 169,
      "fh": 170,
      "fi": 171,
      "fj": 172,
      "fk": 173,
      "fl": 174,
      "fm": 175,
      "fn": 176,
      "fo": 177,
      "fp": 178,
      "fq": 179,
      "fr": 180,
      "fs": 181,
      "ft": 182,
      "fu": 183,
      "fv": 184,
      "fw": 185,
      "fx": 186,
      "fy": 187,
      "fz": 188,
      "ga": 189,
      "gb": 190,
      "gc": 191,
      "gd": 192,
      "ge": 193,
      "gf": 194,
      "gg": 195,
      "gh": 196,
      "gi": 197,
      "gj": 198,
      "gk": 199,
      "gl": 200,
      "gm": 201,
      "gn": 202,
      "go": 203,
      "gp": 204,
      "gq": 205,
      "gr": 206,
      "gs": 207,
      "gt": 208,
      "gu": 209,
      "gv": 210,
      "gw": 211,
      "gx": 212,
      "gy": 213,
      "gz": 214,
      "ha": 215,
      "hb": 216,
      "hc": 217,
      "hd": 218,
      "he": 219,
      "hf": 220,
      "hg": 221,
      "hh": 222,
      "hi": 223,
      "hj": 224,
      "hk": 225,
      "hl": 226,
      "hm": 227,
      "hn": 228,
      "ho": 229,
      "hp": 230,
      "hq": 231,
      "hr": 232,
      "hs": 233,
      "ht": 234,
      "hu": 235,
      "hv": 236,
      "hw": 237,
      "hx": 238,
      "hy": 239,
      "hz": 240,
      "ia": 241,
      "ib": 242,
      "ic": 243,
      "id": 244,
      "ie": 245,
      "if": 246,
      "ig": 247,
      "ih": 248,
      "ii": 249,
      "ij": 250,
      "ik": 251,
      "il": 252,
      "im": 253,
      "in": 254,
      "io": 255,
      "ip": 256,
      "iq": 257,
      "ir": 258,
      "is": 259,
      "it": 260,
      "iu": 261,
      "iv": 262
    },
    "unk_token": "<unk>"
  }
}