{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<cls>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<sep>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "WhitespaceSplit"
      }
    ]
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<cls>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<cls>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<cls>": {
        "id": "<cls>",
        "ids": [
          0
        ],
        "tokens": [
          "<cls>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          2
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": true,
    "vocab": {
      "<cls>": 0,
      "<pad>": 1,
      "<eos>": 2,
      "<unk>": 3,
      "<mask>": 4,
      "<sep>": 5,
      "<convert>": 6,
      "<interact>": 7,
      "<extra_special_token_2>": 8,
      "<extra_special_token_3>": 9,
      "<extra_special_token_4>": 10,
      "<extra_special_token_5>": 11,
      "<extra_special_token_6>": 12,
      "<extra_special_token_7>": 13,
      "<extra_special_token_8>": 14,
      "<extra_special_token_9>": 15,
      "<extra_special_token_10>": 16,
      "<extra_special_token_11>": 17,
      "<extra_special_token_12>": 18,
      "<extra_special_token_13>": 19,
      "<extra_special_token_14>": 20,
      "<extra_special_token_15>": 21,
      "<extra_special_token_16>": 22,
      "<reserved_for_amino_acids_special_token_17>": 23,
      "<reserved_for_amino_acids_special_token_18>": 24,
      "<reserved_for_amino_acids_special_token_19>": 25,
      "<reserved_for_amino_acids_special_token_20>": 26,
      "<reserved_for_amino_acids_special_token_21>": 27,
      "<reserved_for_amino_acids_special_token_22>": 28,
      "<reserved_for_amino_acids_special_token_23>": 29,
      "<reserved_for_amino_acids_special_token_24>": 30,
      "<reserved_for_amino_acids_special_token_25>": 31,
      "<reserved_for_amino_acids_special_token_26>": 32,
      "<reserved_for_amino_acids_special_token_27>": 33,
      "<reserved_for_amino_acids_special_token_28>": 34,
      "<reserved_for_amino_acids_special_token_29>": 35,
      "<reserved_for_amino_acids_special_token_30>": 36,
      "<reserved_for_amino_acids_special_token_31>": 37,
      "<reserved_for_amino_acids_special_token_32>": 38,
      "<reserved_for_amino_acids_special_token_33>": 39,
      "<reserved_for_amino_acids_special_token_34>": 40,
      "<reserved_for_amino_acids_special_token_35>": 41,
      "<reserved_for_amino_acids_special_token_36>": 42,
      "<reserved_for_amino_acids_special_token_37>": 43,
      "<reserved_for_amino_acids_special_token_38>": 44,
      "<reserved_for_amino_acids_special_token_39>": 45,
      "<reserved_for_amino_acids_special_token_40>": 46,
      "<reserved_for_amino_acids_special_token_41>": 47,
      "<reserved_for_amino_acids_special_token_42>": 48,
      "<reserved_for_amino_acids_special_token_43>": 49,
      ">>": 50,
      "~": 51,
      "C": 52,
      "c": 53,
      "(": 54,
      ")": 55,
      "O": 56,
      "1": 57,
      "2": 58,
      "=": 59,
      "N": 60,
      "3": 61,
      "n": 62,
      "[C@H]": 63,
      "[C@@H]": 64,
      "4": 65,
      "F": 66,
      "[NH+]": 67,
      "S": 68,
      "o": 69,
      "Cl": 70,
      "s": 71,
      "[nH]": 72,
      "5": 73,
      "[NH2+]": 74,
      "#": 75,
      "/": 76,
      "Br": 77,
      "[C@@]": 78,
      "[C@]": 79,
      "[O-]": 80,
      "\\": 81,
      "[nH+]": 82,
      "[NH3+]": 83,
      "6": 84,
      "[n-]": 85,
      "-": 86,
      ".": 87,
      "I": 88,
      "7": 89,
      "[N+]": 90,
      "P": 91,
      "[N-]": 92,
      "[Si]": 93,
      "[2H]": 94,
      "8": 95,
      "[n+]": 96,
      "[H]": 97,
      "B": 98,
      "9": 99,
      "[c-]": 100,
      "[C-]": 101,
      "[S-]": 102,
      "[HH]": 103,
      "[Na+]": 104,
      "[B]": 105,
      "[S@]": 106,
      "[S@@]": 107,
      "[Cl-]": 108,
      "[CH]": 109,
      "%10": 110,
      "[Y]": 111,
      "[Ir]": 112,
      "[S+]": 113,
      "[P+]": 114,
      "%11": 115,
      "[C]": 116,
      "[Br-]": 117,
      "[SiH]": 118,
      "[CH-]": 119,
      "[CH2-]": 120,
      "[SiH2]": 121,
      "[IH2]": 122,
      "[CH3-]": 123,
      "[K+]": 124,
      "[I-]": 125,
      "[3H]": 126,
      "%12": 127,
      "[Se]": 128,
      "[Pt+2]": 129,
      "[Sn]": 130,
      "[Li+]": 131,
      "[cH-]": 132,
      "[Pt]": 133,
      "[V]": 134,
      "[SiH3]": 135,
      "[NH-]": 136,
      "[B-]": 137,
      "%13": 138,
      "[OH-]": 139,
      "[P@@]": 140,
      "[O+]": 141,
      "[P@]": 142,
      "[W]": 143,
      "[H-]": 144,
      "[Ge]": 145,
      "[se]": 146,
      "%14": 147,
      "[PH+]": 148,
      "[Mg+2]": 149,
      "[K]": 150,
      "[Al]": 151,
      "[CH2]": 152,
      "%15": 153,
      "[Zn+2]": 154,
      "[U]": 155,
      "[Co]": 156,
      "[O]": 157,
      "[Rb]": 158,
      "[NH4+]": 159,
      "[Zr+2]": 160,
      "p": 161,
      "[Pd+2]": 162,
      "[Pd]": 163,
      "[Ir+3]": 164,
      "[Ti]": 165,
      "[Cl+3]": 166,
      "[F-]": 167,
      "%16": 168,
      "[Fe]": 169,
      "[Fe+2]": 170,
      "[P-]": 171,
      "[OH+]": 172,
      "[Zr]": 173,
      "[s+]": 174,
      "[Ru]": 175,
      "[N@+]": 176,
      "[Ac]": 177,
      "[Cu]": 178,
      "[C+]": 179,
      "[Ca+2]": 180,
      "[N@@+]": 181,
      "[O-2]": 182,
      "[Zn]": 183,
      "[I+]": 184,
      "[Rf]": 185,
      "[18F]": 186,
      "[Cu+2]": 187,
      "%17": 188,
      "[OH2+]": 189,
      "[2HH]": 190,
      "[Ni]": 191,
      "[As]": 192,
      "[Te]": 193,
      "[Na]": 194,
      "[13CH2]": 195,
      "[13C]": 196,
      "[Tb]": 197,
      "%18": 198,
      "[NH2-]": 199,
      "[Ni+2]": 200,
      "[Cr]": 201,
      "[Cs+]": 202,
      "[Zr+4]": 203,
      "[Ar]": 204,
      "[SH+]": 205,
      "%19": 206,
      "[o+]": 207,
      "[H+]": 208,
      "[Ru+2]": 209,
      "[Zn+]": 210,
      "[Rb+]": 211,
      "[Sb]": 212,
      "[Cu+]": 213,
      "%20": 214,
      "[Ti+4]": 215,
      "[W+2]": 216,
      "[Hg]": 217,
      "[Mn]": 218,
      "[13CH3]": 219,
      "[Al+3]": 220,
      "[Mo]": 221,
      "[CH2+]": 222,
      "[Co+2]": 223,
      "%21": 224,
      "%22": 225,
      "[Hf]": 226,
      "[CH+]": 227,
      "[Rh]": 228,
      "[Re]": 229,
      "%23": 230,
      "[3HH]": 231,
      "[Y+3]": 232,
      "[Ti+2]": 233,
      "[Hf+4]": 234,
      "[PH]": 235,
      "[Ba+2]": 236,
      "[c]": 237,
      "[Ag]": 238,
      "[In]": 239,
      "[Ag+]": 240,
      "[Pb]": 241,
      "[SH2+]": 242,
      "[13CH]": 243,
      "[Pt+4]": 244,
      "[13c]": 245,
      "[Bi]": 246,
      "[13cH]": 247,
      "[Li]": 248,
      "[SH-]": 249,
      "[V+2]": 250,
      "%24": 251,
      "[Mn+2]": 252,
      "[Tl]": 253,
      "[Si-]": 254,
      "[Os]": 255,
      "%25": 256,
      "[U+2]": 257,
      "[14cH]": 258,
      "[Ga]": 259,
      "[Fe+3]": 260,
      "[AlH2]": 261,
      "[Sn+2]": 262,
      "[15NH]": 263,
      "[N]": 264,
      "[Ru+]": 265,
      "[BH3-]": 266,
      "[14C]": 267,
      "[AlH]": 268,
      "[Pd+]": 269,
      "[Ti+3]": 270,
      "[AlH3]": 271,
      "[Au]": 272,
      "%26": 273,
      "[11CH3]": 274,
      "[CH3+]": 275,
      "[Cd]": 276,
      "[PH2+]": 277,
      "[Sn+]": 278,
      "[Gd+3]": 279,
      "[pH]": 280,
      "[14c]": 281,
      "[125I]": 282,
      "%27": 283,
      "[SeH]": 284,
      "[Co+3]": 285,
      "[te]": 286,
      "b": 287,
      "[PH3+]": 288,
      "[2H-]": 289,
      "[15N]": 290,
      "%28": 291,
      "[OH3+]": 292,
      "[Zr+3]": 293,
      "[Ru+3]": 294,
      "[Cr+3]": 295,
      "[Sr+2]": 296,
      "[BH2-]": 297,
      "[14CH2]": 298,
      "[Au+]": 299,
      "[ClH+]": 300,
      "[123I]": 301,
      "%29": 302,
      "[13C@H]": 303,
      "%30": 304,
      "[Rh+2]": 305,
      "[Ca]": 306,
      "[13C@@H]": 307,
      "[IH+]": 308,
      "%31": 309,
      "[cH+]": 310,
      "%32": 311,
      "[Au+3]": 312,
      "[18O]": 313,
      "[Hg+]": 314,
      "[Cd+2]": 315,
      "[Eu]": 316,
      "[Gd]": 317,
      "%33": 318,
      "[Mg]": 319,
      "[S-2]": 320,
      "[Be+2]": 321,
      "[AsH]": 322,
      "[S@@+]": 323,
      "%34": 324,
      "[Ta]": 325,
      "[S@+]": 326,
      "[Al+]": 327,
      "[GeH]": 328,
      "[Pt+]": 329,
      "[SnH]": 330,
      "[La]": 331,
      "[Nb]": 332,
      "[Sb-]": 333,
      "[Fe+]": 334,
      "[GeH2]": 335,
      "[Pr]": 336,
      "[15n]": 337,
      "[15NH2]": 338,
      "%35": 339,
      "%36": 340,
      "[Mo+2]": 341,
      "[Si@@]": 342,
      "[Mn+3]": 343,
      "[Ti+]": 344,
      "[Se-]": 345,
      "[Si@]": 346,
      "[PH-]": 347,
      "[Ce]": 348,
      "[Ce+3]": 349,
      "[Cr+2]": 350,
      "[Fe+4]": 351,
      "[14CH3]": 352,
      "[La+3]": 353,
      "%37": 354,
      "[Os+2]": 355,
      "[SiH4]": 356,
      "%38": 357,
      "[As+]": 358,
      "[Al+2]": 359,
      "[Sb+3]": 360,
      "[131I]": 361,
      "[Cl+2]": 362,
      "[Nd]": 363,
      "[Ni+3]": 364,
      "[3H-]": 365,
      "[BH-]": 366,
      "[Rh+3]": 367,
      "%39": 368,
      "%40": 369,
      "[Nd+3]": 370,
      "[Se+]": 371,
      "[Bi+3]": 372,
      "[I+3]": 373,
      "[Sn+4]": 374,
      "[Sm]": 375,
      "[Hf+2]": 376,
      "%41": 377,
      "[Mo+4]": 378,
      "[Sn+3]": 379,
      "[11C]": 380,
      "%42": 381,
      "[Si+]": 382,
      "[Os+]": 383,
      "[Pb+2]": 384,
      "[Eu+3]": 385,
      "%43": 386,
      "%44": 387,
      "[GeH3]": 388,
      "[BH4-]": 389,
      "[Ga+3]": 390,
      "[Po]": 391,
      "[In+3]": 392,
      "[Al-]": 393,
      "[Cl+]": 394,
      "$": 395,
      "[14C@@H]": 396,
      "[Sc]": 397,
      "[Fe+6]": 398,
      "[Yb]": 399,
      "%45": 400,
      "%46": 401,
      "[14CH]": 402,
      "[c+]": 403,
      "[At]": 404,
      "[Ru+4]": 405,
      "[PH4+]": 406,
      "[Si+4]": 407,
      "[BiH2]": 408,
      "[NH]": 409,
      "[Hg+2]": 410,
      "[p+]": 411,
      "[Ba]": 412,
      "%47": 413,
      "%48": 414,
      "[14C@H]": 415,
      "[Ir+2]": 416,
      "[SiH-]": 417,
      "[I+2]": 418,
      "[GaH]": 419,
      "[18OH]": 420,
      "[AsH2]": 421,
      "[Tc]": 422,
      "[SnH3]": 423,
      "[Sc+3]": 424,
      "[SH3+]": 425,
      "[99Tc+4]": 426,
      "[124I]": 427,
      "[SnH2]": 428,
      "%49": 429,
      "[10B]": 430,
      "[Cs]": 431,
      "[BH]": 432,
      "[Ru+6]": 433,
      "[OH]": 434,
      "%50": 435,
      "[1H]": 436,
      "[Cr+6]": 437,
      "[Ta+5]": 438,
      "[Lu]": 439,
      "[Cr+]": 440,
      "[SbH]": 441,
      "[N@]": 442,
      "[Fm]": 443,
      "[Nb+5]": 444,
      "[Yb+3]": 445,
      "%51": 446,
      "%52": 447,
      "[Er]": 448,
      "[IH2+]": 449,
      "[Sg]": 450,
      "[Sm+3]": 451,
      "[Os+4]": 452,
      "[99Tc]": 453,
      "[Tl+]": 454,
      "[Fe+5]": 455,
      "[17O]": 456,
      "[N@@]": 457,
      "[Br+2]": 458,
      "%53": 459,
      "[10BH2]": 460,
      "[NaH]": 461,
      "[Ho]": 462,
      "[PH2-]": 463,
      "[13C@@]": 464,
      "[As-]": 465,
      "[15N+]": 466,
      "%54": 467,
      "[Se-2]": 468,
      "[15nH]": 469,
      "[Tb+3]": 470,
      "[si]": 471,
      "[Sr]": 472,
      "[se+]": 473,
      "[Th]": 474,
      "[Ru+5]": 475,
      "[No]": 476,
      "[13C@]": 477,
      "[99Tc+3]": 478,
      "[Te+]": 479,
      "[Xe]": 480,
      "[Lu+3]": 481,
      "[Dy]": 482,
      "[He]": 483,
      "%55": 484,
      "[Pr+3]": 485,
      "%56": 486,
      "[ClH2+]": 487,
      "%57": 488,
      "%58": 489,
      "[V+4]": 490,
      "[19F]": 491,
      "%59": 492,
      "%60": 493,
      "[Nb+2]": 494,
      "[B+]": 495,
      "[Co+]": 496,
      "[32P]": 497,
      "[Tc+4]": 498,
      "[76Br]": 499,
      "[P]": 500,
      "[Ce+4]": 501,
      "[Dy+3]": 502,
      "[Bi+2]": 503,
      "[Li-]": 504,
      "[BiH]": 505,
      "[SbH2]": 506,
      "[Er+3]": 507,
      "[TeH]": 508,
      "[Th+4]": 509,
      "[Ta+2]": 510,
      "[Cr+4]": 511,
      "[Tm]": 512,
      "[RuH]": 513,
      "[Tm+3]": 514,
      "%61": 515,
      "%62": 516,
      "[Sb+]": 517,
      "[p-]": 518,
      "[11CH2]": 519,
      "[211At]": 520,
      "%63": 521,
      "[RuH+2]": 522,
      "[Tc+3]": 523,
      "[Eu+2]": 524,
      "[Ga-]": 525,
      "[12C]": 526,
      "[GaH2]": 527,
      "[b-]": 528,
      "[S]": 529,
      "[Mo+3]": 530,
      "[InH2]": 531,
      "[Si+2]": 532,
      "[InH]": 533,
      "[18F-]": 534,
      "[Si-2]": 535,
      "[P-3]": 536,
      "[Bk]": 537,
      "[sH+]": 538,
      "%64": 539,
      "[PbH]": 540,
      "[Sn-]": 541,
      "[Pm]": 542,
      "[Cm]": 543,
      "[pH+]": 544,
      "[Cr+5]": 545,
      "%65": 546,
      "%66": 547,
      "[Lr]": 548,
      "[Pu]": 549,
      "[Ne]": 550,
      "[SH]": 551,
      "[64Cu]": 552,
      "[siH]": 553,
      "[Np]": 554,
      "[Bi+]": 555,
      "[te+]": 556,
      "[SbH3]": 557,
      "[Yb+2]": 558,
      "[AsH3]": 559,
      "[Be]": 560,
      "[Tc+5]": 561,
      "[oH+]": 562,
      "[P@@H]": 563,
      "[SeH2]": 564,
      "[XeH]": 565,
      "[Mn+]": 566,
      "[Ir-3]": 567,
      "%67": 568,
      "[As+3]": 569,
      "[Th+2]": 570,
      "[PoH]": 571,
      "%68": 572,
      "[17OH]": 573,
      "[IH]": 574,
      "[Mg+]": 575,
      "[Pa]": 576,
      "[Ir+]": 577,
      "[Os+6]": 578,
      "[Rh+]": 579,
      "[Gd+2]": 580,
      "[P-2]": 581,
      "[TlH]": 582,
      "%69": 583,
      "[U+4]": 584,
      "[PH-2]": 585,
      "[15n+]": 586,
      "[Ra]": 587,
      "[Am]": 588,
      "[Cf]": 589,
      "[64Cu+2]": 590,
      "[Ho+3]": 591,
      "[SiH2-]": 592,
      "[13C-]": 593,
      "[16O]": 594,
      "%70": 595,
      "[GeH4]": 596,
      "[Au-]": 597,
      "[BH2]": 598,
      "[n@]": 599,
      "[Si@H]": 600,
      "[35S]": 601,
      "[Ru-]": 602,
      "[RuH2]": 603,
      "[11c]": 604,
      "[AlH4-]": 605,
      "[U+3]": 606,
      "[Db]": 607,
      "[12CH2]": 608,
      "[3H+]": 609,
      "[77Br]": 610,
      "[SiH+]": 611,
      "[Co-2]": 612,
      "[Br+]": 613,
      "[Si+3]": 614,
      "[TlH2]": 615,
      "[BH3]": 616,
      "[P@+]": 617,
      "[Pt-2]": 618,
      "[12CH]": 619,
      "[Br+3]": 620,
      "[Os+5]": 621,
      "%71": 622,
      "[W+]": 623,
      "[AsH2+]": 624,
      "[BiH3]": 625,
      "[Es]": 626,
      "[RuH+3]": 627,
      "[Fe-]": 628,
      "[CuH]": 629,
      "[al]": 630,
      "[111In]": 631,
      "%72": 632,
      "[14C@]": 633,
      "[P@H]": 634,
      "[11CH]": 635,
      "[CH3]": 636,
      "[18O-]": 637,
      "[Mo+]": 638,
      "[35Cl]": 639,
      "[P@@+]": 640,
      "[Hg-2]": 641,
      "[Si@@H]": 642,
      "[ClH]": 643,
      "%73": 644,
      "%74": 645,
      "[14C@@]": 646,
      "[B@-]": 647,
      "[InH3]": 648,
      "[14n]": 649,
      "[Nb+3]": 650,
      "[Os+7]": 651,
      "[15NH3+]": 652,
      "[37Cl]": 653,
      "[B@@-]": 654,
      "[Ru+8]": 655,
      "[NiH]": 656,
      "[Cu-]": 657,
      "[Zn-2]": 658,
      "[Rn]": 659,
      "[GaH3]": 660,
      "[Mt]": 661,
      "[68Ga]": 662,
      "[PbH2]": 663,
      "[In+]": 664,
      "[18FH]": 665,
      "[RuH+]": 666,
      "[10BH]": 667,
      "[10BH-]": 668,
      "%75": 669,
      "%76": 670,
      "[PH2]": 671,
      "[13CH4]": 672,
      "[14NH]": 673,
      "[Sn@]": 674,
      "[TeH2]": 675,
      "[68Ga+3]": 676,
      "[Kr]": 677,
      "[11C-]": 678,
      "[Sb+5]": 679,
      "[177Lu]": 680,
      "[PbH2+2]": 681,
      "[s@@]": 682,
      "[s@]": 683,
      "[Tl+3]": 684,
      "[Ir-2]": 685,
      "[AlH2-]": 686,
      "[IrH+2]": 687,
      "[2H+]": 688,
      "[RuH2+2]": 689,
      "[Zn-]": 690,
      "[Tc+2]": 691,
      "[Pd-2]": 692,
      "[AsH3+]": 693,
      "[90Y]": 694,
      "[RuH3]": 695,
      "[AlH-]": 696,
      "[Ni+]": 697,
      "[10B-]": 698,
      "[Nb-]": 699,
      "[AlH+2]": 700,
      "[99Tc+5]": 701,
      "[18O-2]": 702,
      "[Sn@@]": 703,
      "[SH2]": 704,
      "[127I]": 705,
      "[Cu-2]": 706,
      "[AlH2+]": 707,
      "[16OH]": 708,
      "[PtH]": 709,
      "[80Br]": 710,
      "[14N]": 711,
      "[14nH]": 712,
      "[SnH4+2]": 713,
      "[MgH2]": 714,
      "[SeH+]": 715,
      "[99Mo]": 716,
      "*": 717,
      "[ClH2+2]": 718,
      "[6Li+]": 719,
      "[34S]": 720,
      "[si+]": 721,
      "[AlH+]": 722,
      "[AsH+]": 723,
      "[99Tc+2]": 724,
      "[OsH]": 725,
      "[188Re]": 726,
      "[SnH2+]": 727,
      "[98Tc+5]": 728,
      "[67Cu]": 729,
      "%77": 730,
      "%78": 731,
      "[123I-]": 732,
      "[125I-]": 733,
      "[17F]": 734,
      "[Ni-2]": 735,
      "[Ni-]": 736,
      "[AlH3-]": 737,
      "[Bh]": 738,
      "[111In+3]": 739,
      "[186Re]": 740,
      "[12C@@H]": 741,
      "[WH2]": 742,
      "[7Li+]": 743,
      "[Tc+]": 744,
      "[15N-]": 745,
      "[13CH2-]": 746,
      "[Pd-]": 747,
      "[SnH+]": 748,
      "[SnH+3]": 749,
      "[Al-3]": 750,
      "[131I-]": 751,
      "[SiH3-]": 752,
      "[124I-]": 753,
      "[Os-2]": 754,
      "[PbH3]": 755,
      "[SiH3+]": 756,
      "[12C@H]": 757,
      "[si-]": 758,
      "[GeH2-]": 759,
      "[bH-]": 760,
      "[MoH2]": 761,
      "[166Ho+3]": 762,
      "[Tb+4]": 763,
      "[13CH-]": 764,
      "[11B]": 765,
      "%79": 766,
      "%80": 767,
      "%81": 768,
      "%82": 769,
      "%83": 770,
      "%84": 771,
      "%85": 772,
      "[OsH2]": 773,
      "[B@]": 774,
      "[B@@]": 775,
      "[75Se]": 776,
      "[13NH3]": 777,
      "[Ge+4]": 778,
      "[Hg-]": 779,
      "[Ru-2]": 780,
      "[PoH2]": 781,
      "[SiH2+]": 782,
      "[I]": 783,
      "[67Ga+3]": 784,
      "[Tc+6]": 785,
      "[Fr]": 786,
      "[Md]": 787,
      "[SbH3+]": 788,
      "[RhH3]": 789,
      "[Pt-]": 790,
      "[177Lu+3]": 791,
      "[SeH2+]": 792,
      "[15n-]": 793,
      "[33P]": 794,
      "[77Se]": 795,
      "[67Cu+2]": 796,
      "[28Si]": 797,
      "[12cH]": 798,
      "[15NH+]": 799,
      "[P@@H+]": 800,
      "[133Xe]": 801,
      "[Fe-4]": 802,
      "[Cl]": 803,
      "[F]": 804,
      "[Te+4]": 805,
      "[14CH4]": 806,
      "[NH2]": 807,
      "[12C@]": 808,
      "[IrH2]": 809,
      "[15NH3]": 810,
      "[125Te]": 811,
      "[Ge@@]": 812,
      "[Ru-3]": 813,
      "[Te@@]": 814,
      "[35SH]": 815,
      "[TaH]": 816,
      "[13OH]": 817,
      "[99Tc+]": 818,
      "[14c-]": 819,
      "[PtH2]": 820,
      "[PtH+]": 821,
      "[153Gd]": 822,
      "[17NH]": 823,
      "[11C@H]": 824,
      "[60Co+3]": 825,
      "[RhH+2]": 826,
      "%86": 827,
      "[Ca+]": 828,
      "[ZrH2]": 829,
      "[n@@]": 830,
      "[32PH]": 831,
      "[123IH]": 832,
      "[Zr-2]": 833,
      "[Rh-3]": 834,
      "[SnH4]": 835,
      "[SnH3-]": 836,
      "[SnH3+]": 837,
      "[AtH]": 838,
      "[Se+4]": 839,
      "[51Cr]": 840,
      "[Hs]": 841,
      "[18OH2]": 842,
      "[153Sm]": 843,
      "[241Am]": 844,
      "[19BH2]": 845,
      "[12CH3]": 846,
      "[IrH3]": 847,
      "[IrH4]": 848,
      "[WH4]": 849,
      "[CuH2]": 850,
      "[SbH-]": 851,
      "[SbH2+]": 852,
      "[13CH3-]": 853,
      "[FeH]": 854,
      "[195Pt]": 855,
      "[79Br]": 856,
      "[ReH4]": 857,
      "[WH]": 858,
      "[HgH]": 859,
      "[IrH]": 860,
      "[90Y+3]": 861,
      "[14C-]": 862,
      "[Rh-]": 863,
      "[Re-2]": 864,
      "[BiH2+2]": 865,
      "[36Cl]": 866,
      "[99Tc+6]": 867,
      "[14NH2]": 868,
      "[Ti-2]": 869,
      "[13N]": 870,
      "[15NH2+]": 871,
      "[W-]": 872,
      "[164Dy+3]": 873,
      "[RuH4]": 874,
      "[al+]": 875,
      "[89Zr+4]": 876,
      "[BH2+]": 877,
      "[125IH]": 878,
      "[CaH2]": 879,
      "[11C@@H]": 880,
      "[127Xe]": 881,
      "[82Rb+]": 882,
      "[81Kr]": 883,
      "[LiH]": 884,
      "[223Ra]": 885,
      "[85Sr+2]": 886,
      "[47Ca+2]": 887,
      "[KH]": 888,
      "[Cr-2]": 889,
      "[TeH2+]": 890,
      "[SeH-]": 891,
      "[SeH3+]": 892,
      "[TeH+]": 893,
      "[TeH3]": 894,
      "[AsH5]": 895,
      "[BiH5]": 896,
      "[BiH4-]": 897,
      "[PbH4]": 898,
      "[As+5]": 899,
      "[220Rn]": 900,
      "[11CH4]": 901,
      "[32PH3]": 902,
      "[57Fe]": 903,
      "[60Co]": 904,
      "[Se+6]": 905,
      "[166Ho]": 906,
      "[Al-2]": 907,
      "[12BH2]": 908,
      "[14N+]": 909,
      "[15NH4+]": 910,
      "[13NH2]": 911,
      "[SnH2-]": 912,
      "[OsH-]": 913,
      "[BrH]": 914,
      "[15OH]": 915,
      "[Be+]": 916,
      "[13N+]": 917,
      "[CoH2]": 918,
      "[19FH]": 919,
      "[15CH2]": 920,
      "[4He]": 921,
      "[68GaH]": 922,
      "[133I]": 923,
      "[Se@@]": 924,
      "[WH3]": 925,
      "[ZrH]": 926,
      "[213Bi+3]": 927,
      "[TaH3]": 928,
      "[MoH]": 929,
      "[SnH2+2]": 930,
      "[Ge-2]": 931,
      "[FeH2]": 932,
      "[Os+8]": 933,
      "[82Br]": 934,
      "[121I]": 935,
      "[35s]": 936,
      "[Cr-]": 937,
      "[62Cu+2]": 938,
      "[15C]": 939,
      "[122I]": 940,
      "[ReH]": 941,
      "[TaH2]": 942,
      "[RhH]": 943,
      "[RhH2]": 944,
      "[ZnH2]": 945,
      "[11B-]": 946,
      "[13CH+]": 947,
      "[Pr+]": 948,
      "[KrH]": 949,
      "[75Ge]": 950,
      "[YH]": 951,
      "%87": 952,
      "%88": 953,
      "%89": 954,
      "%90": 955,
      "%91": 956,
      "%92": 957,
      "[13O]": 958,
      "[67Ga]": 959,
      "[CoH+]": 960,
      "[TiH]": 961,
      "[89Zr]": 962,
      "[31PH]": 963,
      "[VH]": 964,
      "[GeH3-]": 965,
      "[Ru-4]": 966,
      "[103Pd]": 967,
      "[CeH]": 968,
      "[NiH2]": 969,
      "[197Au]": 970,
      "[81Br]": 971,
      "[ZrH3]": 972,
      "[ZnH+]": 973,
      "[S@@-]": 974,
      "[S@@H]": 975,
      "[SnH6+3]": 976,
      "[Te-]": 977,
      "[135I]": 978,
      "[73Se]": 979,
      "[129Xe]": 980,
      "[89Sr+2]": 981,
      "[N@H+]": 982,
      "[42K+]": 983,
      "[123Te]": 984,
      "[22Na+]": 985,
      "[SrH2]": 986,
      "[15OH2]": 987,
      "[85SrH2]": 988,
      "[45Ca+2]": 989,
      "[Ag-4]": 990,
      "[82Rb]": 991,
      "[76BrH]": 992,
      "[131Cs]": 993,
      "0": 994,
      "[Cd-2]": 995,
      "[Cr-3]": 996,
      "[Fe-3]": 997,
      "[Ni-3]": 998,
      "[Fe-2]": 999,
      "[AsH3-]": 1000,
      "[AsH4+]": 1001,
      "[BH3+]": 1002,
      "[SeH3]": 1003,
      "[TeH3+]": 1004,
      "[TeH4]": 1005,
      "[SbH4+]": 1006,
      "[SbH5]": 1007,
      "[BH4+]": 1008,
      "[203Hg]": 1009,
      "[TlH3]": 1010,
      "[Br]": 1011,
      "[59Fe+3]": 1012,
      "[219Rn]": 1013,
      "[Mo-2]": 1014,
      "[FeH6-4]": 1015,
      "[33PH3]": 1016,
      "[32SH2]": 1017,
      "[34SH2]": 1018,
      "[36SH2]": 1019,
      "[65Zn]": 1020,
      "[113Cd]": 1021,
      "[192Ir]": 1022,
      "[237Np]": 1023,
      "[240Pu]": 1024,
      "[227Ac]": 1025,
      "[18CH3]": 1026,
      "[31P]": 1027,
      "[FeH3]": 1028,
      "[15O]": 1029,
      "[111InH3]": 1030,
      "[22CH3-]": 1031,
      "[CoH+2]": 1032,
      "[201Hg]": 1033,
      "[12CH-]": 1034,
      "[16N+]": 1035,
      "[12N+]": 1036,
      "[9cH]": 1037,
      "[20CH3]": 1038,
      "[GaH-]": 1039,
      "[13NH]": 1040,
      "[22CH2]": 1041,
      "[AlH5-2]": 1042,
      "[10CH2]": 1043,
      "[11CH3+]": 1044,
      "[195Pt+2]": 1045,
      "[18C-]": 1046,
      "[18CH]": 1047,
      "[20C]": 1048,
      "[15CH]": 1049,
      "[9c]": 1050,
      "[10BH3]": 1051,
      "[GeH6-2]": 1052,
      "[153Gd+3]": 1053,
      "[RuH5]": 1054,
      "[BiH4]": 1055,
      "[CoH3]": 1056,
      "[Se@]": 1057,
      "[OsH6]": 1058,
      "[80Br-]": 1059,
      "[CeH3]": 1060,
      "[37ClH]": 1061,
      "[Bi-]": 1062,
      "[OsH4]": 1063,
      "[157Gd+3]": 1064,
      "[14CH3-]": 1065,
      "[64Zn+2]": 1066,
      "[Nb-2]": 1067,
      "[Os-]": 1068,
      "[165Dy]": 1069,
      "[BiH2+]": 1070,
      "[1H-]": 1071,
      "[3He]": 1072,
      "[137Cs+]": 1073,
      "[153Sm+3]": 1074,
      "[152Dy]": 1075,
      "[165Dy+3]": 1076,
      "[198Au]": 1077,
      "[159Gd+3]": 1078,
      "[94Tc]": 1079,
      "[217At]": 1080,
      "[105Rh+3]": 1081,
      "[18o]": 1082,
      "[14CH2-]": 1083,
      "[77se]": 1084,
      "[13cH-]": 1085,
      "[85Br]": 1086,
      "[59Co]": 1087,
      "[122Xe]": 1088,
      "[27Al]": 1089,
      "[7Li]": 1090,
      "[54Cr]": 1091,
      "[198Hg]": 1092,
      "[42K]": 1093,
      "[76Br-]": 1094,
      "[52Mn+2]": 1095,
      "[64Ga]": 1096,
      "[13B]": 1097,
      "[216Bi]": 1098,
      "[71As]": 1099,
      "[201Tl]": 1100,
      "[117Sn+2]": 1101,
      "[11cH]": 1102,
      "[Mn-2]": 1103,
      "[232Th]": 1104,
      "[SnH+2]": 1105,
      "[11CH3-]": 1106,
      "[197Hg]": 1107,
      "[51Cr+3]": 1108,
      "[57Co]": 1109,
      "[203Pb]": 1110,
      "[NbH2]": 1111,
      "[149Pm]": 1112,
      "[77Kr]": 1113,
      "[103Cd]": 1114,
      "[62Ni]": 1115,
      "[NbH3]": 1116,
      "[ReH3]": 1117,
      "[AlH6-3]": 1118,
      "[CrH2]": 1119,
      "[LaH3]": 1120,
      "[SmH3]": 1121,
      "[EuH3]": 1122,
      "[OsH3]": 1123,
      "[MoH5]": 1124,
      "[64Ni]": 1125,
      "[Ge@]": 1126,
      "[66Zn]": 1127,
      "[68Zn]": 1128,
      "[Ge-]": 1129,
      "[PdH2]": 1130,
      "[10c]": 1131,
      "[Tc+7]": 1132,
      "[Co-3]": 1133,
      "[29Si]": 1134,
      "[209Po]": 1135,
      "[208Po]": 1136,
      "[206Po]": 1137,
      "[204Po]": 1138,
      "[202Po]": 1139,
      "[201Po]": 1140,
      "[200Po]": 1141,
      "[199Po]": 1142,
      "[198Po]": 1143,
      "[197Po]": 1144,
      "[196Po]": 1145,
      "[195Po]": 1146,
      "[194Po]": 1147,
      "[193Po]": 1148,
      "[192Po]": 1149,
      "[191Po]": 1150,
      "[190Po]": 1151,
      "[217Po]": 1152,
      "[12C-]": 1153,
      "[12c]": 1154,
      "[SbH4]": 1155,
      "[BH+]": 1156,
      "[225Ac]": 1157,
      "[6Li]": 1158,
      "[38PH]": 1159,
      "[33PH]": 1160,
      "[40PH]": 1161,
      "[16NH]": 1162,
      "[Zr+]": 1163,
      "[PtH3]": 1164,
      "[AuH3]": 1165,
      "[XeH2]": 1166,
      "[ScH3]": 1167,
      "[10C]": 1168,
      "[ZrH2+2]": 1169,
      "[AgH]": 1170,
      "[16n+]": 1171,
      "[15nH+]": 1172,
      "[68GaH3]": 1173,
      "[18c]": 1174,
      "[17OH2]": 1175,
      "[16NH2]": 1176,
      "[8B]": 1177,
      "[PdH+]": 1178,
      "[AuH]": 1179,
      "[239Th]": 1180,
      "[186Lu]": 1181,
      "[1C@@H]": 1182,
      "[1C@H]": 1183,
      "[SH3]": 1184,
      "[S@H]": 1185,
      "[AlH4]": 1186,
      "[P+3]": 1187,
      "[Mn+4]": 1188,
      "[Pb+4]": 1189,
      "[V+5]": 1190,
      "[Ag-]": 1191,
      "[B+3]": 1192,
      "[Pb+3]": 1193,
      "[S+2]": 1194,
      "[N-3]": 1195,
      "[S+4]": 1196,
      "[Ag+2]": 1197,
      "[PH3]": 1198,
      "[Sm+2]": 1199,
      "[PH5]": 1200,
      "[C-4]": 1201,
      "[N+3]": 1202,
      "[Ir-]": 1203,
      "[C+4]": 1204,
      "[V+3]": 1205,
      "[W+6]": 1206,
      "[Ti+6]": 1207,
      "[Nd+]": 1208,
      "[Hf+3]": 1209,
      "[W+4]": 1210,
      "[LaH]": 1211,
      "[Ga+]": 1212,
      "[IH-]": 1213,
      "[U+6]": 1214,
      "[F+]": 1215,
      "[Ag+3]": 1216,
      "[PH4]": 1217,
      "[Na-]": 1218,
      "[Sb+2]": 1219,
      "[Ce+2]": 1220,
      "[Pd+3]": 1221,
      "[Cu+3]": 1222,
      "[Pd+4]": 1223,
      "[Ba+]": 1224,
      "[BrH+]": 1225,
      "[In+2]": 1226,
      "[N+2]": 1227,
      "[N@@H+]": 1228,
      "[Na-2]": 1229,
      "[Ti+5]": 1230,
      "[ArH]": 1231,
      "[SH5]": 1232,
      "[B+2]": 1233,
      "[NH3+2]": 1234,
      "[Tl+2]": 1235,
      "[Cd+]": 1236,
      "[FH+2]": 1237,
      "[Mo+6]": 1238,
      "[BaH2]": 1239,
      "[BaH]": 1240,
      "[229Th]": 1241,
      "[NH+3]": 1242,
      "[7NaH]": 1243,
      "[PtH+2]": 1244,
      "[Re+5]": 1245,
      "[Xe+]": 1246,
      "[Rh+4]": 1247,
      "[AcH]": 1248,
      "[HeH]": 1249,
      "[Sc+2]": 1250,
      "[UH]": 1251,
      "[SiH4+]": 1252,
      "[Ac-]": 1253,
      "[Re+4]": 1254,
      "[118Sn]": 1255,
      "[P+2]": 1256,
      "[9CH]": 1257,
      "[9CH3]": 1258,
      "[Y-]": 1259,
      "[Mn+6]": 1260,
      "[C-2]": 1261,
      "[Bi+5]": 1262,
      "[24NaH]": 1263,
      "[CuH2-]": 1264,
      "[Nb+4]": 1265,
      "[MgH]": 1266,
      "[Ir+4]": 1267,
      "[2NH]": 1268,
      "[Cn]": 1269
    },
    "merges": []
  }
}