{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 2,
      "content": "<cls_smiles>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 7,
      "content": "<sep>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 8,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "(\\[[^\\]]+]|Br?|Cl?|N|O|S|P|F|I|b|c|n|o|s|p|\\(|\\)|\\.|=|#|-|\\+|\\\\|\\/|:|~|@|\\?|>>?|\\*|\\$|\\%[0-9]{2}|[0-9])"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<cls_smiles>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<cls_smiles>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<cls_smiles>": {
        "id": "<cls_smiles>",
        "ids": [
          2
        ],
        "tokens": [
          "<cls_smiles>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          4
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<cls>": 0,
      "<cls_amino_acid>": 1,
      "<cls_smiles>": 2,
      "<cls_nucleotide>": 3,
      "<eos>": 4,
      "<unk>": 5,
      "<pad>": 6,
      "<sep>": 7,
      "<mask>": 8,
      "<cls_convert>": 9,
      "<cls_interact>": 10,
      "<extra_special_token_0>": 11,
      "<extra_special_token_1>": 12,
      "<extra_special_token_2>": 13,
      "<extra_special_token_3>": 14,
      "<extra_special_token_4>": 15,
      "<extra_special_token_5>": 16,
      "<extra_special_token_6>": 17,
      "<extra_special_token_7>": 18,
      "<extra_special_token_8>": 19,
      "<extra_special_token_9>": 20,
      "<extra_special_token_10>": 21,
      "<extra_special_token_11>": 22,
      "<extra_special_token_12>": 23,
      "<extra_special_token_13>": 24,
      "<reserved_for_amino_acids_0>": 25,
      "<reserved_for_amino_acids_1>": 26,
      "<reserved_for_amino_acids_2>": 27,
      "<reserved_for_amino_acids_3>": 28,
      "<reserved_for_amino_acids_4>": 29,
      "<reserved_for_amino_acids_5>": 30,
      "<reserved_for_amino_acids_6>": 31,
      "<reserved_for_amino_acids_7>": 32,
      "<reserved_for_amino_acids_8>": 33,
      "<reserved_for_amino_acids_9>": 34,
      "<reserved_for_amino_acids_10>": 35,
      "<reserved_for_amino_acids_11>": 36,
      "<reserved_for_amino_acids_12>": 37,
      "<reserved_for_amino_acids_13>": 38,
      "<reserved_for_amino_acids_14>": 39,
      "<reserved_for_amino_acids_15>": 40,
      "<reserved_for_amino_acids_16>": 41,
      "<reserved_for_amino_acids_17>": 42,
      "<reserved_for_amino_acids_18>": 43,
      "<reserved_for_amino_acids_19>": 44,
      "<reserved_for_amino_acids_20>": 45,
      "<reserved_for_amino_acids_21>": 46,
      "<reserved_for_amino_acids_22>": 47,
      "<reserved_for_amino_acids_23>": 48,
      "<reserved_for_amino_acids_24>": 49,
      "<reserved_for_amino_acids_25>": 50,
      "<reserved_for_amino_acids_26>": 51,
      ">>": 52,
      "~": 53,
      "C": 54,
      "c": 55,
      "(": 56,
      ")": 57,
      "O": 58,
      "1": 59,
      "2": 60,
      "=": 61,
      "N": 62,
      "3": 63,
      "n": 64,
      "[C@H]": 65,
      "[C@@H]": 66,
      "4": 67,
      "F": 68,
      "[NH+]": 69,
      "S": 70,
      "o": 71,
      "Cl": 72,
      "s": 73,
      "[nH]": 74,
      "5": 75,
      "[NH2+]": 76,
      "#": 77,
      "/": 78,
      "Br": 79,
      "[C@@]": 80,
      "[C@]": 81,
      "[O-]": 82,
      "\\": 83,
      "[nH+]": 84,
      "[NH3+]": 85,
      "6": 86,
      "[n-]": 87,
      "-": 88,
      ".": 89,
      "I": 90,
      "7": 91,
      "[N+]": 92,
      "P": 93,
      "[N-]": 94,
      "[Si]": 95,
      "[2H]": 96,
      "8": 97,
      "[n+]": 98,
      "[H]": 99,
      "B": 100,
      "9": 101,
      "[c-]": 102,
      "[C-]": 103,
      "[S-]": 104,
      "[HH]": 105,
      "[Na+]": 106,
      "[B]": 107,
      "[S@]": 108,
      "[S@@]": 109,
      "[Cl-]": 110,
      "[CH]": 111,
      "%10": 112,
      "[Y]": 113,
      "[Ir]": 114,
      "[S+]": 115,
      "[P+]": 116,
      "%11": 117,
      "[C]": 118,
      "[Br-]": 119,
      "[SiH]": 120,
      "[CH-]": 121,
      "[CH2-]": 122,
      "[SiH2]": 123,
      "[IH2]": 124,
      "[CH3-]": 125,
      "[K+]": 126,
      "[I-]": 127,
      "[3H]": 128,
      "%12": 129,
      "[Se]": 130,
      "[Pt+2]": 131,
      "[Sn]": 132,
      "[Li+]": 133,
      "[cH-]": 134,
      "[Pt]": 135,
      "[V]": 136,
      "[SiH3]": 137,
      "[NH-]": 138,
      "[B-]": 139,
      "%13": 140,
      "[OH-]": 141,
      "[P@@]": 142,
      "[O+]": 143,
      "[P@]": 144,
      "[W]": 145,
      "[H-]": 146,
      "[Ge]": 147,
      "[se]": 148,
      "%14": 149,
      "[PH+]": 150,
      "[Mg+2]": 151,
      "[K]": 152,
      "[Al]": 153,
      "[CH2]": 154,
      "%15": 155,
      "[Zn+2]": 156,
      "[U]": 157,
      "[Co]": 158,
      "[O]": 159,
      "[Rb]": 160,
      "[NH4+]": 161,
      "[Zr+2]": 162,
      "p": 163,
      "[Pd+2]": 164,
      "[Pd]": 165,
      "[Ir+3]": 166,
      "[Ti]": 167,
      "[Cl+3]": 168,
      "[F-]": 169,
      "%16": 170,
      "[Fe]": 171,
      "[Fe+2]": 172,
      "[P-]": 173,
      "[OH+]": 174,
      "[Zr]": 175,
      "[s+]": 176,
      "[Ru]": 177,
      "[N@+]": 178,
      "[Ac]": 179,
      "[Cu]": 180,
      "[C+]": 181,
      "[Ca+2]": 182,
      "[N@@+]": 183,
      "[O-2]": 184,
      "[Zn]": 185,
      "[I+]": 186,
      "[Rf]": 187,
      "[18F]": 188,
      "[Cu+2]": 189,
      "%17": 190,
      "[OH2+]": 191,
      "[2HH]": 192,
      "[Ni]": 193,
      "[As]": 194,
      "[Te]": 195,
      "[Na]": 196,
      "[13CH2]": 197,
      "[13C]": 198,
      "[Tb]": 199,
      "%18": 200,
      "[NH2-]": 201,
      "[Ni+2]": 202,
      "[Cr]": 203,
      "[Cs+]": 204,
      "[Zr+4]": 205,
      "[Ar]": 206,
      "[SH+]": 207,
      "%19": 208,
      "[o+]": 209,
      "[H+]": 210,
      "[Ru+2]": 211,
      "[Zn+]": 212,
      "[Rb+]": 213,
      "[Sb]": 214,
      "[Cu+]": 215,
      "%20": 216,
      "[Ti+4]": 217,
      "[W+2]": 218,
      "[Hg]": 219,
      "[Mn]": 220,
      "[13CH3]": 221,
      "[Al+3]": 222,
      "[Mo]": 223,
      "[CH2+]": 224,
      "[Co+2]": 225,
      "%21": 226,
      "%22": 227,
      "[Hf]": 228,
      "[CH+]": 229,
      "[Rh]": 230,
      "[Re]": 231,
      "%23": 232,
      "[3HH]": 233,
      "[Y+3]": 234,
      "[Ti+2]": 235,
      "[Hf+4]": 236,
      "[PH]": 237,
      "[Ba+2]": 238,
      "[c]": 239,
      "[Ag]": 240,
      "[In]": 241,
      "[Ag+]": 242,
      "[Pb]": 243,
      "[SH2+]": 244,
      "[13CH]": 245,
      "[Pt+4]": 246,
      "[13c]": 247,
      "[Bi]": 248,
      "[13cH]": 249,
      "[Li]": 250,
      "[SH-]": 251,
      "[V+2]": 252,
      "%24": 253,
      "[Mn+2]": 254,
      "[Tl]": 255,
      "[Si-]": 256,
      "[Os]": 257,
      "%25": 258,
      "[U+2]": 259,
      "[14cH]": 260,
      "[Ga]": 261,
      "[Fe+3]": 262,
      "[AlH2]": 263,
      "[Sn+2]": 264,
      "[15NH]": 265,
      "[N]": 266,
      "[Ru+]": 267,
      "[BH3-]": 268,
      "[14C]": 269,
      "[AlH]": 270,
      "[Pd+]": 271,
      "[Ti+3]": 272,
      "[AlH3]": 273,
      "[Au]": 274,
      "%26": 275,
      "[11CH3]": 276,
      "[CH3+]": 277,
      "[Cd]": 278,
      "[PH2+]": 279,
      "[Sn+]": 280,
      "[Gd+3]": 281,
      "[pH]": 282,
      "[14c]": 283,
      "[125I]": 284,
      "%27": 285,
      "[SeH]": 286,
      "[Co+3]": 287,
      "[te]": 288,
      "b": 289,
      "[PH3+]": 290,
      "[2H-]": 291,
      "[15N]": 292,
      "%28": 293,
      "[OH3+]": 294,
      "[Zr+3]": 295,
      "[Ru+3]": 296,
      "[Cr+3]": 297,
      "[Sr+2]": 298,
      "[BH2-]": 299,
      "[14CH2]": 300,
      "[Au+]": 301,
      "[ClH+]": 302,
      "[123I]": 303,
      "%29": 304,
      "[13C@H]": 305,
      "%30": 306,
      "[Rh+2]": 307,
      "[Ca]": 308,
      "[13C@@H]": 309,
      "[IH+]": 310,
      "%31": 311,
      "[cH+]": 312,
      "%32": 313,
      "[Au+3]": 314,
      "[18O]": 315,
      "[Hg+]": 316,
      "[Cd+2]": 317,
      "[Eu]": 318,
      "[Gd]": 319,
      "%33": 320,
      "[Mg]": 321,
      "[S-2]": 322,
      "[Be+2]": 323,
      "[AsH]": 324,
      "[S@@+]": 325,
      "%34": 326,
      "[Ta]": 327,
      "[S@+]": 328,
      "[Al+]": 329,
      "[GeH]": 330,
      "[Pt+]": 331,
      "[SnH]": 332,
      "[La]": 333,
      "[Nb]": 334,
      "[Sb-]": 335,
      "[Fe+]": 336,
      "[GeH2]": 337,
      "[Pr]": 338,
      "[15n]": 339,
      "[15NH2]": 340,
      "%35": 341,
      "%36": 342,
      "[Mo+2]": 343,
      "[Si@@]": 344,
      "[Mn+3]": 345,
      "[Ti+]": 346,
      "[Se-]": 347,
      "[Si@]": 348,
      "[PH-]": 349,
      "[Ce]": 350,
      "[Ce+3]": 351,
      "[Cr+2]": 352,
      "[Fe+4]": 353,
      "[14CH3]": 354,
      "[La+3]": 355,
      "%37": 356,
      "[Os+2]": 357,
      "[SiH4]": 358,
      "%38": 359,
      "[As+]": 360,
      "[Al+2]": 361,
      "[Sb+3]": 362,
      "[131I]": 363,
      "[Cl+2]": 364,
      "[Nd]": 365,
      "[Ni+3]": 366,
      "[3H-]": 367,
      "[BH-]": 368,
      "[Rh+3]": 369,
      "%39": 370,
      "%40": 371,
      "[Nd+3]": 372,
      "[Se+]": 373,
      "[Bi+3]": 374,
      "[I+3]": 375,
      "[Sn+4]": 376,
      "[Sm]": 377,
      "[Hf+2]": 378,
      "%41": 379,
      "[Mo+4]": 380,
      "[Sn+3]": 381,
      "[11C]": 382,
      "%42": 383,
      "[Si+]": 384,
      "[Os+]": 385,
      "[Pb+2]": 386,
      "[Eu+3]": 387,
      "%43": 388,
      "%44": 389,
      "[GeH3]": 390,
      "[BH4-]": 391,
      "[Ga+3]": 392,
      "[Po]": 393,
      "[In+3]": 394,
      "[Al-]": 395,
      "[Cl+]": 396,
      "$": 397,
      "[14C@@H]": 398,
      "[Sc]": 399,
      "[Fe+6]": 400,
      "[Yb]": 401,
      "%45": 402,
      "%46": 403,
      "[14CH]": 404,
      "[c+]": 405,
      "[At]": 406,
      "[Ru+4]": 407,
      "[PH4+]": 408,
      "[Si+4]": 409,
      "[BiH2]": 410,
      "[NH]": 411,
      "[Hg+2]": 412,
      "[p+]": 413,
      "[Ba]": 414,
      "%47": 415,
      "%48": 416,
      "[14C@H]": 417,
      "[Ir+2]": 418,
      "[SiH-]": 419,
      "[I+2]": 420,
      "[GaH]": 421,
      "[18OH]": 422,
      "[AsH2]": 423,
      "[Tc]": 424,
      "[SnH3]": 425,
      "[Sc+3]": 426,
      "[SH3+]": 427,
      "[99Tc+4]": 428,
      "[124I]": 429,
      "[SnH2]": 430,
      "%49": 431,
      "[10B]": 432,
      "[Cs]": 433,
      "[BH]": 434,
      "[Ru+6]": 435,
      "[OH]": 436,
      "%50": 437,
      "[1H]": 438,
      "[Cr+6]": 439,
      "[Ta+5]": 440,
      "[Lu]": 441,
      "[Cr+]": 442,
      "[SbH]": 443,
      "[N@]": 444,
      "[Fm]": 445,
      "[Nb+5]": 446,
      "[Yb+3]": 447,
      "%51": 448,
      "%52": 449,
      "[Er]": 450,
      "[IH2+]": 451,
      "[Sg]": 452,
      "[Sm+3]": 453,
      "[Os+4]": 454,
      "[99Tc]": 455,
      "[Tl+]": 456,
      "[Fe+5]": 457,
      "[17O]": 458,
      "[N@@]": 459,
      "[Br+2]": 460,
      "%53": 461,
      "[10BH2]": 462,
      "[NaH]": 463,
      "[Ho]": 464,
      "[PH2-]": 465,
      "[13C@@]": 466,
      "[As-]": 467,
      "[15N+]": 468,
      "%54": 469,
      "[Se-2]": 470,
      "[15nH]": 471,
      "[Tb+3]": 472,
      "[si]": 473,
      "[Sr]": 474,
      "[se+]": 475,
      "[Th]": 476,
      "[Ru+5]": 477,
      "[No]": 478,
      "[13C@]": 479,
      "[99Tc+3]": 480,
      "[Te+]": 481,
      "[Xe]": 482,
      "[Lu+3]": 483,
      "[Dy]": 484,
      "[He]": 485,
      "%55": 486,
      "[Pr+3]": 487,
      "%56": 488,
      "[ClH2+]": 489,
      "%57": 490,
      "%58": 491,
      "[V+4]": 492,
      "[19F]": 493,
      "%59": 494,
      "%60": 495,
      "[Nb+2]": 496,
      "[B+]": 497,
      "[Co+]": 498,
      "[32P]": 499,
      "[Tc+4]": 500,
      "[76Br]": 501,
      "[P]": 502,
      "[Ce+4]": 503,
      "[Dy+3]": 504,
      "[Bi+2]": 505,
      "[Li-]": 506,
      "[BiH]": 507,
      "[SbH2]": 508,
      "[Er+3]": 509,
      "[TeH]": 510,
      "[Th+4]": 511,
      "[Ta+2]": 512,
      "[Cr+4]": 513,
      "[Tm]": 514,
      "[RuH]": 515,
      "[Tm+3]": 516,
      "%61": 517,
      "%62": 518,
      "[Sb+]": 519,
      "[p-]": 520,
      "[11CH2]": 521,
      "[211At]": 522,
      "%63": 523,
      "[RuH+2]": 524,
      "[Tc+3]": 525,
      "[Eu+2]": 526,
      "[Ga-]": 527,
      "[12C]": 528,
      "[GaH2]": 529,
      "[b-]": 530,
      "[S]": 531,
      "[Mo+3]": 532,
      "[InH2]": 533,
      "[Si+2]": 534,
      "[InH]": 535,
      "[18F-]": 536,
      "[Si-2]": 537,
      "[P-3]": 538,
      "[Bk]": 539,
      "[sH+]": 540,
      "%64": 541,
      "[PbH]": 542,
      "[Sn-]": 543,
      "[Pm]": 544,
      "[Cm]": 545,
      "[pH+]": 546,
      "[Cr+5]": 547,
      "%65": 548,
      "%66": 549,
      "[Lr]": 550,
      "[Pu]": 551,
      "[Ne]": 552,
      "[SH]": 553,
      "[64Cu]": 554,
      "[siH]": 555,
      "[Np]": 556,
      "[Bi+]": 557,
      "[te+]": 558,
      "[SbH3]": 559,
      "[Yb+2]": 560,
      "[AsH3]": 561,
      "[Be]": 562,
      "[Tc+5]": 563,
      "[oH+]": 564,
      "[P@@H]": 565,
      "[SeH2]": 566,
      "[XeH]": 567,
      "[Mn+]": 568,
      "[Ir-3]": 569,
      "%67": 570,
      "[As+3]": 571,
      "[Th+2]": 572,
      "[PoH]": 573,
      "%68": 574,
      "[17OH]": 575,
      "[IH]": 576,
      "[Mg+]": 577,
      "[Pa]": 578,
      "[Ir+]": 579,
      "[Os+6]": 580,
      "[Rh+]": 581,
      "[Gd+2]": 582,
      "[P-2]": 583,
      "[TlH]": 584,
      "%69": 585,
      "[U+4]": 586,
      "[PH-2]": 587,
      "[15n+]": 588,
      "[Ra]": 589,
      "[Am]": 590,
      "[Cf]": 591,
      "[64Cu+2]": 592,
      "[Ho+3]": 593,
      "[SiH2-]": 594,
      "[13C-]": 595,
      "[16O]": 596,
      "%70": 597,
      "[GeH4]": 598,
      "[Au-]": 599,
      "[BH2]": 600,
      "[n@]": 601,
      "[Si@H]": 602,
      "[35S]": 603,
      "[Ru-]": 604,
      "[RuH2]": 605,
      "[11c]": 606,
      "[AlH4-]": 607,
      "[U+3]": 608,
      "[Db]": 609,
      "[12CH2]": 610,
      "[3H+]": 611,
      "[77Br]": 612,
      "[SiH+]": 613,
      "[Co-2]": 614,
      "[Br+]": 615,
      "[Si+3]": 616,
      "[TlH2]": 617,
      "[BH3]": 618,
      "[P@+]": 619,
      "[Pt-2]": 620,
      "[12CH]": 621,
      "[Br+3]": 622,
      "[Os+5]": 623,
      "%71": 624,
      "[W+]": 625,
      "[AsH2+]": 626,
      "[BiH3]": 627,
      "[Es]": 628,
      "[RuH+3]": 629,
      "[Fe-]": 630,
      "[CuH]": 631,
      "[al]": 632,
      "[111In]": 633,
      "%72": 634,
      "[14C@]": 635,
      "[P@H]": 636,
      "[11CH]": 637,
      "[CH3]": 638,
      "[18O-]": 639,
      "[Mo+]": 640,
      "[35Cl]": 641,
      "[P@@+]": 642,
      "[Hg-2]": 643,
      "[Si@@H]": 644,
      "[ClH]": 645,
      "%73": 646,
      "%74": 647,
      "[14C@@]": 648,
      "[B@-]": 649,
      "[InH3]": 650,
      "[14n]": 651,
      "[Nb+3]": 652,
      "[Os+7]": 653,
      "[15NH3+]": 654,
      "[37Cl]": 655,
      "[B@@-]": 656,
      "[Ru+8]": 657,
      "[NiH]": 658,
      "[Cu-]": 659,
      "[Zn-2]": 660,
      "[Rn]": 661,
      "[GaH3]": 662,
      "[Mt]": 663,
      "[68Ga]": 664,
      "[PbH2]": 665,
      "[In+]": 666,
      "[18FH]": 667,
      "[RuH+]": 668,
      "[10BH]": 669,
      "[10BH-]": 670,
      "%75": 671,
      "%76": 672,
      "[PH2]": 673,
      "[13CH4]": 674,
      "[14NH]": 675,
      "[Sn@]": 676,
      "[TeH2]": 677,
      "[68Ga+3]": 678,
      "[Kr]": 679,
      "[11C-]": 680,
      "[Sb+5]": 681,
      "[177Lu]": 682,
      "[PbH2+2]": 683,
      "[s@@]": 684,
      "[s@]": 685,
      "[Tl+3]": 686,
      "[Ir-2]": 687,
      "[AlH2-]": 688,
      "[IrH+2]": 689,
      "[2H+]": 690,
      "[RuH2+2]": 691,
      "[Zn-]": 692,
      "[Tc+2]": 693,
      "[Pd-2]": 694,
      "[AsH3+]": 695,
      "[90Y]": 696,
      "[RuH3]": 697,
      "[AlH-]": 698,
      "[Ni+]": 699,
      "[10B-]": 700,
      "[Nb-]": 701,
      "[AlH+2]": 702,
      "[99Tc+5]": 703,
      "[18O-2]": 704,
      "[Sn@@]": 705,
      "[SH2]": 706,
      "[127I]": 707,
      "[Cu-2]": 708,
      "[AlH2+]": 709,
      "[16OH]": 710,
      "[PtH]": 711,
      "[80Br]": 712,
      "[14N]": 713,
      "[14nH]": 714,
      "[SnH4+2]": 715,
      "[MgH2]": 716,
      "[SeH+]": 717,
      "[99Mo]": 718,
      "*": 719,
      "[ClH2+2]": 720,
      "[6Li+]": 721,
      "[34S]": 722,
      "[si+]": 723,
      "[AlH+]": 724,
      "[AsH+]": 725,
      "[99Tc+2]": 726,
      "[OsH]": 727,
      "[188Re]": 728,
      "[SnH2+]": 729,
      "[98Tc+5]": 730,
      "[67Cu]": 731,
      "%77": 732,
      "%78": 733,
      "[123I-]": 734,
      "[125I-]": 735,
      "[17F]": 736,
      "[Ni-2]": 737,
      "[Ni-]": 738,
      "[AlH3-]": 739,
      "[Bh]": 740,
      "[111In+3]": 741,
      "[186Re]": 742,
      "[12C@@H]": 743,
      "[WH2]": 744,
      "[7Li+]": 745,
      "[Tc+]": 746,
      "[15N-]": 747,
      "[13CH2-]": 748,
      "[Pd-]": 749,
      "[SnH+]": 750,
      "[SnH+3]": 751,
      "[Al-3]": 752,
      "[131I-]": 753,
      "[SiH3-]": 754,
      "[124I-]": 755,
      "[Os-2]": 756,
      "[PbH3]": 757,
      "[SiH3+]": 758,
      "[12C@H]": 759,
      "[si-]": 760,
      "[GeH2-]": 761,
      "[bH-]": 762,
      "[MoH2]": 763,
      "[166Ho+3]": 764,
      "[Tb+4]": 765,
      "[13CH-]": 766,
      "[11B]": 767,
      "%79": 768,
      "%80": 769,
      "%81": 770,
      "%82": 771,
      "%83": 772,
      "%84": 773,
      "%85": 774,
      "[OsH2]": 775,
      "[B@]": 776,
      "[B@@]": 777,
      "[75Se]": 778,
      "[13NH3]": 779,
      "[Ge+4]": 780,
      "[Hg-]": 781,
      "[Ru-2]": 782,
      "[PoH2]": 783,
      "[SiH2+]": 784,
      "[I]": 785,
      "[67Ga+3]": 786,
      "[Tc+6]": 787,
      "[Fr]": 788,
      "[Md]": 789,
      "[SbH3+]": 790,
      "[RhH3]": 791,
      "[Pt-]": 792,
      "[177Lu+3]": 793,
      "[SeH2+]": 794,
      "[15n-]": 795,
      "[33P]": 796,
      "[77Se]": 797,
      "[67Cu+2]": 798,
      "[28Si]": 799,
      "[12cH]": 800,
      "[15NH+]": 801,
      "[P@@H+]": 802,
      "[133Xe]": 803,
      "[Fe-4]": 804,
      "[Cl]": 805,
      "[F]": 806,
      "[Te+4]": 807,
      "[14CH4]": 808,
      "[NH2]": 809,
      "[12C@]": 810,
      "[IrH2]": 811,
      "[15NH3]": 812,
      "[125Te]": 813,
      "[Ge@@]": 814,
      "[Ru-3]": 815,
      "[Te@@]": 816,
      "[35SH]": 817,
      "[TaH]": 818,
      "[13OH]": 819,
      "[99Tc+]": 820,
      "[14c-]": 821,
      "[PtH2]": 822,
      "[PtH+]": 823,
      "[153Gd]": 824,
      "[17NH]": 825,
      "[11C@H]": 826,
      "[60Co+3]": 827,
      "[RhH+2]": 828,
      "%86": 829,
      "[Ca+]": 830,
      "[ZrH2]": 831,
      "[n@@]": 832,
      "[32PH]": 833,
      "[123IH]": 834,
      "[Zr-2]": 835,
      "[Rh-3]": 836,
      "[SnH4]": 837,
      "[SnH3-]": 838,
      "[SnH3+]": 839,
      "[AtH]": 840,
      "[Se+4]": 841,
      "[51Cr]": 842,
      "[Hs]": 843,
      "[18OH2]": 844,
      "[153Sm]": 845,
      "[241Am]": 846,
      "[19BH2]": 847,
      "[12CH3]": 848,
      "[IrH3]": 849,
      "[IrH4]": 850,
      "[WH4]": 851,
      "[CuH2]": 852,
      "[SbH-]": 853,
      "[SbH2+]": 854,
      "[13CH3-]": 855,
      "[FeH]": 856,
      "[195Pt]": 857,
      "[79Br]": 858,
      "[ReH4]": 859,
      "[WH]": 860,
      "[HgH]": 861,
      "[IrH]": 862,
      "[90Y+3]": 863,
      "[14C-]": 864,
      "[Rh-]": 865,
      "[Re-2]": 866,
      "[BiH2+2]": 867,
      "[36Cl]": 868,
      "[99Tc+6]": 869,
      "[14NH2]": 870,
      "[Ti-2]": 871,
      "[13N]": 872,
      "[15NH2+]": 873,
      "[W-]": 874,
      "[164Dy+3]": 875,
      "[RuH4]": 876,
      "[al+]": 877,
      "[89Zr+4]": 878,
      "[BH2+]": 879,
      "[125IH]": 880,
      "[CaH2]": 881,
      "[11C@@H]": 882,
      "[127Xe]": 883,
      "[82Rb+]": 884,
      "[81Kr]": 885,
      "[LiH]": 886,
      "[223Ra]": 887,
      "[85Sr+2]": 888,
      "[47Ca+2]": 889,
      "[KH]": 890,
      "[Cr-2]": 891,
      "[TeH2+]": 892,
      "[SeH-]": 893,
      "[SeH3+]": 894,
      "[TeH+]": 895,
      "[TeH3]": 896,
      "[AsH5]": 897,
      "[BiH5]": 898,
      "[BiH4-]": 899,
      "[PbH4]": 900,
      "[As+5]": 901,
      "[220Rn]": 902,
      "[11CH4]": 903,
      "[32PH3]": 904,
      "[57Fe]": 905,
      "[60Co]": 906,
      "[Se+6]": 907,
      "[166Ho]": 908,
      "[Al-2]": 909,
      "[12BH2]": 910,
      "[14N+]": 911,
      "[15NH4+]": 912,
      "[13NH2]": 913,
      "[SnH2-]": 914,
      "[OsH-]": 915,
      "[BrH]": 916,
      "[15OH]": 917,
      "[Be+]": 918,
      "[13N+]": 919,
      "[CoH2]": 920,
      "[19FH]": 921,
      "[15CH2]": 922,
      "[4He]": 923,
      "[68GaH]": 924,
      "[133I]": 925,
      "[Se@@]": 926,
      "[WH3]": 927,
      "[ZrH]": 928,
      "[213Bi+3]": 929,
      "[TaH3]": 930,
      "[MoH]": 931,
      "[SnH2+2]": 932,
      "[Ge-2]": 933,
      "[FeH2]": 934,
      "[Os+8]": 935,
      "[82Br]": 936,
      "[121I]": 937,
      "[35s]": 938,
      "[Cr-]": 939,
      "[62Cu+2]": 940,
      "[15C]": 941,
      "[122I]": 942,
      "[ReH]": 943,
      "[TaH2]": 944,
      "[RhH]": 945,
      "[RhH2]": 946,
      "[ZnH2]": 947,
      "[11B-]": 948,
      "[13CH+]": 949,
      "[Pr+]": 950,
      "[KrH]": 951,
      "[75Ge]": 952,
      "[YH]": 953,
      "%87": 954,
      "%88": 955,
      "%89": 956,
      "%90": 957,
      "%91": 958,
      "%92": 959,
      "[13O]": 960,
      "[67Ga]": 961,
      "[CoH+]": 962,
      "[TiH]": 963,
      "[89Zr]": 964,
      "[31PH]": 965,
      "[VH]": 966,
      "[GeH3-]": 967,
      "[Ru-4]": 968,
      "[103Pd]": 969,
      "[CeH]": 970,
      "[NiH2]": 971,
      "[197Au]": 972,
      "[81Br]": 973,
      "[ZrH3]": 974,
      "[ZnH+]": 975,
      "[S@@-]": 976,
      "[S@@H]": 977,
      "[SnH6+3]": 978,
      "[Te-]": 979,
      "[135I]": 980,
      "[73Se]": 981,
      "[129Xe]": 982,
      "[89Sr+2]": 983,
      "[N@H+]": 984,
      "[42K+]": 985,
      "[123Te]": 986,
      "[22Na+]": 987,
      "[SrH2]": 988,
      "[15OH2]": 989,
      "[85SrH2]": 990,
      "[45Ca+2]": 991,
      "[Ag-4]": 992,
      "[82Rb]": 993,
      "[76BrH]": 994,
      "[131Cs]": 995,
      "0": 996,
      "[Cd-2]": 997,
      "[Cr-3]": 998,
      "[Fe-3]": 999,
      "[Ni-3]": 1000,
      "[Fe-2]": 1001,
      "[AsH3-]": 1002,
      "[AsH4+]": 1003,
      "[BH3+]": 1004,
      "[SeH3]": 1005,
      "[TeH3+]": 1006,
      "[TeH4]": 1007,
      "[SbH4+]": 1008,
      "[SbH5]": 1009,
      "[BH4+]": 1010,
      "[203Hg]": 1011,
      "[TlH3]": 1012,
      "[Br]": 1013,
      "[59Fe+3]": 1014,
      "[219Rn]": 1015,
      "[Mo-2]": 1016,
      "[FeH6-4]": 1017,
      "[33PH3]": 1018,
      "[32SH2]": 1019,
      "[34SH2]": 1020,
      "[36SH2]": 1021,
      "[65Zn]": 1022,
      "[113Cd]": 1023,
      "[192Ir]": 1024,
      "[237Np]": 1025,
      "[240Pu]": 1026,
      "[227Ac]": 1027,
      "[18CH3]": 1028,
      "[31P]": 1029,
      "[FeH3]": 1030,
      "[15O]": 1031,
      "[111InH3]": 1032,
      "[22CH3-]": 1033,
      "[CoH+2]": 1034,
      "[201Hg]": 1035,
      "[12CH-]": 1036,
      "[16N+]": 1037,
      "[12N+]": 1038,
      "[9cH]": 1039,
      "[20CH3]": 1040,
      "[GaH-]": 1041,
      "[13NH]": 1042,
      "[22CH2]": 1043,
      "[AlH5-2]": 1044,
      "[10CH2]": 1045,
      "[11CH3+]": 1046,
      "[195Pt+2]": 1047,
      "[18C-]": 1048,
      "[18CH]": 1049,
      "[20C]": 1050,
      "[15CH]": 1051,
      "[9c]": 1052,
      "[10BH3]": 1053,
      "[GeH6-2]": 1054,
      "[153Gd+3]": 1055,
      "[RuH5]": 1056,
      "[BiH4]": 1057,
      "[CoH3]": 1058,
      "[Se@]": 1059,
      "[OsH6]": 1060,
      "[80Br-]": 1061,
      "[CeH3]": 1062,
      "[37ClH]": 1063,
      "[Bi-]": 1064,
      "[OsH4]": 1065,
      "[157Gd+3]": 1066,
      "[14CH3-]": 1067,
      "[64Zn+2]": 1068,
      "[Nb-2]": 1069,
      "[Os-]": 1070,
      "[165Dy]": 1071,
      "[BiH2+]": 1072,
      "[1H-]": 1073,
      "[3He]": 1074,
      "[137Cs+]": 1075,
      "[153Sm+3]": 1076,
      "[152Dy]": 1077,
      "[165Dy+3]": 1078,
      "[198Au]": 1079,
      "[159Gd+3]": 1080,
      "[94Tc]": 1081,
      "[217At]": 1082,
      "[105Rh+3]": 1083,
      "[18o]": 1084,
      "[14CH2-]": 1085,
      "[77se]": 1086,
      "[13cH-]": 1087,
      "[85Br]": 1088,
      "[59Co]": 1089,
      "[122Xe]": 1090,
      "[27Al]": 1091,
      "[7Li]": 1092,
      "[54Cr]": 1093,
      "[198Hg]": 1094,
      "[42K]": 1095,
      "[76Br-]": 1096,
      "[52Mn+2]": 1097,
      "[64Ga]": 1098,
      "[13B]": 1099,
      "[216Bi]": 1100,
      "[71As]": 1101,
      "[201Tl]": 1102,
      "[117Sn+2]": 1103,
      "[11cH]": 1104,
      "[Mn-2]": 1105,
      "[232Th]": 1106,
      "[SnH+2]": 1107,
      "[11CH3-]": 1108,
      "[197Hg]": 1109,
      "[51Cr+3]": 1110,
      "[57Co]": 1111,
      "[203Pb]": 1112,
      "[NbH2]": 1113,
      "[149Pm]": 1114,
      "[77Kr]": 1115,
      "[103Cd]": 1116,
      "[62Ni]": 1117,
      "[NbH3]": 1118,
      "[ReH3]": 1119,
      "[AlH6-3]": 1120,
      "[CrH2]": 1121,
      "[LaH3]": 1122,
      "[SmH3]": 1123,
      "[EuH3]": 1124,
      "[OsH3]": 1125,
      "[MoH5]": 1126,
      "[64Ni]": 1127,
      "[Ge@]": 1128,
      "[66Zn]": 1129,
      "[68Zn]": 1130,
      "[Ge-]": 1131,
      "[PdH2]": 1132,
      "[10c]": 1133,
      "[Tc+7]": 1134,
      "[Co-3]": 1135,
      "[29Si]": 1136,
      "[209Po]": 1137,
      "[208Po]": 1138,
      "[206Po]": 1139,
      "[204Po]": 1140,
      "[202Po]": 1141,
      "[201Po]": 1142,
      "[200Po]": 1143,
      "[199Po]": 1144,
      "[198Po]": 1145,
      "[197Po]": 1146,
      "[196Po]": 1147,
      "[195Po]": 1148,
      "[194Po]": 1149,
      "[193Po]": 1150,
      "[192Po]": 1151,
      "[191Po]": 1152,
      "[190Po]": 1153,
      "[217Po]": 1154,
      "[12C-]": 1155,
      "[12c]": 1156,
      "[SbH4]": 1157,
      "[BH+]": 1158,
      "[225Ac]": 1159,
      "[6Li]": 1160,
      "[38PH]": 1161,
      "[33PH]": 1162,
      "[40PH]": 1163,
      "[16NH]": 1164,
      "[Zr+]": 1165,
      "[PtH3]": 1166,
      "[AuH3]": 1167,
      "[XeH2]": 1168,
      "[ScH3]": 1169,
      "[10C]": 1170,
      "[ZrH2+2]": 1171,
      "[AgH]": 1172,
      "[16n+]": 1173,
      "[15nH+]": 1174,
      "[68GaH3]": 1175,
      "[18c]": 1176,
      "[17OH2]": 1177,
      "[16NH2]": 1178,
      "[8B]": 1179,
      "[PdH+]": 1180,
      "[AuH]": 1181,
      "[239Th]": 1182,
      "[186Lu]": 1183,
      "[1C@@H]": 1184,
      "[1C@H]": 1185,
      "[SH3]": 1186,
      "[S@H]": 1187,
      "[AlH4]": 1188,
      "[P+3]": 1189,
      "[Mn+4]": 1190,
      "[Pb+4]": 1191,
      "[V+5]": 1192,
      "[Ag-]": 1193,
      "[B+3]": 1194,
      "[Pb+3]": 1195,
      "[S+2]": 1196,
      "[N-3]": 1197,
      "[S+4]": 1198,
      "[Ag+2]": 1199,
      "[PH3]": 1200,
      "[Sm+2]": 1201,
      "[PH5]": 1202,
      "[C-4]": 1203,
      "[N+3]": 1204,
      "[Ir-]": 1205,
      "[C+4]": 1206,
      "[V+3]": 1207,
      "[W+6]": 1208,
      "[Ti+6]": 1209,
      "[Nd+]": 1210,
      "[Hf+3]": 1211,
      "[W+4]": 1212,
      "[LaH]": 1213,
      "[Ga+]": 1214,
      "[IH-]": 1215,
      "[U+6]": 1216,
      "[F+]": 1217,
      "[Ag+3]": 1218,
      "[PH4]": 1219,
      "[Na-]": 1220,
      "[Sb+2]": 1221,
      "[Ce+2]": 1222,
      "[Pd+3]": 1223,
      "[Cu+3]": 1224,
      "[Pd+4]": 1225,
      "[Ba+]": 1226,
      "[BrH+]": 1227,
      "[In+2]": 1228,
      "[N+2]": 1229,
      "[N@@H+]": 1230,
      "[Na-2]": 1231,
      "[Ti+5]": 1232,
      "[ArH]": 1233,
      "[SH5]": 1234,
      "[B+2]": 1235,
      "[NH3+2]": 1236,
      "[Tl+2]": 1237,
      "[Cd+]": 1238,
      "[FH+2]": 1239,
      "[Mo+6]": 1240,
      "[BaH2]": 1241,
      "[BaH]": 1242,
      "[229Th]": 1243,
      "[NH+3]": 1244,
      "[7NaH]": 1245,
      "[PtH+2]": 1246,
      "[Re+5]": 1247,
      "[Xe+]": 1248,
      "[Rh+4]": 1249,
      "[AcH]": 1250,
      "[HeH]": 1251,
      "[Sc+2]": 1252,
      "[UH]": 1253,
      "[SiH4+]": 1254,
      "[Ac-]": 1255,
      "[Re+4]": 1256,
      "[118Sn]": 1257,
      "[P+2]": 1258,
      "[9CH]": 1259,
      "[9CH3]": 1260,
      "[Y-]": 1261,
      "[Mn+6]": 1262,
      "[C-2]": 1263,
      "[Bi+5]": 1264,
      "[24NaH]": 1265,
      "[CuH2-]": 1266,
      "[Nb+4]": 1267,
      "[MgH]": 1268,
      "[Ir+4]": 1269,
      "[2NH]": 1270,
      "[Cn]": 1271
    },
    "unk_token": "<unk>"
  }
}