{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<cls>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<sep>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "WhitespaceSplit"
      }
    ]
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<cls>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<cls>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<cls>": {
        "id": "<cls>",
        "ids": [
          0
        ],
        "tokens": [
          "<cls>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          2
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": true,
    "vocab": {
      "<cls>": 0,
      "<pad>": 1,
      "<eos>": 2,
      "<unk>": 3,
      "<mask>": 4,
      "<sep>": 5,
      "<reserved_special_token_0>": 6,
      "<reserved_special_token_1>": 7,
      "<reserved_special_token_2>": 8,
      "<reserved_special_token_3>": 9,
      "<reserved_special_token_4>": 10,
      "<reserved_special_token_5>": 11,
      "<reserved_special_token_6>": 12,
      "<reserved_special_token_7>": 13,
      "<reserved_special_token_8>": 14,
      "<reserved_special_token_9>": 15,
      "<reserved_special_token_10>": 16,
      "<reserved_special_token_11>": 17,
      "<reserved_special_token_12>": 18,
      "<reserved_special_token_13>": 19,
      "<reserved_special_token_14>": 20,
      "<reserved_special_token_15>": 21,
      "<reserved_special_token_16>": 22,
      "<reserved_special_token_17>": 23,
      "<reserved_special_token_18>": 24,
      "<reserved_special_token_19>": 25,
      "<reserved_special_token_20>": 26,
      "<reserved_special_token_21>": 27,
      "<reserved_special_token_22>": 28,
      "<reserved_special_token_23>": 29,
      "<reserved_special_token_24>": 30,
      "<reserved_special_token_25>": 31,
      "<reserved_special_token_26>": 32,
      "<reserved_special_token_27>": 33,
      "<reserved_special_token_28>": 34,
      "<reserved_special_token_29>": 35,
      "<reserved_special_token_30>": 36,
      "<reserved_special_token_31>": 37,
      "<reserved_special_token_32>": 38,
      "<reserved_special_token_33>": 39,
      "<reserved_special_token_34>": 40,
      "<reserved_special_token_35>": 41,
      "<reserved_special_token_36>": 42,
      "<reserved_special_token_37>": 43,
      "<reserved_special_token_38>": 44,
      "c": 45,
      "C": 46,
      "(": 47,
      ")": 48,
      "O": 49,
      "1": 50,
      "2": 51,
      "=": 52,
      "N": 53,
      ".": 54,
      "n": 55,
      "3": 56,
      "F": 57,
      "Cl": 58,
      ">>": 59,
      "~": 60,
      "-": 61,
      "4": 62,
      "[C@H]": 63,
      "S": 64,
      "[C@@H]": 65,
      "[O-]": 66,
      "Br": 67,
      "#": 68,
      "/": 69,
      "[nH]": 70,
      "[N+]": 71,
      "s": 72,
      "5": 73,
      "o": 74,
      "P": 75,
      "[Na+]": 76,
      "[Si]": 77,
      "I": 78,
      "[Na]": 79,
      "[Pd]": 80,
      "[K+]": 81,
      "[K]": 82,
      "[P]": 83,
      "B": 84,
      "[C@]": 85,
      "[C@@]": 86,
      "[Cl-]": 87,
      "6": 88,
      "[OH-]": 89,
      "\\": 90,
      "[N-]": 91,
      "[Li]": 92,
      "[H]": 93,
      "[2H]": 94,
      "[NH4+]": 95,
      "[c-]": 96,
      "[P-]": 97,
      "[Cs+]": 98,
      "[Li+]": 99,
      "[Cs]": 100,
      "[NaH]": 101,
      "[H-]": 102,
      "[O+]": 103,
      "[BH4-]": 104,
      "[Cu]": 105,
      "7": 106,
      "[Mg]": 107,
      "[Fe+2]": 108,
      "[n+]": 109,
      "[Sn]": 110,
      "[BH-]": 111,
      "[Pd+2]": 112,
      "[CH]": 113,
      "[I-]": 114,
      "[Br-]": 115,
      "[C-]": 116,
      "[Zn]": 117,
      "[B-]": 118,
      "[F-]": 119,
      "[Al]": 120,
      "[P+]": 121,
      "[BH3-]": 122,
      "[Fe]": 123,
      "[C]": 124,
      "[AlH4]": 125,
      "[Ni]": 126,
      "[SiH]": 127,
      "8": 128,
      "[Cu+2]": 129,
      "[Mn]": 130,
      "[AlH]": 131,
      "[nH+]": 132,
      "[AlH4-]": 133,
      "[O-2]": 134,
      "[Cr]": 135,
      "[Mg+2]": 136,
      "[NH3+]": 137,
      "[S@]": 138,
      "[Pt]": 139,
      "[Al+3]": 140,
      "[S@@]": 141,
      "[S-]": 142,
      "[Ti]": 143,
      "[Zn+2]": 144,
      "[PH]": 145,
      "[NH2+]": 146,
      "[Ru]": 147,
      "[Ag+]": 148,
      "[S+]": 149,
      "[I+3]": 150,
      "[NH+]": 151,
      "[Ca+2]": 152,
      "[Ag]": 153,
      "9": 154,
      "[Os]": 155,
      "[Se]": 156,
      "[SiH2]": 157,
      "[Ca]": 158,
      "[Ti+4]": 159,
      "[Ac]": 160,
      "[Cu+]": 161,
      "[S]": 162,
      "[Rh]": 163,
      "[Cl+3]": 164,
      "[cH-]": 165,
      "[Zn+]": 166,
      "[O]": 167,
      "[Cl+]": 168,
      "[SH]": 169,
      "[H+]": 170,
      "[Pd+]": 171,
      "[se]": 172,
      "[PH+]": 173,
      "[I]": 174,
      "[Pt+2]": 175,
      "[C+]": 176,
      "[Mg+]": 177,
      "[Hg]": 178,
      "[W]": 179,
      "[SnH]": 180,
      "[SiH3]": 181,
      "[Fe+3]": 182,
      "[NH]": 183,
      "[Mo]": 184,
      "[CH2+]": 185,
      "%10": 186,
      "[CH2-]": 187,
      "[CH2]": 188,
      "[n-]": 189,
      "[Ce+4]": 190,
      "[NH-]": 191,
      "[Co]": 192,
      "[I+]": 193,
      "[PH2]": 194,
      "[Pt+4]": 195,
      "[Ce]": 196,
      "[B]": 197,
      "[Sn+2]": 198,
      "[Ba+2]": 199,
      "%11": 200,
      "[Fe-3]": 201,
      "[18F]": 202,
      "[SH-]": 203,
      "[Pb+2]": 204,
      "[Os-2]": 205,
      "[Zr+4]": 206,
      "[N]": 207,
      "[Ir]": 208,
      "[Bi]": 209,
      "[Ni+2]": 210,
      "[P@]": 211,
      "[Co+2]": 212,
      "[s+]": 213,
      "[As]": 214,
      "[P+3]": 215,
      "[Hg+2]": 216,
      "[Yb+3]": 217,
      "[CH-]": 218,
      "[Zr+2]": 219,
      "[Mn+2]": 220,
      "[CH+]": 221,
      "[In]": 222,
      "[KH]": 223,
      "[Ce+3]": 224,
      "[Zr]": 225,
      "[AlH2-]": 226,
      "[OH2+]": 227,
      "[Ti+3]": 228,
      "[Rh+2]": 229,
      "[Sb]": 230,
      "[S-2]": 231,
      "%12": 232,
      "[P@@]": 233,
      "[Si@H]": 234,
      "[Mn+4]": 235,
      "p": 236,
      "[Ba]": 237,
      "[NH2-]": 238,
      "[Ge]": 239,
      "[Pb+4]": 240,
      "[Cr+3]": 241,
      "[Au]": 242,
      "[LiH]": 243,
      "[Sc+3]": 244,
      "[o+]": 245,
      "[Rh-3]": 246,
      "%13": 247,
      "[Br]": 248,
      "[Sb-]": 249,
      "[S@+]": 250,
      "[I+2]": 251,
      "[Ar]": 252,
      "[V]": 253,
      "[Cu-]": 254,
      "[Al-]": 255,
      "[Te]": 256,
      "[13c]": 257,
      "[13C]": 258,
      "[Cl]": 259,
      "[PH4+]": 260,
      "[SiH4]": 261,
      "[te]": 262,
      "[CH3-]": 263,
      "[S@@+]": 264,
      "[Rh+3]": 265,
      "[SH+]": 266,
      "[Bi+3]": 267,
      "[Br+2]": 268,
      "[La]": 269,
      "[La+3]": 270,
      "[Pt-2]": 271,
      "[N@@]": 272,
      "[PH3+]": 273,
      "[N@]": 274,
      "[Si+4]": 275,
      "[Sr+2]": 276,
      "[Al+]": 277,
      "[Pb]": 278,
      "[SeH]": 279,
      "[Si-]": 280,
      "[V+5]": 281,
      "[Y+3]": 282,
      "[Re]": 283,
      "[Ru+]": 284,
      "[Sm]": 285,
      "*": 286,
      "[3H]": 287,
      "[NH2]": 288,
      "[Ag-]": 289,
      "[13CH3]": 290,
      "[OH+]": 291,
      "[Ru+3]": 292,
      "[OH]": 293,
      "[Gd+3]": 294,
      "[13CH2]": 295,
      "[In+3]": 296,
      "[Si@@]": 297,
      "[Si@]": 298,
      "[Ti+2]": 299,
      "[Sn+]": 300,
      "[Cl+2]": 301,
      "[AlH-]": 302,
      "[Pd-2]": 303,
      "[SnH3]": 304,
      "[B+3]": 305,
      "[Cu-2]": 306,
      "[Nd+3]": 307,
      "[Pb+3]": 308,
      "[13cH]": 309,
      "[Fe-4]": 310,
      "[Ga]": 311,
      "[Sn+4]": 312,
      "[Hg+]": 313,
      "[11CH3]": 314,
      "[Hf]": 315,
      "[Pr]": 316,
      "[Y]": 317,
      "[S+2]": 318,
      "[Cd]": 319,
      "[Cr+6]": 320,
      "[Zr+3]": 321,
      "[Rh+]": 322,
      "[CH3]": 323,
      "[N-3]": 324,
      "[Hf+2]": 325,
      "[Th]": 326,
      "[Sb+3]": 327,
      "%14": 328,
      "[Cr+2]": 329,
      "[Ru+2]": 330,
      "[Hf+4]": 331,
      "[14C]": 332,
      "[Ta]": 333,
      "[Tl+]": 334,
      "[B+]": 335,
      "[Os+4]": 336,
      "[PdH2]": 337,
      "[Pd-]": 338,
      "[Cd+2]": 339,
      "[Co+3]": 340,
      "[S+4]": 341,
      "[Nb+5]": 342,
      "[123I]": 343,
      "[c+]": 344,
      "[Rb+]": 345,
      "[V+2]": 346,
      "[CH3+]": 347,
      "[Ag+2]": 348,
      "[cH+]": 349,
      "[Mn+3]": 350,
      "[Se-]": 351,
      "[As-]": 352,
      "[Eu+3]": 353,
      "[SH2]": 354,
      "[Sm+3]": 355,
      "[IH+]": 356,
      "%15": 357,
      "[OH3+]": 358,
      "[PH3]": 359,
      "[IH2+]": 360,
      "[SH2+]": 361,
      "[Ir+3]": 362,
      "[AlH3]": 363,
      "[Sc]": 364,
      "[Yb]": 365,
      "[15NH2]": 366,
      "[Lu]": 367,
      "[sH+]": 368,
      "[Gd]": 369,
      "[18F-]": 370,
      "[SH3+]": 371,
      "[SnH4]": 372,
      "[TeH]": 373,
      "[Si@@H]": 374,
      "[Ga+3]": 375,
      "[CaH2]": 376,
      "[Tl]": 377,
      "[Ta+5]": 378,
      "[GeH]": 379,
      "[Br+]": 380,
      "[Sr]": 381,
      "[Tl+3]": 382,
      "[Sm+2]": 383,
      "[PH5]": 384,
      "%16": 385,
      "[N@@+]": 386,
      "[Au+3]": 387,
      "[C-4]": 388,
      "[Nd]": 389,
      "[Ti+]": 390,
      "[IH]": 391,
      "[N@+]": 392,
      "[125I]": 393,
      "[Eu]": 394,
      "[Sn+3]": 395,
      "[Nb]": 396,
      "[Er+3]": 397,
      "[123I-]": 398,
      "[14c]": 399,
      "%17": 400,
      "[SnH2]": 401,
      "[YH]": 402,
      "[Sb+5]": 403,
      "[Pr+3]": 404,
      "[Ir+]": 405,
      "[N+3]": 406,
      "[AlH2]": 407,
      "[19F]": 408,
      "%18": 409,
      "[Tb]": 410,
      "[14CH]": 411,
      "[Mo+4]": 412,
      "[Si+]": 413,
      "[BH]": 414,
      "[Be]": 415,
      "[Rb]": 416,
      "[pH]": 417,
      "%19": 418,
      "%20": 419,
      "[Xe]": 420,
      "[Ir-]": 421,
      "[Be+2]": 422,
      "[C+4]": 423,
      "[RuH2]": 424,
      "[15NH]": 425,
      "[U+2]": 426,
      "[Au-]": 427,
      "%21": 428,
      "%22": 429,
      "[Au+]": 430,
      "[15n]": 431,
      "[Al+2]": 432,
      "[Tb+3]": 433,
      "[15N]": 434,
      "[V+3]": 435,
      "[W+6]": 436,
      "[14CH3]": 437,
      "[Cr+4]": 438,
      "[ClH+]": 439,
      "b": 440,
      "[Ti+6]": 441,
      "[Nd+]": 442,
      "[Zr+]": 443,
      "[PH2+]": 444,
      "[Fm]": 445,
      "[N@H+]": 446,
      "[RuH]": 447,
      "[Dy+3]": 448,
      "%23": 449,
      "[Hf+3]": 450,
      "[W+4]": 451,
      "[11C]": 452,
      "[13CH]": 453,
      "[Er]": 454,
      "[124I]": 455,
      "[LaH]": 456,
      "[F]": 457,
      "[siH]": 458,
      "[Ga+]": 459,
      "[Cm]": 460,
      "[GeH3]": 461,
      "[IH-]": 462,
      "[U+6]": 463,
      "[SeH+]": 464,
      "[32P]": 465,
      "[SeH-]": 466,
      "[Pt-]": 467,
      "[Ir+2]": 468,
      "[se+]": 469,
      "[U]": 470,
      "[F+]": 471,
      "[BH2]": 472,
      "[As+]": 473,
      "[Cf]": 474,
      "[ClH2+]": 475,
      "[Ni+]": 476,
      "[TeH3]": 477,
      "[SbH2]": 478,
      "[Ag+3]": 479,
      "%24": 480,
      "[18O]": 481,
      "[PH4]": 482,
      "[Os+2]": 483,
      "[Na-]": 484,
      "[Sb+2]": 485,
      "[V+4]": 486,
      "[Ho+3]": 487,
      "[68Ga]": 488,
      "[PH-]": 489,
      "[Bi+2]": 490,
      "[Ce+2]": 491,
      "[Pd+3]": 492,
      "[99Tc]": 493,
      "[13C@@H]": 494,
      "[Fe+6]": 495,
      "[c]": 496,
      "[GeH2]": 497,
      "[10B]": 498,
      "[Cu+3]": 499,
      "[Mo+2]": 500,
      "[Cr+]": 501,
      "[Pd+4]": 502,
      "[Dy]": 503,
      "[AsH]": 504,
      "[Ba+]": 505,
      "[SeH2]": 506,
      "[In+]": 507,
      "[TeH2]": 508,
      "[BrH+]": 509,
      "[14cH]": 510,
      "[W+]": 511,
      "[13C@H]": 512,
      "[AsH2]": 513,
      "[In+2]": 514,
      "[N+2]": 515,
      "[N@@H+]": 516,
      "[SbH]": 517,
      "[60Co]": 518,
      "[AsH4+]": 519,
      "[AsH3]": 520,
      "[18OH]": 521,
      "[Ru-2]": 522,
      "[Na-2]": 523,
      "[CuH2]": 524,
      "[31P]": 525,
      "[Ti+5]": 526,
      "[35S]": 527,
      "[P@@H]": 528,
      "[ArH]": 529,
      "[Co+]": 530,
      "[Zr-2]": 531,
      "[BH2-]": 532,
      "[131I]": 533,
      "[SH5]": 534,
      "[VH]": 535,
      "[B+2]": 536,
      "[Yb+2]": 537,
      "[14C@H]": 538,
      "[211At]": 539,
      "[NH3+2]": 540,
      "[IrH]": 541,
      "[IrH2]": 542,
      "[Rh-]": 543,
      "[Cr-]": 544,
      "[Sb+]": 545,
      "[Ni+3]": 546,
      "[TaH3]": 547,
      "[Tl+2]": 548,
      "[64Cu]": 549,
      "[Tc]": 550,
      "[Cd+]": 551,
      "[1H]": 552,
      "[15nH]": 553,
      "[AlH2+]": 554,
      "[FH+2]": 555,
      "[BiH3]": 556,
      "[Ru-]": 557,
      "[Mo+6]": 558,
      "[AsH+]": 559,
      "[BaH2]": 560,
      "[BaH]": 561,
      "[Fe+4]": 562,
      "[229Th]": 563,
      "[Th+4]": 564,
      "[As+3]": 565,
      "[NH+3]": 566,
      "[P@H]": 567,
      "[Li-]": 568,
      "[7NaH]": 569,
      "[Bi+]": 570,
      "[PtH+2]": 571,
      "[p-]": 572,
      "[Re+5]": 573,
      "[NiH]": 574,
      "[Ni-]": 575,
      "[Xe+]": 576,
      "[Ca+]": 577,
      "[11c]": 578,
      "[Rh+4]": 579,
      "[AcH]": 580,
      "[HeH]": 581,
      "[Sc+2]": 582,
      "[Mn+]": 583,
      "[UH]": 584,
      "[14CH2]": 585,
      "[SiH4+]": 586,
      "[18OH2]": 587,
      "[Ac-]": 588,
      "[Re+4]": 589,
      "[118Sn]": 590,
      "[153Sm]": 591,
      "[P+2]": 592,
      "[9CH]": 593,
      "[9CH3]": 594,
      "[Y-]": 595,
      "[NiH2]": 596,
      "[Si+2]": 597,
      "[Mn+6]": 598,
      "[ZrH2]": 599,
      "[C-2]": 600,
      "[Bi+5]": 601,
      "[24NaH]": 602,
      "[Fr]": 603,
      "[15CH]": 604,
      "[Se+]": 605,
      "[At]": 606,
      "[P-3]": 607,
      "[124I-]": 608,
      "[CuH2-]": 609,
      "[Nb+4]": 610,
      "[Nb+3]": 611,
      "[MgH]": 612,
      "[Ir+4]": 613,
      "[67Ga+3]": 614,
      "[67Ga]": 615,
      "[13N]": 616,
      "[15OH2]": 617,
      "[2NH]": 618,
      "[Ho]": 619,
      "[Cn]": 620
    },
    "merges": []
  }
}