{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<cls>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<sep>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "WhitespaceSplit"
      }
    ]
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<cls>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<cls>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<cls>": {
        "id": "<cls>",
        "ids": [
          0
        ],
        "tokens": [
          "<cls>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          2
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": true,
    "vocab": {
      "<cls>": 0,
      "<pad>": 1,
      "<eos>": 2,
      "<unk>": 3,
      "<mask>": 4,
      "<sep>": 5,
      "<extra_special_token_0>": 6,
      "<extra_special_token_1>": 7,
      "<extra_special_token_2>": 8,
      "<extra_special_token_3>": 9,
      "<reserved_for_amino_acids_special_token_4>": 10,
      "<reserved_for_amino_acids_special_token_5>": 11,
      "<reserved_for_amino_acids_special_token_6>": 12,
      "<reserved_for_amino_acids_special_token_7>": 13,
      "<reserved_for_amino_acids_special_token_8>": 14,
      "<reserved_for_amino_acids_special_token_9>": 15,
      "<reserved_for_amino_acids_special_token_10>": 16,
      "<reserved_for_amino_acids_special_token_11>": 17,
      "<reserved_for_amino_acids_special_token_12>": 18,
      "<reserved_for_amino_acids_special_token_13>": 19,
      "<reserved_for_amino_acids_special_token_14>": 20,
      "<reserved_for_amino_acids_special_token_15>": 21,
      "<reserved_for_amino_acids_special_token_16>": 22,
      "<reserved_for_amino_acids_special_token_17>": 23,
      "<reserved_for_amino_acids_special_token_18>": 24,
      "<reserved_for_amino_acids_special_token_19>": 25,
      "<reserved_for_amino_acids_special_token_20>": 26,
      "<reserved_for_amino_acids_special_token_21>": 27,
      "<reserved_for_amino_acids_special_token_22>": 28,
      "<reserved_for_amino_acids_special_token_23>": 29,
      "<reserved_for_amino_acids_special_token_24>": 30,
      "<reserved_for_amino_acids_special_token_25>": 31,
      "<reserved_for_amino_acids_special_token_26>": 32,
      "<reserved_for_amino_acids_special_token_27>": 33,
      "<reserved_for_amino_acids_special_token_28>": 34,
      "<reserved_for_amino_acids_special_token_29>": 35,
      "<reserved_for_amino_acids_special_token_30>": 36,
      ">>": 37,
      "~": 38,
      "C": 39,
      "c": 40,
      "(": 41,
      ")": 42,
      "O": 43,
      "1": 44,
      "2": 45,
      "=": 46,
      "N": 47,
      "3": 48,
      "n": 49,
      "[C@H]": 50,
      "[C@@H]": 51,
      "4": 52,
      "F": 53,
      "[NH+]": 54,
      "S": 55,
      "o": 56,
      "Cl": 57,
      "s": 58,
      "[nH]": 59,
      "5": 60,
      "[NH2+]": 61,
      "#": 62,
      "/": 63,
      "Br": 64,
      "[C@@]": 65,
      "[C@]": 66,
      "[O-]": 67,
      "\\": 68,
      "[nH+]": 69,
      "[NH3+]": 70,
      "6": 71,
      "[n-]": 72,
      "-": 73,
      ".": 74,
      "I": 75,
      "7": 76,
      "[N+]": 77,
      "P": 78,
      "[N-]": 79,
      "[Si]": 80,
      "[2H]": 81,
      "8": 82,
      "[n+]": 83,
      "[H]": 84,
      "B": 85,
      "9": 86,
      "[c-]": 87,
      "[C-]": 88,
      "[S-]": 89,
      "[HH]": 90,
      "[Na+]": 91,
      "[B]": 92,
      "[S@]": 93,
      "[S@@]": 94,
      "[Cl-]": 95,
      "[CH]": 96,
      "%10": 97,
      "[Y]": 98,
      "[Ir]": 99,
      "[S+]": 100,
      "[P+]": 101,
      "%11": 102,
      "[C]": 103,
      "[Br-]": 104,
      "[SiH]": 105,
      "[CH-]": 106,
      "[CH2-]": 107,
      "[SiH2]": 108,
      "[IH2]": 109,
      "[CH3-]": 110,
      "[K+]": 111,
      "[I-]": 112,
      "[3H]": 113,
      "%12": 114,
      "[Se]": 115,
      "[Pt+2]": 116,
      "[Sn]": 117,
      "[Li+]": 118,
      "[cH-]": 119,
      "[Pt]": 120,
      "[V]": 121,
      "[SiH3]": 122,
      "[NH-]": 123,
      "[B-]": 124,
      "%13": 125,
      "[OH-]": 126,
      "[P@@]": 127,
      "[O+]": 128,
      "[P@]": 129,
      "[W]": 130,
      "[H-]": 131,
      "[Ge]": 132,
      "[se]": 133,
      "%14": 134,
      "[PH+]": 135,
      "[Mg+2]": 136,
      "[K]": 137,
      "[Al]": 138,
      "[CH2]": 139,
      "%15": 140,
      "[Zn+2]": 141,
      "[U]": 142,
      "[Co]": 143,
      "[O]": 144,
      "[Rb]": 145,
      "[NH4+]": 146,
      "[Zr+2]": 147,
      "p": 148,
      "[Pd+2]": 149,
      "[Pd]": 150,
      "[Ir+3]": 151,
      "[Ti]": 152,
      "[Cl+3]": 153,
      "[F-]": 154,
      "%16": 155,
      "[Fe]": 156,
      "[Fe+2]": 157,
      "[P-]": 158,
      "[OH+]": 159,
      "[Zr]": 160,
      "[s+]": 161,
      "[Ru]": 162,
      "[N@+]": 163,
      "[Ac]": 164,
      "[Cu]": 165,
      "[C+]": 166,
      "[Ca+2]": 167,
      "[N@@+]": 168,
      "[O-2]": 169,
      "[Zn]": 170,
      "[I+]": 171,
      "[Rf]": 172,
      "[18F]": 173,
      "[Cu+2]": 174,
      "%17": 175,
      "[OH2+]": 176,
      "[2HH]": 177,
      "[Ni]": 178,
      "[As]": 179,
      "[Te]": 180,
      "[Na]": 181,
      "[13CH2]": 182,
      "[13C]": 183,
      "[Tb]": 184,
      "%18": 185,
      "[NH2-]": 186,
      "[Ni+2]": 187,
      "[Cr]": 188,
      "[Cs+]": 189,
      "[Zr+4]": 190,
      "[Ar]": 191,
      "[SH+]": 192,
      "%19": 193,
      "[o+]": 194,
      "[H+]": 195,
      "[Ru+2]": 196,
      "[Zn+]": 197,
      "[Rb+]": 198,
      "[Sb]": 199,
      "[Cu+]": 200,
      "%20": 201,
      "[Ti+4]": 202,
      "[W+2]": 203,
      "[Hg]": 204,
      "[Mn]": 205,
      "[13CH3]": 206,
      "[Al+3]": 207,
      "[Mo]": 208,
      "[CH2+]": 209,
      "[Co+2]": 210,
      "%21": 211,
      "%22": 212,
      "[Hf]": 213,
      "[CH+]": 214,
      "[Rh]": 215,
      "[Re]": 216,
      "%23": 217,
      "[3HH]": 218,
      "[Y+3]": 219,
      "[Ti+2]": 220,
      "[Hf+4]": 221,
      "[PH]": 222,
      "[Ba+2]": 223,
      "[c]": 224,
      "[Ag]": 225,
      "[In]": 226,
      "[Ag+]": 227,
      "[Pb]": 228,
      "[SH2+]": 229,
      "[13CH]": 230,
      "[Pt+4]": 231,
      "[13c]": 232,
      "[Bi]": 233,
      "[13cH]": 234,
      "[Li]": 235,
      "[SH-]": 236,
      "[V+2]": 237,
      "%24": 238,
      "[Mn+2]": 239,
      "[Tl]": 240,
      "[Si-]": 241,
      "[Os]": 242,
      "%25": 243,
      "[U+2]": 244,
      "[14cH]": 245,
      "[Ga]": 246,
      "[Fe+3]": 247,
      "[AlH2]": 248,
      "[Sn+2]": 249,
      "[15NH]": 250,
      "[N]": 251,
      "[Ru+]": 252,
      "[BH3-]": 253,
      "[14C]": 254,
      "[AlH]": 255,
      "[Pd+]": 256,
      "[Ti+3]": 257,
      "[AlH3]": 258,
      "[Au]": 259,
      "%26": 260,
      "[11CH3]": 261,
      "[CH3+]": 262,
      "[Cd]": 263,
      "[PH2+]": 264,
      "[Sn+]": 265,
      "[Gd+3]": 266,
      "[pH]": 267,
      "[14c]": 268,
      "[125I]": 269,
      "%27": 270,
      "[SeH]": 271,
      "[Co+3]": 272,
      "[te]": 273,
      "b": 274,
      "[PH3+]": 275,
      "[2H-]": 276,
      "[15N]": 277,
      "%28": 278,
      "[OH3+]": 279,
      "[Zr+3]": 280,
      "[Ru+3]": 281,
      "[Cr+3]": 282,
      "[Sr+2]": 283,
      "[BH2-]": 284,
      "[14CH2]": 285,
      "[Au+]": 286,
      "[ClH+]": 287,
      "[123I]": 288,
      "%29": 289,
      "[13C@H]": 290,
      "%30": 291,
      "[Rh+2]": 292,
      "[Ca]": 293,
      "[13C@@H]": 294,
      "[IH+]": 295,
      "%31": 296,
      "[cH+]": 297,
      "%32": 298,
      "[Au+3]": 299,
      "[18O]": 300,
      "[Hg+]": 301,
      "[Cd+2]": 302,
      "[Eu]": 303,
      "[Gd]": 304,
      "%33": 305,
      "[Mg]": 306,
      "[S-2]": 307,
      "[Be+2]": 308,
      "[AsH]": 309,
      "[S@@+]": 310,
      "%34": 311,
      "[Ta]": 312,
      "[S@+]": 313,
      "[Al+]": 314,
      "[GeH]": 315,
      "[Pt+]": 316,
      "[SnH]": 317,
      "[La]": 318,
      "[Nb]": 319,
      "[Sb-]": 320,
      "[Fe+]": 321,
      "[GeH2]": 322,
      "[Pr]": 323,
      "[15n]": 324,
      "[15NH2]": 325,
      "%35": 326,
      "%36": 327,
      "[Mo+2]": 328,
      "[Si@@]": 329,
      "[Mn+3]": 330,
      "[Ti+]": 331,
      "[Se-]": 332,
      "[Si@]": 333,
      "[PH-]": 334,
      "[Ce]": 335,
      "[Ce+3]": 336,
      "[Cr+2]": 337,
      "[Fe+4]": 338,
      "[14CH3]": 339,
      "[La+3]": 340,
      "%37": 341,
      "[Os+2]": 342,
      "[SiH4]": 343,
      "%38": 344,
      "[As+]": 345,
      "[Al+2]": 346,
      "[Sb+3]": 347,
      "[131I]": 348,
      "[Cl+2]": 349,
      "[Nd]": 350,
      "[Ni+3]": 351,
      "[3H-]": 352,
      "[BH-]": 353,
      "[Rh+3]": 354,
      "%39": 355,
      "%40": 356,
      "[Nd+3]": 357,
      "[Se+]": 358,
      "[Bi+3]": 359,
      "[I+3]": 360,
      "[Sn+4]": 361,
      "[Sm]": 362,
      "[Hf+2]": 363,
      "%41": 364,
      "[Mo+4]": 365,
      "[Sn+3]": 366,
      "[11C]": 367,
      "%42": 368,
      "[Si+]": 369,
      "[Os+]": 370,
      "[Pb+2]": 371,
      "[Eu+3]": 372,
      "%43": 373,
      "%44": 374,
      "[GeH3]": 375,
      "[BH4-]": 376,
      "[Ga+3]": 377,
      "[Po]": 378,
      "[In+3]": 379,
      "[Al-]": 380,
      "[Cl+]": 381,
      "$": 382,
      "[14C@@H]": 383,
      "[Sc]": 384,
      "[Fe+6]": 385,
      "[Yb]": 386,
      "%45": 387,
      "%46": 388,
      "[14CH]": 389,
      "[c+]": 390,
      "[At]": 391,
      "[Ru+4]": 392,
      "[PH4+]": 393,
      "[Si+4]": 394,
      "[BiH2]": 395,
      "[NH]": 396,
      "[Hg+2]": 397,
      "[p+]": 398,
      "[Ba]": 399,
      "%47": 400,
      "%48": 401,
      "[14C@H]": 402,
      "[Ir+2]": 403,
      "[SiH-]": 404,
      "[I+2]": 405,
      "[GaH]": 406,
      "[18OH]": 407,
      "[AsH2]": 408,
      "[Tc]": 409,
      "[SnH3]": 410,
      "[Sc+3]": 411,
      "[SH3+]": 412,
      "[99Tc+4]": 413,
      "[124I]": 414,
      "[SnH2]": 415,
      "%49": 416,
      "[10B]": 417,
      "[Cs]": 418,
      "[BH]": 419,
      "[Ru+6]": 420,
      "[OH]": 421,
      "%50": 422,
      "[1H]": 423,
      "[Cr+6]": 424,
      "[Ta+5]": 425,
      "[Lu]": 426,
      "[Cr+]": 427,
      "[SbH]": 428,
      "[N@]": 429,
      "[Fm]": 430,
      "[Nb+5]": 431,
      "[Yb+3]": 432,
      "%51": 433,
      "%52": 434,
      "[Er]": 435,
      "[IH2+]": 436,
      "[Sg]": 437,
      "[Sm+3]": 438,
      "[Os+4]": 439,
      "[99Tc]": 440,
      "[Tl+]": 441,
      "[Fe+5]": 442,
      "[17O]": 443,
      "[N@@]": 444,
      "[Br+2]": 445,
      "%53": 446,
      "[10BH2]": 447,
      "[NaH]": 448,
      "[Ho]": 449,
      "[PH2-]": 450,
      "[13C@@]": 451,
      "[As-]": 452,
      "[15N+]": 453,
      "%54": 454,
      "[Se-2]": 455,
      "[15nH]": 456,
      "[Tb+3]": 457,
      "[si]": 458,
      "[Sr]": 459,
      "[se+]": 460,
      "[Th]": 461,
      "[Ru+5]": 462,
      "[No]": 463,
      "[13C@]": 464,
      "[99Tc+3]": 465,
      "[Te+]": 466,
      "[Xe]": 467,
      "[Lu+3]": 468,
      "[Dy]": 469,
      "[He]": 470,
      "%55": 471,
      "[Pr+3]": 472,
      "%56": 473,
      "[ClH2+]": 474,
      "%57": 475,
      "%58": 476,
      "[V+4]": 477,
      "[19F]": 478,
      "%59": 479,
      "%60": 480,
      "[Nb+2]": 481,
      "[B+]": 482,
      "[Co+]": 483,
      "[32P]": 484,
      "[Tc+4]": 485,
      "[76Br]": 486,
      "[P]": 487,
      "[Ce+4]": 488,
      "[Dy+3]": 489,
      "[Bi+2]": 490,
      "[Li-]": 491,
      "[BiH]": 492,
      "[SbH2]": 493,
      "[Er+3]": 494,
      "[TeH]": 495,
      "[Th+4]": 496,
      "[Ta+2]": 497,
      "[Cr+4]": 498,
      "[Tm]": 499,
      "[RuH]": 500,
      "[Tm+3]": 501,
      "%61": 502,
      "%62": 503,
      "[Sb+]": 504,
      "[p-]": 505,
      "[11CH2]": 506,
      "[211At]": 507,
      "%63": 508,
      "[RuH+2]": 509,
      "[Tc+3]": 510,
      "[Eu+2]": 511,
      "[Ga-]": 512,
      "[12C]": 513,
      "[GaH2]": 514,
      "[b-]": 515,
      "[S]": 516,
      "[Mo+3]": 517,
      "[InH2]": 518,
      "[Si+2]": 519,
      "[InH]": 520,
      "[18F-]": 521,
      "[Si-2]": 522,
      "[P-3]": 523,
      "[Bk]": 524,
      "[sH+]": 525,
      "%64": 526,
      "[PbH]": 527,
      "[Sn-]": 528,
      "[Pm]": 529,
      "[Cm]": 530,
      "[pH+]": 531,
      "[Cr+5]": 532,
      "%65": 533,
      "%66": 534,
      "[Lr]": 535,
      "[Pu]": 536,
      "[Ne]": 537,
      "[SH]": 538,
      "[64Cu]": 539,
      "[siH]": 540,
      "[Np]": 541,
      "[Bi+]": 542,
      "[te+]": 543,
      "[SbH3]": 544,
      "[Yb+2]": 545,
      "[AsH3]": 546,
      "[Be]": 547,
      "[Tc+5]": 548,
      "[oH+]": 549,
      "[P@@H]": 550,
      "[SeH2]": 551,
      "[XeH]": 552,
      "[Mn+]": 553,
      "[Ir-3]": 554,
      "%67": 555,
      "[As+3]": 556,
      "[Th+2]": 557,
      "[PoH]": 558,
      "%68": 559,
      "[17OH]": 560,
      "[IH]": 561,
      "[Mg+]": 562,
      "[Pa]": 563,
      "[Ir+]": 564,
      "[Os+6]": 565,
      "[Rh+]": 566,
      "[Gd+2]": 567,
      "[P-2]": 568,
      "[TlH]": 569,
      "%69": 570,
      "[U+4]": 571,
      "[PH-2]": 572,
      "[15n+]": 573,
      "[Ra]": 574,
      "[Am]": 575,
      "[Cf]": 576,
      "[64Cu+2]": 577,
      "[Ho+3]": 578,
      "[SiH2-]": 579,
      "[13C-]": 580,
      "[16O]": 581,
      "%70": 582,
      "[GeH4]": 583,
      "[Au-]": 584,
      "[BH2]": 585,
      "[n@]": 586,
      "[Si@H]": 587,
      "[35S]": 588,
      "[Ru-]": 589,
      "[RuH2]": 590,
      "[11c]": 591,
      "[AlH4-]": 592,
      "[U+3]": 593,
      "[Db]": 594,
      "[12CH2]": 595,
      "[3H+]": 596,
      "[77Br]": 597,
      "[SiH+]": 598,
      "[Co-2]": 599,
      "[Br+]": 600,
      "[Si+3]": 601,
      "[TlH2]": 602,
      "[BH3]": 603,
      "[P@+]": 604,
      "[Pt-2]": 605,
      "[12CH]": 606,
      "[Br+3]": 607,
      "[Os+5]": 608,
      "%71": 609,
      "[W+]": 610,
      "[AsH2+]": 611,
      "[BiH3]": 612,
      "[Es]": 613,
      "[RuH+3]": 614,
      "[Fe-]": 615,
      "[CuH]": 616,
      "[al]": 617,
      "[111In]": 618,
      "%72": 619,
      "[14C@]": 620,
      "[P@H]": 621,
      "[11CH]": 622,
      "[CH3]": 623,
      "[18O-]": 624,
      "[Mo+]": 625,
      "[35Cl]": 626,
      "[P@@+]": 627,
      "[Hg-2]": 628,
      "[Si@@H]": 629,
      "[ClH]": 630,
      "%73": 631,
      "%74": 632,
      "[14C@@]": 633,
      "[B@-]": 634,
      "[InH3]": 635,
      "[14n]": 636,
      "[Nb+3]": 637,
      "[Os+7]": 638,
      "[15NH3+]": 639,
      "[37Cl]": 640,
      "[B@@-]": 641,
      "[Ru+8]": 642,
      "[NiH]": 643,
      "[Cu-]": 644,
      "[Zn-2]": 645,
      "[Rn]": 646,
      "[GaH3]": 647,
      "[Mt]": 648,
      "[68Ga]": 649,
      "[PbH2]": 650,
      "[In+]": 651,
      "[18FH]": 652,
      "[RuH+]": 653,
      "[10BH]": 654,
      "[10BH-]": 655,
      "%75": 656,
      "%76": 657,
      "[PH2]": 658,
      "[13CH4]": 659,
      "[14NH]": 660,
      "[Sn@]": 661,
      "[TeH2]": 662,
      "[68Ga+3]": 663,
      "[Kr]": 664,
      "[11C-]": 665,
      "[Sb+5]": 666,
      "[177Lu]": 667,
      "[PbH2+2]": 668,
      "[s@@]": 669,
      "[s@]": 670,
      "[Tl+3]": 671,
      "[Ir-2]": 672,
      "[AlH2-]": 673,
      "[IrH+2]": 674,
      "[2H+]": 675,
      "[RuH2+2]": 676,
      "[Zn-]": 677,
      "[Tc+2]": 678,
      "[Pd-2]": 679,
      "[AsH3+]": 680,
      "[90Y]": 681,
      "[RuH3]": 682,
      "[AlH-]": 683,
      "[Ni+]": 684,
      "[10B-]": 685,
      "[Nb-]": 686,
      "[AlH+2]": 687,
      "[99Tc+5]": 688,
      "[18O-2]": 689,
      "[Sn@@]": 690,
      "[SH2]": 691,
      "[127I]": 692,
      "[Cu-2]": 693,
      "[AlH2+]": 694,
      "[16OH]": 695,
      "[PtH]": 696,
      "[80Br]": 697,
      "[14N]": 698,
      "[14nH]": 699,
      "[SnH4+2]": 700,
      "[MgH2]": 701,
      "[SeH+]": 702,
      "[99Mo]": 703,
      "*": 704,
      "[ClH2+2]": 705,
      "[6Li+]": 706,
      "[34S]": 707,
      "[si+]": 708,
      "[AlH+]": 709,
      "[AsH+]": 710,
      "[99Tc+2]": 711,
      "[OsH]": 712,
      "[188Re]": 713,
      "[SnH2+]": 714,
      "[98Tc+5]": 715,
      "[67Cu]": 716,
      "%77": 717,
      "%78": 718,
      "[123I-]": 719,
      "[125I-]": 720,
      "[17F]": 721,
      "[Ni-2]": 722,
      "[Ni-]": 723,
      "[AlH3-]": 724,
      "[Bh]": 725,
      "[111In+3]": 726,
      "[186Re]": 727,
      "[12C@@H]": 728,
      "[WH2]": 729,
      "[7Li+]": 730,
      "[Tc+]": 731,
      "[15N-]": 732,
      "[13CH2-]": 733,
      "[Pd-]": 734,
      "[SnH+]": 735,
      "[SnH+3]": 736,
      "[Al-3]": 737,
      "[131I-]": 738,
      "[SiH3-]": 739,
      "[124I-]": 740,
      "[Os-2]": 741,
      "[PbH3]": 742,
      "[SiH3+]": 743,
      "[12C@H]": 744,
      "[si-]": 745,
      "[GeH2-]": 746,
      "[bH-]": 747,
      "[MoH2]": 748,
      "[166Ho+3]": 749,
      "[Tb+4]": 750,
      "[13CH-]": 751,
      "[11B]": 752,
      "%79": 753,
      "%80": 754,
      "%81": 755,
      "%82": 756,
      "%83": 757,
      "%84": 758,
      "%85": 759,
      "[OsH2]": 760,
      "[B@]": 761,
      "[B@@]": 762,
      "[75Se]": 763,
      "[13NH3]": 764,
      "[Ge+4]": 765,
      "[Hg-]": 766,
      "[Ru-2]": 767,
      "[PoH2]": 768,
      "[SiH2+]": 769,
      "[I]": 770,
      "[67Ga+3]": 771,
      "[Tc+6]": 772,
      "[Fr]": 773,
      "[Md]": 774,
      "[SbH3+]": 775,
      "[RhH3]": 776,
      "[Pt-]": 777,
      "[177Lu+3]": 778,
      "[SeH2+]": 779,
      "[15n-]": 780,
      "[33P]": 781,
      "[77Se]": 782,
      "[67Cu+2]": 783,
      "[28Si]": 784,
      "[12cH]": 785,
      "[15NH+]": 786,
      "[P@@H+]": 787,
      "[133Xe]": 788,
      "[Fe-4]": 789,
      "[Cl]": 790,
      "[F]": 791,
      "[Te+4]": 792,
      "[14CH4]": 793,
      "[NH2]": 794,
      "[12C@]": 795,
      "[IrH2]": 796,
      "[15NH3]": 797,
      "[125Te]": 798,
      "[Ge@@]": 799,
      "[Ru-3]": 800,
      "[Te@@]": 801,
      "[35SH]": 802,
      "[TaH]": 803,
      "[13OH]": 804,
      "[99Tc+]": 805,
      "[14c-]": 806,
      "[PtH2]": 807,
      "[PtH+]": 808,
      "[153Gd]": 809,
      "[17NH]": 810,
      "[11C@H]": 811,
      "[60Co+3]": 812,
      "[RhH+2]": 813,
      "%86": 814,
      "[Ca+]": 815,
      "[ZrH2]": 816,
      "[n@@]": 817,
      "[32PH]": 818,
      "[123IH]": 819,
      "[Zr-2]": 820,
      "[Rh-3]": 821,
      "[SnH4]": 822,
      "[SnH3-]": 823,
      "[SnH3+]": 824,
      "[AtH]": 825,
      "[Se+4]": 826,
      "[51Cr]": 827,
      "[Hs]": 828,
      "[18OH2]": 829,
      "[153Sm]": 830,
      "[241Am]": 831,
      "[19BH2]": 832,
      "[12CH3]": 833,
      "[IrH3]": 834,
      "[IrH4]": 835,
      "[WH4]": 836,
      "[CuH2]": 837,
      "[SbH-]": 838,
      "[SbH2+]": 839,
      "[13CH3-]": 840,
      "[FeH]": 841,
      "[195Pt]": 842,
      "[79Br]": 843,
      "[ReH4]": 844,
      "[WH]": 845,
      "[HgH]": 846,
      "[IrH]": 847,
      "[90Y+3]": 848,
      "[14C-]": 849,
      "[Rh-]": 850,
      "[Re-2]": 851,
      "[BiH2+2]": 852,
      "[36Cl]": 853,
      "[99Tc+6]": 854,
      "[14NH2]": 855,
      "[Ti-2]": 856,
      "[13N]": 857,
      "[15NH2+]": 858,
      "[W-]": 859,
      "[164Dy+3]": 860,
      "[RuH4]": 861,
      "[al+]": 862,
      "[89Zr+4]": 863,
      "[BH2+]": 864,
      "[125IH]": 865,
      "[CaH2]": 866,
      "[11C@@H]": 867,
      "[127Xe]": 868,
      "[82Rb+]": 869,
      "[81Kr]": 870,
      "[LiH]": 871,
      "[223Ra]": 872,
      "[85Sr+2]": 873,
      "[47Ca+2]": 874,
      "[KH]": 875,
      "[Cr-2]": 876,
      "[TeH2+]": 877,
      "[SeH-]": 878,
      "[SeH3+]": 879,
      "[TeH+]": 880,
      "[TeH3]": 881,
      "[AsH5]": 882,
      "[BiH5]": 883,
      "[BiH4-]": 884,
      "[PbH4]": 885,
      "[As+5]": 886,
      "[220Rn]": 887,
      "[11CH4]": 888,
      "[32PH3]": 889,
      "[57Fe]": 890,
      "[60Co]": 891,
      "[Se+6]": 892,
      "[166Ho]": 893,
      "[Al-2]": 894,
      "[12BH2]": 895,
      "[14N+]": 896,
      "[15NH4+]": 897,
      "[13NH2]": 898,
      "[SnH2-]": 899,
      "[OsH-]": 900,
      "[BrH]": 901,
      "[15OH]": 902,
      "[Be+]": 903,
      "[13N+]": 904,
      "[CoH2]": 905,
      "[19FH]": 906,
      "[15CH2]": 907,
      "[4He]": 908,
      "[68GaH]": 909,
      "[133I]": 910,
      "[Se@@]": 911,
      "[WH3]": 912,
      "[ZrH]": 913,
      "[213Bi+3]": 914,
      "[TaH3]": 915,
      "[MoH]": 916,
      "[SnH2+2]": 917,
      "[Ge-2]": 918,
      "[FeH2]": 919,
      "[Os+8]": 920,
      "[82Br]": 921,
      "[121I]": 922,
      "[35s]": 923,
      "[Cr-]": 924,
      "[62Cu+2]": 925,
      "[15C]": 926,
      "[122I]": 927,
      "[ReH]": 928,
      "[TaH2]": 929,
      "[RhH]": 930,
      "[RhH2]": 931,
      "[ZnH2]": 932,
      "[11B-]": 933,
      "[13CH+]": 934,
      "[Pr+]": 935,
      "[KrH]": 936,
      "[75Ge]": 937,
      "[YH]": 938,
      "%87": 939,
      "%88": 940,
      "%89": 941,
      "%90": 942,
      "%91": 943,
      "%92": 944,
      "[13O]": 945,
      "[67Ga]": 946,
      "[CoH+]": 947,
      "[TiH]": 948,
      "[89Zr]": 949,
      "[31PH]": 950,
      "[VH]": 951,
      "[GeH3-]": 952,
      "[Ru-4]": 953,
      "[103Pd]": 954,
      "[CeH]": 955,
      "[NiH2]": 956,
      "[197Au]": 957,
      "[81Br]": 958,
      "[ZrH3]": 959,
      "[ZnH+]": 960,
      "[S@@-]": 961,
      "[S@@H]": 962,
      "[SnH6+3]": 963,
      "[Te-]": 964,
      "[135I]": 965,
      "[73Se]": 966,
      "[129Xe]": 967,
      "[89Sr+2]": 968,
      "[N@H+]": 969,
      "[42K+]": 970,
      "[123Te]": 971,
      "[22Na+]": 972,
      "[SrH2]": 973,
      "[15OH2]": 974,
      "[85SrH2]": 975,
      "[45Ca+2]": 976,
      "[Ag-4]": 977,
      "[82Rb]": 978,
      "[76BrH]": 979,
      "[131Cs]": 980,
      "0": 981,
      "[Cd-2]": 982,
      "[Cr-3]": 983,
      "[Fe-3]": 984,
      "[Ni-3]": 985,
      "[Fe-2]": 986,
      "[AsH3-]": 987,
      "[AsH4+]": 988,
      "[BH3+]": 989,
      "[SeH3]": 990,
      "[TeH3+]": 991,
      "[TeH4]": 992,
      "[SbH4+]": 993,
      "[SbH5]": 994,
      "[BH4+]": 995,
      "[203Hg]": 996,
      "[TlH3]": 997,
      "[Br]": 998,
      "[59Fe+3]": 999,
      "[219Rn]": 1000,
      "[Mo-2]": 1001,
      "[FeH6-4]": 1002,
      "[33PH3]": 1003,
      "[32SH2]": 1004,
      "[34SH2]": 1005,
      "[36SH2]": 1006,
      "[65Zn]": 1007,
      "[113Cd]": 1008,
      "[192Ir]": 1009,
      "[237Np]": 1010,
      "[240Pu]": 1011,
      "[227Ac]": 1012,
      "[18CH3]": 1013,
      "[31P]": 1014,
      "[FeH3]": 1015,
      "[15O]": 1016,
      "[111InH3]": 1017,
      "[22CH3-]": 1018,
      "[CoH+2]": 1019,
      "[201Hg]": 1020,
      "[12CH-]": 1021,
      "[16N+]": 1022,
      "[12N+]": 1023,
      "[9cH]": 1024,
      "[20CH3]": 1025,
      "[GaH-]": 1026,
      "[13NH]": 1027,
      "[22CH2]": 1028,
      "[AlH5-2]": 1029,
      "[10CH2]": 1030,
      "[11CH3+]": 1031,
      "[195Pt+2]": 1032,
      "[18C-]": 1033,
      "[18CH]": 1034,
      "[20C]": 1035,
      "[15CH]": 1036,
      "[9c]": 1037,
      "[10BH3]": 1038,
      "[GeH6-2]": 1039,
      "[153Gd+3]": 1040,
      "[RuH5]": 1041,
      "[BiH4]": 1042,
      "[CoH3]": 1043,
      "[Se@]": 1044,
      "[OsH6]": 1045,
      "[80Br-]": 1046,
      "[CeH3]": 1047,
      "[37ClH]": 1048,
      "[Bi-]": 1049,
      "[OsH4]": 1050,
      "[157Gd+3]": 1051,
      "[14CH3-]": 1052,
      "[64Zn+2]": 1053,
      "[Nb-2]": 1054,
      "[Os-]": 1055,
      "[165Dy]": 1056,
      "[BiH2+]": 1057,
      "[1H-]": 1058,
      "[3He]": 1059,
      "[137Cs+]": 1060,
      "[153Sm+3]": 1061,
      "[152Dy]": 1062,
      "[165Dy+3]": 1063,
      "[198Au]": 1064,
      "[159Gd+3]": 1065,
      "[94Tc]": 1066,
      "[217At]": 1067,
      "[105Rh+3]": 1068,
      "[18o]": 1069,
      "[14CH2-]": 1070,
      "[77se]": 1071,
      "[13cH-]": 1072,
      "[85Br]": 1073,
      "[59Co]": 1074,
      "[122Xe]": 1075,
      "[27Al]": 1076,
      "[7Li]": 1077,
      "[54Cr]": 1078,
      "[198Hg]": 1079,
      "[42K]": 1080,
      "[76Br-]": 1081,
      "[52Mn+2]": 1082,
      "[64Ga]": 1083,
      "[13B]": 1084,
      "[216Bi]": 1085,
      "[71As]": 1086,
      "[201Tl]": 1087,
      "[117Sn+2]": 1088,
      "[11cH]": 1089,
      "[Mn-2]": 1090,
      "[232Th]": 1091,
      "[SnH+2]": 1092,
      "[11CH3-]": 1093,
      "[197Hg]": 1094,
      "[51Cr+3]": 1095,
      "[57Co]": 1096,
      "[203Pb]": 1097,
      "[NbH2]": 1098,
      "[149Pm]": 1099,
      "[77Kr]": 1100,
      "[103Cd]": 1101,
      "[62Ni]": 1102,
      "[NbH3]": 1103,
      "[ReH3]": 1104,
      "[AlH6-3]": 1105,
      "[CrH2]": 1106,
      "[LaH3]": 1107,
      "[SmH3]": 1108,
      "[EuH3]": 1109,
      "[OsH3]": 1110,
      "[MoH5]": 1111,
      "[64Ni]": 1112,
      "[Ge@]": 1113,
      "[66Zn]": 1114,
      "[68Zn]": 1115,
      "[Ge-]": 1116,
      "[PdH2]": 1117,
      "[10c]": 1118,
      "[Tc+7]": 1119,
      "[Co-3]": 1120,
      "[29Si]": 1121,
      "[209Po]": 1122,
      "[208Po]": 1123,
      "[206Po]": 1124,
      "[204Po]": 1125,
      "[202Po]": 1126,
      "[201Po]": 1127,
      "[200Po]": 1128,
      "[199Po]": 1129,
      "[198Po]": 1130,
      "[197Po]": 1131,
      "[196Po]": 1132,
      "[195Po]": 1133,
      "[194Po]": 1134,
      "[193Po]": 1135,
      "[192Po]": 1136,
      "[191Po]": 1137,
      "[190Po]": 1138,
      "[217Po]": 1139,
      "[12C-]": 1140,
      "[12c]": 1141,
      "[SbH4]": 1142,
      "[BH+]": 1143,
      "[225Ac]": 1144,
      "[6Li]": 1145,
      "[38PH]": 1146,
      "[33PH]": 1147,
      "[40PH]": 1148,
      "[16NH]": 1149,
      "[Zr+]": 1150,
      "[PtH3]": 1151,
      "[AuH3]": 1152,
      "[XeH2]": 1153,
      "[ScH3]": 1154,
      "[10C]": 1155,
      "[ZrH2+2]": 1156,
      "[AgH]": 1157,
      "[16n+]": 1158,
      "[15nH+]": 1159,
      "[68GaH3]": 1160,
      "[18c]": 1161,
      "[17OH2]": 1162,
      "[16NH2]": 1163,
      "[8B]": 1164,
      "[PdH+]": 1165,
      "[AuH]": 1166,
      "[239Th]": 1167,
      "[186Lu]": 1168,
      "[1C@@H]": 1169,
      "[1C@H]": 1170,
      "[SH3]": 1171,
      "[S@H]": 1172,
      "[AlH4]": 1173,
      "[P+3]": 1174,
      "[Mn+4]": 1175,
      "[Pb+4]": 1176,
      "[V+5]": 1177,
      "[Ag-]": 1178,
      "[B+3]": 1179,
      "[Pb+3]": 1180,
      "[S+2]": 1181,
      "[N-3]": 1182,
      "[S+4]": 1183,
      "[Ag+2]": 1184,
      "[PH3]": 1185,
      "[Sm+2]": 1186,
      "[PH5]": 1187,
      "[C-4]": 1188,
      "[N+3]": 1189,
      "[Ir-]": 1190,
      "[C+4]": 1191,
      "[V+3]": 1192,
      "[W+6]": 1193,
      "[Ti+6]": 1194,
      "[Nd+]": 1195,
      "[Hf+3]": 1196,
      "[W+4]": 1197,
      "[LaH]": 1198,
      "[Ga+]": 1199,
      "[IH-]": 1200,
      "[U+6]": 1201,
      "[F+]": 1202,
      "[Ag+3]": 1203,
      "[PH4]": 1204,
      "[Na-]": 1205,
      "[Sb+2]": 1206,
      "[Ce+2]": 1207,
      "[Pd+3]": 1208,
      "[Cu+3]": 1209,
      "[Pd+4]": 1210,
      "[Ba+]": 1211,
      "[BrH+]": 1212,
      "[In+2]": 1213,
      "[N+2]": 1214,
      "[N@@H+]": 1215,
      "[Na-2]": 1216,
      "[Ti+5]": 1217,
      "[ArH]": 1218,
      "[SH5]": 1219,
      "[B+2]": 1220,
      "[NH3+2]": 1221,
      "[Tl+2]": 1222,
      "[Cd+]": 1223,
      "[FH+2]": 1224,
      "[Mo+6]": 1225,
      "[BaH2]": 1226,
      "[BaH]": 1227,
      "[229Th]": 1228,
      "[NH+3]": 1229,
      "[7NaH]": 1230,
      "[PtH+2]": 1231,
      "[Re+5]": 1232,
      "[Xe+]": 1233,
      "[Rh+4]": 1234,
      "[AcH]": 1235,
      "[HeH]": 1236,
      "[Sc+2]": 1237,
      "[UH]": 1238,
      "[SiH4+]": 1239,
      "[Ac-]": 1240,
      "[Re+4]": 1241,
      "[118Sn]": 1242,
      "[P+2]": 1243,
      "[9CH]": 1244,
      "[9CH3]": 1245,
      "[Y-]": 1246,
      "[Mn+6]": 1247,
      "[C-2]": 1248,
      "[Bi+5]": 1249,
      "[24NaH]": 1250,
      "[CuH2-]": 1251,
      "[Nb+4]": 1252,
      "[MgH]": 1253,
      "[Ir+4]": 1254,
      "[2NH]": 1255,
      "[Cn]": 1256
    },
    "merges": []
  }
}