{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 4,
      "content": "<cls_3d_coordinates>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 7,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 8,
      "content": "<sep>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 9,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "WhitespaceSplit"
      }
    ]
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<cls_3d_coordinates>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<cls_3d_coordinates>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<cls_3d_coordinates>": {
        "id": "<cls_3d_coordinates>",
        "ids": [
          4
        ],
        "tokens": [
          "<cls_3d_coordinates>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          5
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<cls>": 0,
      "<cls_amino_acid>": 1,
      "<cls_smiles>": 2,
      "<cls_nucleotide>": 3,
      "<cls_3d_coordinates>": 4,
      "<eos>": 5,
      "<unk>": 6,
      "<pad>": 7,
      "<sep>": 8,
      "<mask>": 9,
      "<cls_convert>": 10,
      "<cls_interact>": 11,
      "<extra_special_token_0>": 12,
      "<extra_special_token_1>": 13,
      "<extra_special_token_2>": 14,
      "<extra_special_token_3>": 15,
      "<extra_special_token_4>": 16,
      "<extra_special_token_5>": 17,
      "<extra_special_token_6>": 18,
      "<extra_special_token_7>": 19,
      "<extra_special_token_8>": 20,
      "<extra_special_token_9>": 21,
      "<extra_special_token_10>": 22,
      "<reserved_for_amino_acids_0>": 23,
      "<reserved_for_amino_acids_1>": 24,
      "<reserved_for_amino_acids_2>": 25,
      "<reserved_for_amino_acids_3>": 26,
      "<reserved_for_amino_acids_4>": 27,
      "<reserved_for_amino_acids_5>": 28,
      "<reserved_for_amino_acids_6>": 29,
      "<reserved_for_amino_acids_7>": 30,
      "<reserved_for_amino_acids_8>": 31,
      "<reserved_for_amino_acids_9>": 32,
      "<reserved_for_amino_acids_10>": 33,
      "<reserved_for_amino_acids_11>": 34,
      "<reserved_for_amino_acids_12>": 35,
      "<reserved_for_amino_acids_13>": 36,
      "<reserved_for_amino_acids_14>": 37,
      "<reserved_for_amino_acids_15>": 38,
      "<reserved_for_amino_acids_16>": 39,
      "<reserved_for_amino_acids_17>": 40,
      "<reserved_for_amino_acids_18>": 41,
      "<reserved_for_amino_acids_19>": 42,
      "<reserved_for_amino_acids_20>": 43,
      "<reserved_for_amino_acids_21>": 44,
      "<reserved_for_amino_acids_22>": 45,
      "<reserved_for_amino_acids_23>": 46,
      "<reserved_for_amino_acids_24>": 47,
      "<reserved_for_amino_acids_25>": 48,
      "<reserved_for_amino_acids_26>": 49,
      "<reserved_for_smiles_0>": 50,
      "<reserved_for_smiles_1>": 51,
      "<reserved_for_smiles_2>": 52,
      "<reserved_for_smiles_3>": 53,
      "<reserved_for_smiles_4>": 54,
      "<reserved_for_smiles_5>": 55,
      "<reserved_for_smiles_6>": 56,
      "<reserved_for_smiles_7>": 57,
      "<reserved_for_smiles_8>": 58,
      "<reserved_for_smiles_9>": 59,
      "<reserved_for_smiles_10>": 60,
      "<reserved_for_smiles_11>": 61,
      "<reserved_for_smiles_12>": 62,
      "<reserved_for_smiles_13>": 63,
      "<reserved_for_smiles_14>": 64,
      "<reserved_for_smiles_15>": 65,
      "<reserved_for_smiles_16>": 66,
      "<reserved_for_smiles_17>": 67,
      "<reserved_for_smiles_18>": 68,
      "<reserved_for_smiles_19>": 69,
      "<reserved_for_smiles_20>": 70,
      "<reserved_for_smiles_21>": 71,
      "<reserved_for_smiles_22>": 72,
      "<reserved_for_smiles_23>": 73,
      "<reserved_for_smiles_24>": 74,
      "<reserved_for_smiles_25>": 75,
      "<reserved_for_smiles_26>": 76,
      "<reserved_for_smiles_27>": 77,
      "<reserved_for_smiles_28>": 78,
      "<reserved_for_smiles_29>": 79,
      "<reserved_for_smiles_30>": 80,
      "<reserved_for_smiles_31>": 81,
      "<reserved_for_smiles_32>": 82,
      "<reserved_for_smiles_33>": 83,
      "<reserved_for_smiles_34>": 84,
      "<reserved_for_smiles_35>": 85,
      "<reserved_for_smiles_36>": 86,
      "<reserved_for_smiles_37>": 87,
      "<reserved_for_smiles_38>": 88,
      "<reserved_for_smiles_39>": 89,
      "<reserved_for_smiles_40>": 90,
      "<reserved_for_smiles_41>": 91,
      "<reserved_for_smiles_42>": 92,
      "<reserved_for_smiles_43>": 93,
      "<reserved_for_smiles_44>": 94,
      "<reserved_for_smiles_45>": 95,
      "<reserved_for_smiles_46>": 96,
      "<reserved_for_smiles_47>": 97,
      "<reserved_for_smiles_48>": 98,
      "<reserved_for_smiles_49>": 99,
      "<reserved_for_smiles_50>": 100,
      "<reserved_for_smiles_51>": 101,
      "<reserved_for_smiles_52>": 102,
      "<reserved_for_smiles_53>": 103,
      "<reserved_for_smiles_54>": 104,
      "<reserved_for_smiles_55>": 105,
      "<reserved_for_smiles_56>": 106,
      "<reserved_for_smiles_57>": 107,
      "<reserved_for_smiles_58>": 108,
      "<reserved_for_smiles_59>": 109,
      "<reserved_for_smiles_60>": 110,
      "<reserved_for_smiles_61>": 111,
      "<reserved_for_smiles_62>": 112,
      "<reserved_for_smiles_63>": 113,
      "<reserved_for_smiles_64>": 114,
      "<reserved_for_smiles_65>": 115,
      "<reserved_for_smiles_66>": 116,
      "<reserved_for_smiles_67>": 117,
      "<reserved_for_smiles_68>": 118,
      "<reserved_for_smiles_69>": 119,
      "<reserved_for_smiles_70>": 120,
      "<reserved_for_smiles_71>": 121,
      "<reserved_for_smiles_72>": 122,
      "<reserved_for_smiles_73>": 123,
      "<reserved_for_smiles_74>": 124,
      "<reserved_for_smiles_75>": 125,
      "<reserved_for_smiles_76>": 126,
      "<reserved_for_smiles_77>": 127,
      "<reserved_for_smiles_78>": 128,
      "<reserved_for_smiles_79>": 129,
      "<reserved_for_smiles_80>": 130,
      "<reserved_for_smiles_81>": 131,
      "<reserved_for_smiles_82>": 132,
      "<reserved_for_smiles_83>": 133,
      "<reserved_for_smiles_84>": 134,
      "<reserved_for_smiles_85>": 135,
      "<reserved_for_smiles_86>": 136,
      "<reserved_for_smiles_87>": 137,
      "<reserved_for_smiles_88>": 138,
      "<reserved_for_smiles_89>": 139,
      "<reserved_for_smiles_90>": 140,
      "<reserved_for_smiles_91>": 141,
      "<reserved_for_smiles_92>": 142,
      "<reserved_for_smiles_93>": 143,
      "<reserved_for_smiles_94>": 144,
      "<reserved_for_smiles_95>": 145,
      "<reserved_for_smiles_96>": 146,
      "<reserved_for_smiles_97>": 147,
      "<reserved_for_smiles_98>": 148,
      "<reserved_for_smiles_99>": 149,
      "<reserved_for_smiles_100>": 150,
      "<reserved_for_smiles_101>": 151,
      "<reserved_for_smiles_102>": 152,
      "<reserved_for_smiles_103>": 153,
      "<reserved_for_smiles_104>": 154,
      "<reserved_for_smiles_105>": 155,
      "<reserved_for_smiles_106>": 156,
      "<reserved_for_smiles_107>": 157,
      "<reserved_for_smiles_108>": 158,
      "<reserved_for_smiles_109>": 159,
      "<reserved_for_smiles_110>": 160,
      "<reserved_for_smiles_111>": 161,
      "<reserved_for_smiles_112>": 162,
      "<reserved_for_smiles_113>": 163,
      "<reserved_for_smiles_114>": 164,
      "<reserved_for_smiles_115>": 165,
      "<reserved_for_smiles_116>": 166,
      "<reserved_for_smiles_117>": 167,
      "<reserved_for_smiles_118>": 168,
      "<reserved_for_smiles_119>": 169,
      "<reserved_for_smiles_120>": 170,
      "<reserved_for_smiles_121>": 171,
      "<reserved_for_smiles_122>": 172,
      "<reserved_for_smiles_123>": 173,
      "<reserved_for_smiles_124>": 174,
      "<reserved_for_smiles_125>": 175,
      "<reserved_for_smiles_126>": 176,
      "<reserved_for_smiles_127>": 177,
      "<reserved_for_smiles_128>": 178,
      "<reserved_for_smiles_129>": 179,
      "<reserved_for_smiles_130>": 180,
      "<reserved_for_smiles_131>": 181,
      "<reserved_for_smiles_132>": 182,
      "<reserved_for_smiles_133>": 183,
      "<reserved_for_smiles_134>": 184,
      "<reserved_for_smiles_135>": 185,
      "<reserved_for_smiles_136>": 186,
      "<reserved_for_smiles_137>": 187,
      "<reserved_for_smiles_138>": 188,
      "<reserved_for_smiles_139>": 189,
      "<reserved_for_smiles_140>": 190,
      "<reserved_for_smiles_141>": 191,
      "<reserved_for_smiles_142>": 192,
      "<reserved_for_smiles_143>": 193,
      "<reserved_for_smiles_144>": 194,
      "<reserved_for_smiles_145>": 195,
      "<reserved_for_smiles_146>": 196,
      "<reserved_for_smiles_147>": 197,
      "<reserved_for_smiles_148>": 198,
      "<reserved_for_smiles_149>": 199,
      "<reserved_for_smiles_150>": 200,
      "<reserved_for_smiles_151>": 201,
      "<reserved_for_smiles_152>": 202,
      "<reserved_for_smiles_153>": 203,
      "<reserved_for_smiles_154>": 204,
      "<reserved_for_smiles_155>": 205,
      "<reserved_for_smiles_156>": 206,
      "<reserved_for_smiles_157>": 207,
      "<reserved_for_smiles_158>": 208,
      "<reserved_for_smiles_159>": 209,
      "<reserved_for_smiles_160>": 210,
      "<reserved_for_smiles_161>": 211,
      "<reserved_for_smiles_162>": 212,
      "<reserved_for_smiles_163>": 213,
      "<reserved_for_smiles_164>": 214,
      "<reserved_for_smiles_165>": 215,
      "<reserved_for_smiles_166>": 216,
      "<reserved_for_smiles_167>": 217,
      "<reserved_for_smiles_168>": 218,
      "<reserved_for_smiles_169>": 219,
      "<reserved_for_smiles_170>": 220,
      "<reserved_for_smiles_171>": 221,
      "<reserved_for_smiles_172>": 222,
      "<reserved_for_smiles_173>": 223,
      "<reserved_for_smiles_174>": 224,
      "<reserved_for_smiles_175>": 225,
      "<reserved_for_smiles_176>": 226,
      "<reserved_for_smiles_177>": 227,
      "<reserved_for_smiles_178>": 228,
      "<reserved_for_smiles_179>": 229,
      "<reserved_for_smiles_180>": 230,
      "<reserved_for_smiles_181>": 231,
      "<reserved_for_smiles_182>": 232,
      "<reserved_for_smiles_183>": 233,
      "<reserved_for_smiles_184>": 234,
      "<reserved_for_smiles_185>": 235,
      "<reserved_for_smiles_186>": 236,
      "<reserved_for_smiles_187>": 237,
      "<reserved_for_smiles_188>": 238,
      "<reserved_for_smiles_189>": 239,
      "<reserved_for_smiles_190>": 240,
      "<reserved_for_smiles_191>": 241,
      "<reserved_for_smiles_192>": 242,
      "<reserved_for_smiles_193>": 243,
      "<reserved_for_smiles_194>": 244,
      "<reserved_for_smiles_195>": 245,
      "<reserved_for_smiles_196>": 246,
      "<reserved_for_smiles_197>": 247,
      "<reserved_for_smiles_198>": 248,
      "<reserved_for_smiles_199>": 249,
      "<reserved_for_smiles_200>": 250,
      "<reserved_for_smiles_201>": 251,
      "<reserved_for_smiles_202>": 252,
      "<reserved_for_smiles_203>": 253,
      "<reserved_for_smiles_204>": 254,
      "<reserved_for_smiles_205>": 255,
      "<reserved_for_smiles_206>": 256,
      "<reserved_for_smiles_207>": 257,
      "<reserved_for_smiles_208>": 258,
      "<reserved_for_smiles_209>": 259,
      "<reserved_for_smiles_210>": 260,
      "<reserved_for_smiles_211>": 261,
      "<reserved_for_smiles_212>": 262,
      "<reserved_for_smiles_213>": 263,
      "<reserved_for_smiles_214>": 264,
      "<reserved_for_smiles_215>": 265,
      "<reserved_for_smiles_216>": 266,
      "<reserved_for_smiles_217>": 267,
      "<reserved_for_smiles_218>": 268,
      "<reserved_for_smiles_219>": 269,
      "<reserved_for_smiles_220>": 270,
      "<reserved_for_smiles_221>": 271,
      "<reserved_for_smiles_222>": 272,
      "<reserved_for_smiles_223>": 273,
      "<reserved_for_smiles_224>": 274,
      "<reserved_for_smiles_225>": 275,
      "<reserved_for_smiles_226>": 276,
      "<reserved_for_smiles_227>": 277,
      "<reserved_for_smiles_228>": 278,
      "<reserved_for_smiles_229>": 279,
      "<reserved_for_smiles_230>": 280,
      "<reserved_for_smiles_231>": 281,
      "<reserved_for_smiles_232>": 282,
      "<reserved_for_smiles_233>": 283,
      "<reserved_for_smiles_234>": 284,
      "<reserved_for_smiles_235>": 285,
      "<reserved_for_smiles_236>": 286,
      "<reserved_for_smiles_237>": 287,
      "<reserved_for_smiles_238>": 288,
      "<reserved_for_smiles_239>": 289,
      "<reserved_for_smiles_240>": 290,
      "<reserved_for_smiles_241>": 291,
      "<reserved_for_smiles_242>": 292,
      "<reserved_for_smiles_243>": 293,
      "<reserved_for_smiles_244>": 294,
      "<reserved_for_smiles_245>": 295,
      "<reserved_for_smiles_246>": 296,
      "<reserved_for_smiles_247>": 297,
      "<reserved_for_smiles_248>": 298,
      "<reserved_for_smiles_249>": 299,
      "<reserved_for_smiles_250>": 300,
      "<reserved_for_smiles_251>": 301,
      "<reserved_for_smiles_252>": 302,
      "<reserved_for_smiles_253>": 303,
      "<reserved_for_smiles_254>": 304,
      "<reserved_for_smiles_255>": 305,
      "<reserved_for_smiles_256>": 306,
      "<reserved_for_smiles_257>": 307,
      "<reserved_for_smiles_258>": 308,
      "<reserved_for_smiles_259>": 309,
      "<reserved_for_smiles_260>": 310,
      "<reserved_for_smiles_261>": 311,
      "<reserved_for_smiles_262>": 312,
      "<reserved_for_smiles_263>": 313,
      "<reserved_for_smiles_264>": 314,
      "<reserved_for_smiles_265>": 315,
      "<reserved_for_smiles_266>": 316,
      "<reserved_for_smiles_267>": 317,
      "<reserved_for_smiles_268>": 318,
      "<reserved_for_smiles_269>": 319,
      "<reserved_for_smiles_270>": 320,
      "<reserved_for_smiles_271>": 321,
      "<reserved_for_smiles_272>": 322,
      "<reserved_for_smiles_273>": 323,
      "<reserved_for_smiles_274>": 324,
      "<reserved_for_smiles_275>": 325,
      "<reserved_for_smiles_276>": 326,
      "<reserved_for_smiles_277>": 327,
      "<reserved_for_smiles_278>": 328,
      "<reserved_for_smiles_279>": 329,
      "<reserved_for_smiles_280>": 330,
      "<reserved_for_smiles_281>": 331,
      "<reserved_for_smiles_282>": 332,
      "<reserved_for_smiles_283>": 333,
      "<reserved_for_smiles_284>": 334,
      "<reserved_for_smiles_285>": 335,
      "<reserved_for_smiles_286>": 336,
      "<reserved_for_smiles_287>": 337,
      "<reserved_for_smiles_288>": 338,
      "<reserved_for_smiles_289>": 339,
      "<reserved_for_smiles_290>": 340,
      "<reserved_for_smiles_291>": 341,
      "<reserved_for_smiles_292>": 342,
      "<reserved_for_smiles_293>": 343,
      "<reserved_for_smiles_294>": 344,
      "<reserved_for_smiles_295>": 345,
      "<reserved_for_smiles_296>": 346,
      "<reserved_for_smiles_297>": 347,
      "<reserved_for_smiles_298>": 348,
      "<reserved_for_smiles_299>": 349,
      "<reserved_for_smiles_300>": 350,
      "<reserved_for_smiles_301>": 351,
      "<reserved_for_smiles_302>": 352,
      "<reserved_for_smiles_303>": 353,
      "<reserved_for_smiles_304>": 354,
      "<reserved_for_smiles_305>": 355,
      "<reserved_for_smiles_306>": 356,
      "<reserved_for_smiles_307>": 357,
      "<reserved_for_smiles_308>": 358,
      "<reserved_for_smiles_309>": 359,
      "<reserved_for_smiles_310>": 360,
      "<reserved_for_smiles_311>": 361,
      "<reserved_for_smiles_312>": 362,
      "<reserved_for_smiles_313>": 363,
      "<reserved_for_smiles_314>": 364,
      "<reserved_for_smiles_315>": 365,
      "<reserved_for_smiles_316>": 366,
      "<reserved_for_smiles_317>": 367,
      "<reserved_for_smiles_318>": 368,
      "<reserved_for_smiles_319>": 369,
      "<reserved_for_smiles_320>": 370,
      "<reserved_for_smiles_321>": 371,
      "<reserved_for_smiles_322>": 372,
      "<reserved_for_smiles_323>": 373,
      "<reserved_for_smiles_324>": 374,
      "<reserved_for_smiles_325>": 375,
      "<reserved_for_smiles_326>": 376,
      "<reserved_for_smiles_327>": 377,
      "<reserved_for_smiles_328>": 378,
      "<reserved_for_smiles_329>": 379,
      "<reserved_for_smiles_330>": 380,
      "<reserved_for_smiles_331>": 381,
      "<reserved_for_smiles_332>": 382,
      "<reserved_for_smiles_333>": 383,
      "<reserved_for_smiles_334>": 384,
      "<reserved_for_smiles_335>": 385,
      "<reserved_for_smiles_336>": 386,
      "<reserved_for_smiles_337>": 387,
      "<reserved_for_smiles_338>": 388,
      "<reserved_for_smiles_339>": 389,
      "<reserved_for_smiles_340>": 390,
      "<reserved_for_smiles_341>": 391,
      "<reserved_for_smiles_342>": 392,
      "<reserved_for_smiles_343>": 393,
      "<reserved_for_smiles_344>": 394,
      "<reserved_for_smiles_345>": 395,
      "<reserved_for_smiles_346>": 396,
      "<reserved_for_smiles_347>": 397,
      "<reserved_for_smiles_348>": 398,
      "<reserved_for_smiles_349>": 399,
      "<reserved_for_smiles_350>": 400,
      "<reserved_for_smiles_351>": 401,
      "<reserved_for_smiles_352>": 402,
      "<reserved_for_smiles_353>": 403,
      "<reserved_for_smiles_354>": 404,
      "<reserved_for_smiles_355>": 405,
      "<reserved_for_smiles_356>": 406,
      "<reserved_for_smiles_357>": 407,
      "<reserved_for_smiles_358>": 408,
      "<reserved_for_smiles_359>": 409,
      "<reserved_for_smiles_360>": 410,
      "<reserved_for_smiles_361>": 411,
      "<reserved_for_smiles_362>": 412,
      "<reserved_for_smiles_363>": 413,
      "<reserved_for_smiles_364>": 414,
      "<reserved_for_smiles_365>": 415,
      "<reserved_for_smiles_366>": 416,
      "<reserved_for_smiles_367>": 417,
      "<reserved_for_smiles_368>": 418,
      "<reserved_for_smiles_369>": 419,
      "<reserved_for_smiles_370>": 420,
      "<reserved_for_smiles_371>": 421,
      "<reserved_for_smiles_372>": 422,
      "<reserved_for_smiles_373>": 423,
      "<reserved_for_smiles_374>": 424,
      "<reserved_for_smiles_375>": 425,
      "<reserved_for_smiles_376>": 426,
      "<reserved_for_smiles_377>": 427,
      "<reserved_for_smiles_378>": 428,
      "<reserved_for_smiles_379>": 429,
      "<reserved_for_smiles_380>": 430,
      "<reserved_for_smiles_381>": 431,
      "<reserved_for_smiles_382>": 432,
      "<reserved_for_smiles_383>": 433,
      "<reserved_for_smiles_384>": 434,
      "<reserved_for_smiles_385>": 435,
      "<reserved_for_smiles_386>": 436,
      "<reserved_for_smiles_387>": 437,
      "<reserved_for_smiles_388>": 438,
      "<reserved_for_smiles_389>": 439,
      "<reserved_for_smiles_390>": 440,
      "<reserved_for_smiles_391>": 441,
      "<reserved_for_smiles_392>": 442,
      "<reserved_for_smiles_393>": 443,
      "<reserved_for_smiles_394>": 444,
      "<reserved_for_smiles_395>": 445,
      "<reserved_for_smiles_396>": 446,
      "<reserved_for_smiles_397>": 447,
      "<reserved_for_smiles_398>": 448,
      "<reserved_for_smiles_399>": 449,
      "<reserved_for_smiles_400>": 450,
      "<reserved_for_smiles_401>": 451,
      "<reserved_for_smiles_402>": 452,
      "<reserved_for_smiles_403>": 453,
      "<reserved_for_smiles_404>": 454,
      "<reserved_for_smiles_405>": 455,
      "<reserved_for_smiles_406>": 456,
      "<reserved_for_smiles_407>": 457,
      "<reserved_for_smiles_408>": 458,
      "<reserved_for_smiles_409>": 459,
      "<reserved_for_smiles_410>": 460,
      "<reserved_for_smiles_411>": 461,
      "<reserved_for_smiles_412>": 462,
      "<reserved_for_smiles_413>": 463,
      "<reserved_for_smiles_414>": 464,
      "<reserved_for_smiles_415>": 465,
      "<reserved_for_smiles_416>": 466,
      "<reserved_for_smiles_417>": 467,
      "<reserved_for_smiles_418>": 468,
      "<reserved_for_smiles_419>": 469,
      "<reserved_for_smiles_420>": 470,
      "<reserved_for_smiles_421>": 471,
      "<reserved_for_smiles_422>": 472,
      "<reserved_for_smiles_423>": 473,
      "<reserved_for_smiles_424>": 474,
      "<reserved_for_smiles_425>": 475,
      "<reserved_for_smiles_426>": 476,
      "<reserved_for_smiles_427>": 477,
      "<reserved_for_smiles_428>": 478,
      "<reserved_for_smiles_429>": 479,
      "<reserved_for_smiles_430>": 480,
      "<reserved_for_smiles_431>": 481,
      "<reserved_for_smiles_432>": 482,
      "<reserved_for_smiles_433>": 483,
      "<reserved_for_smiles_434>": 484,
      "<reserved_for_smiles_435>": 485,
      "<reserved_for_smiles_436>": 486,
      "<reserved_for_smiles_437>": 487,
      "<reserved_for_smiles_438>": 488,
      "<reserved_for_smiles_439>": 489,
      "<reserved_for_smiles_440>": 490,
      "<reserved_for_smiles_441>": 491,
      "<reserved_for_smiles_442>": 492,
      "<reserved_for_smiles_443>": 493,
      "<reserved_for_smiles_444>": 494,
      "<reserved_for_smiles_445>": 495,
      "<reserved_for_smiles_446>": 496,
      "<reserved_for_smiles_447>": 497,
      "<reserved_for_smiles_448>": 498,
      "<reserved_for_smiles_449>": 499,
      "<reserved_for_smiles_450>": 500,
      "<reserved_for_smiles_451>": 501,
      "<reserved_for_smiles_452>": 502,
      "<reserved_for_smiles_453>": 503,
      "<reserved_for_smiles_454>": 504,
      "<reserved_for_smiles_455>": 505,
      "<reserved_for_smiles_456>": 506,
      "<reserved_for_smiles_457>": 507,
      "<reserved_for_smiles_458>": 508,
      "<reserved_for_smiles_459>": 509,
      "<reserved_for_smiles_460>": 510,
      "<reserved_for_smiles_461>": 511,
      "<reserved_for_smiles_462>": 512,
      "<reserved_for_smiles_463>": 513,
      "<reserved_for_smiles_464>": 514,
      "<reserved_for_smiles_465>": 515,
      "<reserved_for_smiles_466>": 516,
      "<reserved_for_smiles_467>": 517,
      "<reserved_for_smiles_468>": 518,
      "<reserved_for_smiles_469>": 519,
      "<reserved_for_smiles_470>": 520,
      "<reserved_for_smiles_471>": 521,
      "<reserved_for_smiles_472>": 522,
      "<reserved_for_smiles_473>": 523,
      "<reserved_for_smiles_474>": 524,
      "<reserved_for_smiles_475>": 525,
      "<reserved_for_smiles_476>": 526,
      "<reserved_for_smiles_477>": 527,
      "<reserved_for_smiles_478>": 528,
      "<reserved_for_smiles_479>": 529,
      "<reserved_for_smiles_480>": 530,
      "<reserved_for_smiles_481>": 531,
      "<reserved_for_smiles_482>": 532,
      "<reserved_for_smiles_483>": 533,
      "<reserved_for_smiles_484>": 534,
      "<reserved_for_smiles_485>": 535,
      "<reserved_for_smiles_486>": 536,
      "<reserved_for_smiles_487>": 537,
      "<reserved_for_smiles_488>": 538,
      "<reserved_for_smiles_489>": 539,
      "<reserved_for_smiles_490>": 540,
      "<reserved_for_smiles_491>": 541,
      "<reserved_for_smiles_492>": 542,
      "<reserved_for_smiles_493>": 543,
      "<reserved_for_smiles_494>": 544,
      "<reserved_for_smiles_495>": 545,
      "<reserved_for_smiles_496>": 546,
      "<reserved_for_smiles_497>": 547,
      "<reserved_for_smiles_498>": 548,
      "<reserved_for_smiles_499>": 549,
      "<reserved_for_smiles_500>": 550,
      "<reserved_for_smiles_501>": 551,
      "<reserved_for_smiles_502>": 552,
      "<reserved_for_smiles_503>": 553,
      "<reserved_for_smiles_504>": 554,
      "<reserved_for_smiles_505>": 555,
      "<reserved_for_smiles_506>": 556,
      "<reserved_for_smiles_507>": 557,
      "<reserved_for_smiles_508>": 558,
      "<reserved_for_smiles_509>": 559,
      "<reserved_for_smiles_510>": 560,
      "<reserved_for_smiles_511>": 561,
      "<reserved_for_smiles_512>": 562,
      "<reserved_for_smiles_513>": 563,
      "<reserved_for_smiles_514>": 564,
      "<reserved_for_smiles_515>": 565,
      "<reserved_for_smiles_516>": 566,
      "<reserved_for_smiles_517>": 567,
      "<reserved_for_smiles_518>": 568,
      "<reserved_for_smiles_519>": 569,
      "<reserved_for_smiles_520>": 570,
      "<reserved_for_smiles_521>": 571,
      "<reserved_for_smiles_522>": 572,
      "<reserved_for_smiles_523>": 573,
      "<reserved_for_smiles_524>": 574,
      "<reserved_for_smiles_525>": 575,
      "<reserved_for_smiles_526>": 576,
      "<reserved_for_smiles_527>": 577,
      "<reserved_for_smiles_528>": 578,
      "<reserved_for_smiles_529>": 579,
      "<reserved_for_smiles_530>": 580,
      "<reserved_for_smiles_531>": 581,
      "<reserved_for_smiles_532>": 582,
      "<reserved_for_smiles_533>": 583,
      "<reserved_for_smiles_534>": 584,
      "<reserved_for_smiles_535>": 585,
      "<reserved_for_smiles_536>": 586,
      "<reserved_for_smiles_537>": 587,
      "<reserved_for_smiles_538>": 588,
      "<reserved_for_smiles_539>": 589,
      "<reserved_for_smiles_540>": 590,
      "<reserved_for_smiles_541>": 591,
      "<reserved_for_smiles_542>": 592,
      "<reserved_for_smiles_543>": 593,
      "<reserved_for_smiles_544>": 594,
      "<reserved_for_smiles_545>": 595,
      "<reserved_for_smiles_546>": 596,
      "<reserved_for_smiles_547>": 597,
      "<reserved_for_smiles_548>": 598,
      "<reserved_for_smiles_549>": 599,
      "<reserved_for_smiles_550>": 600,
      "<reserved_for_smiles_551>": 601,
      "<reserved_for_smiles_552>": 602,
      "<reserved_for_smiles_553>": 603,
      "<reserved_for_smiles_554>": 604,
      "<reserved_for_smiles_555>": 605,
      "<reserved_for_smiles_556>": 606,
      "<reserved_for_smiles_557>": 607,
      "<reserved_for_smiles_558>": 608,
      "<reserved_for_smiles_559>": 609,
      "<reserved_for_smiles_560>": 610,
      "<reserved_for_smiles_561>": 611,
      "<reserved_for_smiles_562>": 612,
      "<reserved_for_smiles_563>": 613,
      "<reserved_for_smiles_564>": 614,
      "<reserved_for_smiles_565>": 615,
      "<reserved_for_smiles_566>": 616,
      "<reserved_for_smiles_567>": 617,
      "<reserved_for_smiles_568>": 618,
      "<reserved_for_smiles_569>": 619,
      "<reserved_for_smiles_570>": 620,
      "<reserved_for_smiles_571>": 621,
      "<reserved_for_smiles_572>": 622,
      "<reserved_for_smiles_573>": 623,
      "<reserved_for_smiles_574>": 624,
      "<reserved_for_smiles_575>": 625,
      "<reserved_for_smiles_576>": 626,
      "<reserved_for_smiles_577>": 627,
      "<reserved_for_smiles_578>": 628,
      "<reserved_for_smiles_579>": 629,
      "<reserved_for_smiles_580>": 630,
      "<reserved_for_smiles_581>": 631,
      "<reserved_for_smiles_582>": 632,
      "<reserved_for_smiles_583>": 633,
      "<reserved_for_smiles_584>": 634,
      "<reserved_for_smiles_585>": 635,
      "<reserved_for_smiles_586>": 636,
      "<reserved_for_smiles_587>": 637,
      "<reserved_for_smiles_588>": 638,
      "<reserved_for_smiles_589>": 639,
      "<reserved_for_smiles_590>": 640,
      "<reserved_for_smiles_591>": 641,
      "<reserved_for_smiles_592>": 642,
      "<reserved_for_smiles_593>": 643,
      "<reserved_for_smiles_594>": 644,
      "<reserved_for_smiles_595>": 645,
      "<reserved_for_smiles_596>": 646,
      "<reserved_for_smiles_597>": 647,
      "<reserved_for_smiles_598>": 648,
      "<reserved_for_smiles_599>": 649,
      "<reserved_for_smiles_600>": 650,
      "<reserved_for_smiles_601>": 651,
      "<reserved_for_smiles_602>": 652,
      "<reserved_for_smiles_603>": 653,
      "<reserved_for_smiles_604>": 654,
      "<reserved_for_smiles_605>": 655,
      "<reserved_for_smiles_606>": 656,
      "<reserved_for_smiles_607>": 657,
      "<reserved_for_smiles_608>": 658,
      "<reserved_for_smiles_609>": 659,
      "<reserved_for_smiles_610>": 660,
      "<reserved_for_smiles_611>": 661,
      "<reserved_for_smiles_612>": 662,
      "<reserved_for_smiles_613>": 663,
      "<reserved_for_smiles_614>": 664,
      "<reserved_for_smiles_615>": 665,
      "<reserved_for_smiles_616>": 666,
      "<reserved_for_smiles_617>": 667,
      "<reserved_for_smiles_618>": 668,
      "<reserved_for_smiles_619>": 669,
      "<reserved_for_smiles_620>": 670,
      "<reserved_for_smiles_621>": 671,
      "<reserved_for_smiles_622>": 672,
      "<reserved_for_smiles_623>": 673,
      "<reserved_for_smiles_624>": 674,
      "<reserved_for_smiles_625>": 675,
      "<reserved_for_smiles_626>": 676,
      "<reserved_for_smiles_627>": 677,
      "<reserved_for_smiles_628>": 678,
      "<reserved_for_smiles_629>": 679,
      "<reserved_for_smiles_630>": 680,
      "<reserved_for_smiles_631>": 681,
      "<reserved_for_smiles_632>": 682,
      "<reserved_for_smiles_633>": 683,
      "<reserved_for_smiles_634>": 684,
      "<reserved_for_smiles_635>": 685,
      "<reserved_for_smiles_636>": 686,
      "<reserved_for_smiles_637>": 687,
      "<reserved_for_smiles_638>": 688,
      "<reserved_for_smiles_639>": 689,
      "<reserved_for_smiles_640>": 690,
      "<reserved_for_smiles_641>": 691,
      "<reserved_for_smiles_642>": 692,
      "<reserved_for_smiles_643>": 693,
      "<reserved_for_smiles_644>": 694,
      "<reserved_for_smiles_645>": 695,
      "<reserved_for_smiles_646>": 696,
      "<reserved_for_smiles_647>": 697,
      "<reserved_for_smiles_648>": 698,
      "<reserved_for_smiles_649>": 699,
      "<reserved_for_smiles_650>": 700,
      "<reserved_for_smiles_651>": 701,
      "<reserved_for_smiles_652>": 702,
      "<reserved_for_smiles_653>": 703,
      "<reserved_for_smiles_654>": 704,
      "<reserved_for_smiles_655>": 705,
      "<reserved_for_smiles_656>": 706,
      "<reserved_for_smiles_657>": 707,
      "<reserved_for_smiles_658>": 708,
      "<reserved_for_smiles_659>": 709,
      "<reserved_for_smiles_660>": 710,
      "<reserved_for_smiles_661>": 711,
      "<reserved_for_smiles_662>": 712,
      "<reserved_for_smiles_663>": 713,
      "<reserved_for_smiles_664>": 714,
      "<reserved_for_smiles_665>": 715,
      "<reserved_for_smiles_666>": 716,
      "<reserved_for_smiles_667>": 717,
      "<reserved_for_smiles_668>": 718,
      "<reserved_for_smiles_669>": 719,
      "<reserved_for_smiles_670>": 720,
      "<reserved_for_smiles_671>": 721,
      "<reserved_for_smiles_672>": 722,
      "<reserved_for_smiles_673>": 723,
      "<reserved_for_smiles_674>": 724,
      "<reserved_for_smiles_675>": 725,
      "<reserved_for_smiles_676>": 726,
      "<reserved_for_smiles_677>": 727,
      "<reserved_for_smiles_678>": 728,
      "<reserved_for_smiles_679>": 729,
      "<reserved_for_smiles_680>": 730,
      "<reserved_for_smiles_681>": 731,
      "<reserved_for_smiles_682>": 732,
      "<reserved_for_smiles_683>": 733,
      "<reserved_for_smiles_684>": 734,
      "<reserved_for_smiles_685>": 735,
      "<reserved_for_smiles_686>": 736,
      "<reserved_for_smiles_687>": 737,
      "<reserved_for_smiles_688>": 738,
      "<reserved_for_smiles_689>": 739,
      "<reserved_for_smiles_690>": 740,
      "<reserved_for_smiles_691>": 741,
      "<reserved_for_smiles_692>": 742,
      "<reserved_for_smiles_693>": 743,
      "<reserved_for_smiles_694>": 744,
      "<reserved_for_smiles_695>": 745,
      "<reserved_for_smiles_696>": 746,
      "<reserved_for_smiles_697>": 747,
      "<reserved_for_smiles_698>": 748,
      "<reserved_for_smiles_699>": 749,
      "<reserved_for_smiles_700>": 750,
      "<reserved_for_smiles_701>": 751,
      "<reserved_for_smiles_702>": 752,
      "<reserved_for_smiles_703>": 753,
      "<reserved_for_smiles_704>": 754,
      "<reserved_for_smiles_705>": 755,
      "<reserved_for_smiles_706>": 756,
      "<reserved_for_smiles_707>": 757,
      "<reserved_for_smiles_708>": 758,
      "<reserved_for_smiles_709>": 759,
      "<reserved_for_smiles_710>": 760,
      "<reserved_for_smiles_711>": 761,
      "<reserved_for_smiles_712>": 762,
      "<reserved_for_smiles_713>": 763,
      "<reserved_for_smiles_714>": 764,
      "<reserved_for_smiles_715>": 765,
      "<reserved_for_smiles_716>": 766,
      "<reserved_for_smiles_717>": 767,
      "<reserved_for_smiles_718>": 768,
      "<reserved_for_smiles_719>": 769,
      "<reserved_for_smiles_720>": 770,
      "<reserved_for_smiles_721>": 771,
      "<reserved_for_smiles_722>": 772,
      "<reserved_for_smiles_723>": 773,
      "<reserved_for_smiles_724>": 774,
      "<reserved_for_smiles_725>": 775,
      "<reserved_for_smiles_726>": 776,
      "<reserved_for_smiles_727>": 777,
      "<reserved_for_smiles_728>": 778,
      "<reserved_for_smiles_729>": 779,
      "<reserved_for_smiles_730>": 780,
      "<reserved_for_smiles_731>": 781,
      "<reserved_for_smiles_732>": 782,
      "<reserved_for_smiles_733>": 783,
      "<reserved_for_smiles_734>": 784,
      "<reserved_for_smiles_735>": 785,
      "<reserved_for_smiles_736>": 786,
      "<reserved_for_smiles_737>": 787,
      "<reserved_for_smiles_738>": 788,
      "<reserved_for_smiles_739>": 789,
      "<reserved_for_smiles_740>": 790,
      "<reserved_for_smiles_741>": 791,
      "<reserved_for_smiles_742>": 792,
      "<reserved_for_smiles_743>": 793,
      "<reserved_for_smiles_744>": 794,
      "<reserved_for_smiles_745>": 795,
      "<reserved_for_smiles_746>": 796,
      "<reserved_for_smiles_747>": 797,
      "<reserved_for_smiles_748>": 798,
      "<reserved_for_smiles_749>": 799,
      "<reserved_for_smiles_750>": 800,
      "<reserved_for_smiles_751>": 801,
      "<reserved_for_smiles_752>": 802,
      "<reserved_for_smiles_753>": 803,
      "<reserved_for_smiles_754>": 804,
      "<reserved_for_smiles_755>": 805,
      "<reserved_for_smiles_756>": 806,
      "<reserved_for_smiles_757>": 807,
      "<reserved_for_smiles_758>": 808,
      "<reserved_for_smiles_759>": 809,
      "<reserved_for_smiles_760>": 810,
      "<reserved_for_smiles_761>": 811,
      "<reserved_for_smiles_762>": 812,
      "<reserved_for_smiles_763>": 813,
      "<reserved_for_smiles_764>": 814,
      "<reserved_for_smiles_765>": 815,
      "<reserved_for_smiles_766>": 816,
      "<reserved_for_smiles_767>": 817,
      "<reserved_for_smiles_768>": 818,
      "<reserved_for_smiles_769>": 819,
      "<reserved_for_smiles_770>": 820,
      "<reserved_for_smiles_771>": 821,
      "<reserved_for_smiles_772>": 822,
      "<reserved_for_smiles_773>": 823,
      "<reserved_for_smiles_774>": 824,
      "<reserved_for_smiles_775>": 825,
      "<reserved_for_smiles_776>": 826,
      "<reserved_for_smiles_777>": 827,
      "<reserved_for_smiles_778>": 828,
      "<reserved_for_smiles_779>": 829,
      "<reserved_for_smiles_780>": 830,
      "<reserved_for_smiles_781>": 831,
      "<reserved_for_smiles_782>": 832,
      "<reserved_for_smiles_783>": 833,
      "<reserved_for_smiles_784>": 834,
      "<reserved_for_smiles_785>": 835,
      "<reserved_for_smiles_786>": 836,
      "<reserved_for_smiles_787>": 837,
      "<reserved_for_smiles_788>": 838,
      "<reserved_for_smiles_789>": 839,
      "<reserved_for_smiles_790>": 840,
      "<reserved_for_smiles_791>": 841,
      "<reserved_for_smiles_792>": 842,
      "<reserved_for_smiles_793>": 843,
      "<reserved_for_smiles_794>": 844,
      "<reserved_for_smiles_795>": 845,
      "<reserved_for_smiles_796>": 846,
      "<reserved_for_smiles_797>": 847,
      "<reserved_for_smiles_798>": 848,
      "<reserved_for_smiles_799>": 849,
      "<reserved_for_smiles_800>": 850,
      "<reserved_for_smiles_801>": 851,
      "<reserved_for_smiles_802>": 852,
      "<reserved_for_smiles_803>": 853,
      "<reserved_for_smiles_804>": 854,
      "<reserved_for_smiles_805>": 855,
      "<reserved_for_smiles_806>": 856,
      "<reserved_for_smiles_807>": 857,
      "<reserved_for_smiles_808>": 858,
      "<reserved_for_smiles_809>": 859,
      "<reserved_for_smiles_810>": 860,
      "<reserved_for_smiles_811>": 861,
      "<reserved_for_smiles_812>": 862,
      "<reserved_for_smiles_813>": 863,
      "<reserved_for_smiles_814>": 864,
      "<reserved_for_smiles_815>": 865,
      "<reserved_for_smiles_816>": 866,
      "<reserved_for_smiles_817>": 867,
      "<reserved_for_smiles_818>": 868,
      "<reserved_for_smiles_819>": 869,
      "<reserved_for_smiles_820>": 870,
      "<reserved_for_smiles_821>": 871,
      "<reserved_for_smiles_822>": 872,
      "<reserved_for_smiles_823>": 873,
      "<reserved_for_smiles_824>": 874,
      "<reserved_for_smiles_825>": 875,
      "<reserved_for_smiles_826>": 876,
      "<reserved_for_smiles_827>": 877,
      "<reserved_for_smiles_828>": 878,
      "<reserved_for_smiles_829>": 879,
      "<reserved_for_smiles_830>": 880,
      "<reserved_for_smiles_831>": 881,
      "<reserved_for_smiles_832>": 882,
      "<reserved_for_smiles_833>": 883,
      "<reserved_for_smiles_834>": 884,
      "<reserved_for_smiles_835>": 885,
      "<reserved_for_smiles_836>": 886,
      "<reserved_for_smiles_837>": 887,
      "<reserved_for_smiles_838>": 888,
      "<reserved_for_smiles_839>": 889,
      "<reserved_for_smiles_840>": 890,
      "<reserved_for_smiles_841>": 891,
      "<reserved_for_smiles_842>": 892,
      "<reserved_for_smiles_843>": 893,
      "<reserved_for_smiles_844>": 894,
      "<reserved_for_smiles_845>": 895,
      "<reserved_for_smiles_846>": 896,
      "<reserved_for_smiles_847>": 897,
      "<reserved_for_smiles_848>": 898,
      "<reserved_for_smiles_849>": 899,
      "<reserved_for_smiles_850>": 900,
      "<reserved_for_smiles_851>": 901,
      "<reserved_for_smiles_852>": 902,
      "<reserved_for_smiles_853>": 903,
      "<reserved_for_smiles_854>": 904,
      "<reserved_for_smiles_855>": 905,
      "<reserved_for_smiles_856>": 906,
      "<reserved_for_smiles_857>": 907,
      "<reserved_for_smiles_858>": 908,
      "<reserved_for_smiles_859>": 909,
      "<reserved_for_smiles_860>": 910,
      "<reserved_for_smiles_861>": 911,
      "<reserved_for_smiles_862>": 912,
      "<reserved_for_smiles_863>": 913,
      "<reserved_for_smiles_864>": 914,
      "<reserved_for_smiles_865>": 915,
      "<reserved_for_smiles_866>": 916,
      "<reserved_for_smiles_867>": 917,
      "<reserved_for_smiles_868>": 918,
      "<reserved_for_smiles_869>": 919,
      "<reserved_for_smiles_870>": 920,
      "<reserved_for_smiles_871>": 921,
      "<reserved_for_smiles_872>": 922,
      "<reserved_for_smiles_873>": 923,
      "<reserved_for_smiles_874>": 924,
      "<reserved_for_smiles_875>": 925,
      "<reserved_for_smiles_876>": 926,
      "<reserved_for_smiles_877>": 927,
      "<reserved_for_smiles_878>": 928,
      "<reserved_for_smiles_879>": 929,
      "<reserved_for_smiles_880>": 930,
      "<reserved_for_smiles_881>": 931,
      "<reserved_for_smiles_882>": 932,
      "<reserved_for_smiles_883>": 933,
      "<reserved_for_smiles_884>": 934,
      "<reserved_for_smiles_885>": 935,
      "<reserved_for_smiles_886>": 936,
      "<reserved_for_smiles_887>": 937,
      "<reserved_for_smiles_888>": 938,
      "<reserved_for_smiles_889>": 939,
      "<reserved_for_smiles_890>": 940,
      "<reserved_for_smiles_891>": 941,
      "<reserved_for_smiles_892>": 942,
      "<reserved_for_smiles_893>": 943,
      "<reserved_for_smiles_894>": 944,
      "<reserved_for_smiles_895>": 945,
      "<reserved_for_smiles_896>": 946,
      "<reserved_for_smiles_897>": 947,
      "<reserved_for_smiles_898>": 948,
      "<reserved_for_smiles_899>": 949,
      "<reserved_for_smiles_900>": 950,
      "<reserved_for_smiles_901>": 951,
      "<reserved_for_smiles_902>": 952,
      "<reserved_for_smiles_903>": 953,
      "<reserved_for_smiles_904>": 954,
      "<reserved_for_smiles_905>": 955,
      "<reserved_for_smiles_906>": 956,
      "<reserved_for_smiles_907>": 957,
      "<reserved_for_smiles_908>": 958,
      "<reserved_for_smiles_909>": 959,
      "<reserved_for_smiles_910>": 960,
      "<reserved_for_smiles_911>": 961,
      "<reserved_for_smiles_912>": 962,
      "<reserved_for_smiles_913>": 963,
      "<reserved_for_smiles_914>": 964,
      "<reserved_for_smiles_915>": 965,
      "<reserved_for_smiles_916>": 966,
      "<reserved_for_smiles_917>": 967,
      "<reserved_for_smiles_918>": 968,
      "<reserved_for_smiles_919>": 969,
      "<reserved_for_smiles_920>": 970,
      "<reserved_for_smiles_921>": 971,
      "<reserved_for_smiles_922>": 972,
      "<reserved_for_smiles_923>": 973,
      "<reserved_for_smiles_924>": 974,
      "<reserved_for_smiles_925>": 975,
      "<reserved_for_smiles_926>": 976,
      "<reserved_for_smiles_927>": 977,
      "<reserved_for_smiles_928>": 978,
      "<reserved_for_smiles_929>": 979,
      "<reserved_for_smiles_930>": 980,
      "<reserved_for_smiles_931>": 981,
      "<reserved_for_smiles_932>": 982,
      "<reserved_for_smiles_933>": 983,
      "<reserved_for_smiles_934>": 984,
      "<reserved_for_smiles_935>": 985,
      "<reserved_for_smiles_936>": 986,
      "<reserved_for_smiles_937>": 987,
      "<reserved_for_smiles_938>": 988,
      "<reserved_for_smiles_939>": 989,
      "<reserved_for_smiles_940>": 990,
      "<reserved_for_smiles_941>": 991,
      "<reserved_for_smiles_942>": 992,
      "<reserved_for_smiles_943>": 993,
      "<reserved_for_smiles_944>": 994,
      "<reserved_for_smiles_945>": 995,
      "<reserved_for_smiles_946>": 996,
      "<reserved_for_smiles_947>": 997,
      "<reserved_for_smiles_948>": 998,
      "<reserved_for_smiles_949>": 999,
      "<reserved_for_smiles_950>": 1000,
      "<reserved_for_smiles_951>": 1001,
      "<reserved_for_smiles_952>": 1002,
      "<reserved_for_smiles_953>": 1003,
      "<reserved_for_smiles_954>": 1004,
      "<reserved_for_smiles_955>": 1005,
      "<reserved_for_smiles_956>": 1006,
      "<reserved_for_smiles_957>": 1007,
      "<reserved_for_smiles_958>": 1008,
      "<reserved_for_smiles_959>": 1009,
      "<reserved_for_smiles_960>": 1010,
      "<reserved_for_smiles_961>": 1011,
      "<reserved_for_smiles_962>": 1012,
      "<reserved_for_smiles_963>": 1013,
      "<reserved_for_smiles_964>": 1014,
      "<reserved_for_smiles_965>": 1015,
      "<reserved_for_smiles_966>": 1016,
      "<reserved_for_smiles_967>": 1017,
      "<reserved_for_smiles_968>": 1018,
      "<reserved_for_smiles_969>": 1019,
      "<reserved_for_smiles_970>": 1020,
      "<reserved_for_smiles_971>": 1021,
      "<reserved_for_smiles_972>": 1022,
      "<reserved_for_smiles_973>": 1023,
      "<reserved_for_smiles_974>": 1024,
      "<reserved_for_smiles_975>": 1025,
      "<reserved_for_smiles_976>": 1026,
      "<reserved_for_smiles_977>": 1027,
      "<reserved_for_smiles_978>": 1028,
      "<reserved_for_smiles_979>": 1029,
      "<reserved_for_smiles_980>": 1030,
      "<reserved_for_smiles_981>": 1031,
      "<reserved_for_smiles_982>": 1032,
      "<reserved_for_smiles_983>": 1033,
      "<reserved_for_smiles_984>": 1034,
      "<reserved_for_smiles_985>": 1035,
      "<reserved_for_smiles_986>": 1036,
      "<reserved_for_smiles_987>": 1037,
      "<reserved_for_smiles_988>": 1038,
      "<reserved_for_smiles_989>": 1039,
      "<reserved_for_smiles_990>": 1040,
      "<reserved_for_smiles_991>": 1041,
      "<reserved_for_smiles_992>": 1042,
      "<reserved_for_smiles_993>": 1043,
      "<reserved_for_smiles_994>": 1044,
      "<reserved_for_smiles_995>": 1045,
      "<reserved_for_smiles_996>": 1046,
      "<reserved_for_smiles_997>": 1047,
      "<reserved_for_smiles_998>": 1048,
      "<reserved_for_smiles_999>": 1049,
      "<reserved_for_smiles_1000>": 1050,
      "<reserved_for_smiles_1001>": 1051,
      "<reserved_for_smiles_1002>": 1052,
      "<reserved_for_smiles_1003>": 1053,
      "<reserved_for_smiles_1004>": 1054,
      "<reserved_for_smiles_1005>": 1055,
      "<reserved_for_smiles_1006>": 1056,
      "<reserved_for_smiles_1007>": 1057,
      "<reserved_for_smiles_1008>": 1058,
      "<reserved_for_smiles_1009>": 1059,
      "<reserved_for_smiles_1010>": 1060,
      "<reserved_for_smiles_1011>": 1061,
      "<reserved_for_smiles_1012>": 1062,
      "<reserved_for_smiles_1013>": 1063,
      "<reserved_for_smiles_1014>": 1064,
      "<reserved_for_smiles_1015>": 1065,
      "<reserved_for_smiles_1016>": 1066,
      "<reserved_for_smiles_1017>": 1067,
      "<reserved_for_smiles_1018>": 1068,
      "<reserved_for_smiles_1019>": 1069,
      "<reserved_for_smiles_1020>": 1070,
      "<reserved_for_smiles_1021>": 1071,
      "<reserved_for_smiles_1022>": 1072,
      "<reserved_for_smiles_1023>": 1073,
      "<reserved_for_smiles_1024>": 1074,
      "<reserved_for_smiles_1025>": 1075,
      "<reserved_for_smiles_1026>": 1076,
      "<reserved_for_smiles_1027>": 1077,
      "<reserved_for_smiles_1028>": 1078,
      "<reserved_for_smiles_1029>": 1079,
      "<reserved_for_smiles_1030>": 1080,
      "<reserved_for_smiles_1031>": 1081,
      "<reserved_for_smiles_1032>": 1082,
      "<reserved_for_smiles_1033>": 1083,
      "<reserved_for_smiles_1034>": 1084,
      "<reserved_for_smiles_1035>": 1085,
      "<reserved_for_smiles_1036>": 1086,
      "<reserved_for_smiles_1037>": 1087,
      "<reserved_for_smiles_1038>": 1088,
      "<reserved_for_smiles_1039>": 1089,
      "<reserved_for_smiles_1040>": 1090,
      "<reserved_for_smiles_1041>": 1091,
      "<reserved_for_smiles_1042>": 1092,
      "<reserved_for_smiles_1043>": 1093,
      "<reserved_for_smiles_1044>": 1094,
      "<reserved_for_smiles_1045>": 1095,
      "<reserved_for_smiles_1046>": 1096,
      "<reserved_for_smiles_1047>": 1097,
      "<reserved_for_smiles_1048>": 1098,
      "<reserved_for_smiles_1049>": 1099,
      "<reserved_for_smiles_1050>": 1100,
      "<reserved_for_smiles_1051>": 1101,
      "<reserved_for_smiles_1052>": 1102,
      "<reserved_for_smiles_1053>": 1103,
      "<reserved_for_smiles_1054>": 1104,
      "<reserved_for_smiles_1055>": 1105,
      "<reserved_for_smiles_1056>": 1106,
      "<reserved_for_smiles_1057>": 1107,
      "<reserved_for_smiles_1058>": 1108,
      "<reserved_for_smiles_1059>": 1109,
      "<reserved_for_smiles_1060>": 1110,
      "<reserved_for_smiles_1061>": 1111,
      "<reserved_for_smiles_1062>": 1112,
      "<reserved_for_smiles_1063>": 1113,
      "<reserved_for_smiles_1064>": 1114,
      "<reserved_for_smiles_1065>": 1115,
      "<reserved_for_smiles_1066>": 1116,
      "<reserved_for_smiles_1067>": 1117,
      "<reserved_for_smiles_1068>": 1118,
      "<reserved_for_smiles_1069>": 1119,
      "<reserved_for_smiles_1070>": 1120,
      "<reserved_for_smiles_1071>": 1121,
      "<reserved_for_smiles_1072>": 1122,
      "<reserved_for_smiles_1073>": 1123,
      "<reserved_for_smiles_1074>": 1124,
      "<reserved_for_smiles_1075>": 1125,
      "<reserved_for_smiles_1076>": 1126,
      "<reserved_for_smiles_1077>": 1127,
      "<reserved_for_smiles_1078>": 1128,
      "<reserved_for_smiles_1079>": 1129,
      "<reserved_for_smiles_1080>": 1130,
      "<reserved_for_smiles_1081>": 1131,
      "<reserved_for_smiles_1082>": 1132,
      "<reserved_for_smiles_1083>": 1133,
      "<reserved_for_smiles_1084>": 1134,
      "<reserved_for_smiles_1085>": 1135,
      "<reserved_for_smiles_1086>": 1136,
      "<reserved_for_smiles_1087>": 1137,
      "<reserved_for_smiles_1088>": 1138,
      "<reserved_for_smiles_1089>": 1139,
      "<reserved_for_smiles_1090>": 1140,
      "<reserved_for_smiles_1091>": 1141,
      "<reserved_for_smiles_1092>": 1142,
      "<reserved_for_smiles_1093>": 1143,
      "<reserved_for_smiles_1094>": 1144,
      "<reserved_for_smiles_1095>": 1145,
      "<reserved_for_smiles_1096>": 1146,
      "<reserved_for_smiles_1097>": 1147,
      "<reserved_for_smiles_1098>": 1148,
      "<reserved_for_smiles_1099>": 1149,
      "<reserved_for_smiles_1100>": 1150,
      "<reserved_for_smiles_1101>": 1151,
      "<reserved_for_smiles_1102>": 1152,
      "<reserved_for_smiles_1103>": 1153,
      "<reserved_for_smiles_1104>": 1154,
      "<reserved_for_smiles_1105>": 1155,
      "<reserved_for_smiles_1106>": 1156,
      "<reserved_for_smiles_1107>": 1157,
      "<reserved_for_smiles_1108>": 1158,
      "<reserved_for_smiles_1109>": 1159,
      "<reserved_for_smiles_1110>": 1160,
      "<reserved_for_smiles_1111>": 1161,
      "<reserved_for_smiles_1112>": 1162,
      "<reserved_for_smiles_1113>": 1163,
      "<reserved_for_smiles_1114>": 1164,
      "<reserved_for_smiles_1115>": 1165,
      "<reserved_for_smiles_1116>": 1166,
      "<reserved_for_smiles_1117>": 1167,
      "<reserved_for_smiles_1118>": 1168,
      "<reserved_for_smiles_1119>": 1169,
      "<reserved_for_smiles_1120>": 1170,
      "<reserved_for_smiles_1121>": 1171,
      "<reserved_for_smiles_1122>": 1172,
      "<reserved_for_smiles_1123>": 1173,
      "<reserved_for_smiles_1124>": 1174,
      "<reserved_for_smiles_1125>": 1175,
      "<reserved_for_smiles_1126>": 1176,
      "<reserved_for_smiles_1127>": 1177,
      "<reserved_for_smiles_1128>": 1178,
      "<reserved_for_smiles_1129>": 1179,
      "<reserved_for_smiles_1130>": 1180,
      "<reserved_for_smiles_1131>": 1181,
      "<reserved_for_smiles_1132>": 1182,
